Repository: Just-Some-Bots/MusicBot
Catalog: i18n/*/LC_MESSAGES/musicbot_logs.po
Languages: it_it, pl_pl, zh_cn

source: MusicPlayer already locked for playback, this call is ignored.
it_it: MusicPlayer già bloccato per la riproduzione, questa chiamata è ignorata.
pl_pl: Odtwarzacz MusicPlayer jest już zablokowany do odtwarzania, to połączenie jest ignorowane.
zh_cn: MusicPlayer 已经锁定播放，此通话将被忽略。

source: Failed to get next entry.
it_it: Impossibile ottenere la prossima voce.
pl_pl: Nie udało się uzyskać następnego wpisu.
zh_cn: 无法获取下一个条目。

source: Failed to process entry for playback.
it_it: Impossibile elaborare la voce per la riproduzione.
pl_pl: Nie udało się przetworzyć wpisu do odtwarzania.
zh_cn: 处理播放条目失败。

source: Creating player with options: ffmpeg %(before)s -i %(input)s %(after)s
it_it: Creazione giocatore con opzioni: ffmpeg %(before)s -i %(input)s %(after)s
pl_pl: Tworzenie gracza z opcjami: ffmpeg %(before)s -i %(input)s %(after)s

source: Playing %(source)r using %(client)r
it_it: Riproduzione di %(source)r usando %(client)r
pl_pl: Odtwarzanie %(source)r przy użyciu %(client)r

source: Skipping deletion of '%s', found song in queue
it_it: Eliminazione saltata di '%s', canzone trovata in coda
pl_pl: Pominięto usunięcie '%s', znaleziono utwór w kolejce
zh_cn: 正在跳过删除'%s'，在队列中找到歌曲

source: Deleting file: %s
it_it: Eliminazione del file: %s
pl_pl: Usuwanie pliku: %s
zh_cn: 正在删除文件： %s

source: File deleted: %s
it_it: File eliminato: %s
pl_pl: Plik usunięty: %s
zh_cn: 文件已删除： %s

source: Cannot delete file, it is currently in use.
it_it: Impossibile eliminare il file, è attualmente in uso.
pl_pl: Nie można usunąć pliku, jest on obecnie w użyciu.
zh_cn: 无法删除文件，它目前正在使用。

source: Cannot delete file due to a permission error.
it_it: Impossibile eliminare il file a causa di un errore di autorizzazione.
pl_pl: Nie można usunąć pliku z powodu błędu uprawnień.
zh_cn: 由于权限错误，无法删除文件。

source: Cannot delete file, it was not found.
it_it: Impossibile eliminare il file, non è stato trovato.
pl_pl: Nie można usunąć pliku, nie został on znaleziony.
zh_cn: 无法删除文件，找不到。

source: Error while trying to delete file.
it_it: Errore durante il tentativo di eliminare il file.
pl_pl: Błąd podczas próby usunięcia pliku.
zh_cn: 删除文件时出错。

source: Could not delete file, giving up and moving on
it_it: Impossibile eliminare il file, arrendersi e spostarsi
pl_pl: Nie można usunąć pliku, zrezygnować i przenieść na
zh_cn: 无法删除文件，放弃并移动

source: Deserialize returned an object that is not a MusicPlayer: %s
it_it: Deserialize ha restituito un oggetto che non è un MusicPlayer: %s
pl_pl: Deserialize zwrócił obiekt, który nie jest MusicPlayer: %s
zh_cn: 反序列化返回的对象不是 MusicPlayer: %s

source: Failed to deserialize player
it_it: Impossibile deserializzare il giocatore
pl_pl: Nie udało się deserializować gracza
zh_cn: 无法反序列化播放器

source: Data from ffmpeg: %s
it_it: Dati da ffmpeg: %s
pl_pl: Dane z ffmpeg: %s
zh_cn: 来自 ffmpeg的数据: %s

source: Error from ffmpeg: %s
it_it: Errore da ffmpeg: %s
pl_pl: Błąd z ffmpeg: %s
zh_cn: 来自 ffmpeg的错误: %s

source: Warning from ffmpeg: %s
it_it: Attenzione da ffmpeg: %s
pl_pl: Ostrzeżenie od ffmpeg: %s
zh_cn: 来自 ffmpeg的警告: %s

source: Unknown error decoding message from ffmpeg
it_it: Messaggio di decodifica di errore sconosciuto da ffmpeg
pl_pl: Nieznany błąd dekodowania wiadomości z ffmpeg
zh_cn: 未知错误解码来自 ffmpeg 的消息

source: Decoded data from ffmpeg: %s
it_it: Dati decodificati da ffmpeg: %s
pl_pl: Dekodowane dane z ffmpeg: %s
zh_cn: 解码来自 ffmpeg的数据: %s

source: Adding stream entry for URL: %(url)s
it_it: Aggiunta voce stream per URL: %(url)s
pl_pl: Dodawanie wpisu strumienia dla URL: %(url)s

source: Could not extract information
it_it: Impossibile estrarre le informazioni
pl_pl: Nie można wyodrębnić informacji
zh_cn: 无法提取信息

source: This is a playlist.
it_it: Questa è una playlist.
pl_pl: To jest playlista.
zh_cn: 这是一个播放列表。

source: Entry info appears to be a stream, adding stream entry...
it_it: Le informazioni di immissione sembrano essere un flusso, aggiungendo voce di flusso...
pl_pl: Informacja o wpisie wydaje się być strumieniem, dodając wpis strumienia...
zh_cn: 条目信息似乎是一个流，正在添加流条目...

source: Invalid content type `%(type)s` for URL: %(url)s
it_it: Tipo di contenuto non valido `%(type)s` per URL: %(url)s
pl_pl: Nieprawidłowy typ treści `%(type)s` dla URL: %(url)s

source: Got text/html for content-type, this might be a stream.
it_it: Ottenuto testo/html per il tipo di contenuto, questo potrebbe essere un flusso.
pl_pl: Masz tekst/html dla typu zawartości, może to być strumień.
zh_cn: 获取内容类型的文本/html ，这可能是一个串流。

source: Questionable content-type "%(type)s" for url: %(url)s
it_it: Tipo di contenuto discutibile "%(type)s" per url: %(url)s
pl_pl: Pytany typ zawartości "%(type)s" dla adresu url: %(url)s

source: Adding URLPlaylistEntry for: %(subject)s
it_it: Aggiunta di URLPlaylistEntry per: %(subject)s
pl_pl: Dodawanie wpisu listy URLPlaylaylist dla: %(subject)s

source: Adding LocalFilePlaylistEntry for: %(subject)s
it_it: Aggiunta di LocalFilePlaylistEntry per: %(subject)s
pl_pl: Dodawanie LocalFilePlaylistEntry dla: %(subject)s

source: Ignored video from compound playlist link with ID: %s
it_it: Video ignorato dal collegamento composto alla scaletta con ID: %s
pl_pl: Ignorowane wideo z linku złożonej playlisty z ID: %s
zh_cn: 从与ID的复合播放列表链接忽略视频: %s

source: Not allowing entry that is in song block list: %(title)s URL: %(url)s
it_it: Non consentire la voce che è nella lista dei brani bloccati: %(title)s URL: %(url)s
pl_pl: Nie zezwala na wpis, który znajduje się na liście bloków utworu: %(title)s URL: %(url)s

source: Ignoring song in entries by '%s', duration longer than permitted maximum.
it_it: Ignorare il brano nelle voci di '%s', durata più lunga del massimo consentito.
pl_pl: Ignorowanie piosenki w wpisach '%s', czas trwania dłuższy niż dozwolony maksimum.
zh_cn: 以 '%s' 忽略条目中的歌曲，持续时间超过允许的最大值。

source: Not adding YouTube video because it is marked private or deleted: %s
it_it: Non aggiungere video YouTube perché è contrassegnato privato o cancellato: %s
pl_pl: Nie dodano filmu YouTube, ponieważ został oznaczony jako prywatny lub usunięty: %s
zh_cn: 不添加 YouTube 视频，因为它已标记为私有或已删除： %s

source: Could not add item
it_it: Impossibile aggiungere l'elemento
pl_pl: Nie można dodać elementu
zh_cn: 无法添加项目

source: Item: %s
it_it: Articolo: %s
pl_pl: Element: %s
zh_cn: 项目： %s

source: Skipped %s bad entries
it_it: Voci saltate %s errate
pl_pl: Pominięto niewłaściwe wpisy %s
zh_cn: 跳过 %s 错误条目

source: Reorder looping over entries.
it_it: Riordina il loop sopra le voci.
pl_pl: Zmień kolejność pętli nad wpisami.
zh_cn: 在条目上重新排序循环.

source: Pre-downloading next track: %r
it_it: Pre-scaricamento traccia successiva: %r
pl_pl: Wstępne pobieranie następnego utworu: %r
zh_cn: 预下载下一首曲目： %r

source: no duration data
it_it: nessun dato di durata
pl_pl: brak danych czasu trwania
zh_cn: 无持续时间数据

source: no duration data in current entry
it_it: nessun dato di durata nella voce corrente
pl_pl: brak danych czasu trwania w bieżącym wpisie
zh_cn: 当前条目中没有持续数据

source: Invalid track_data, must be of type `track` got `%(type)s`
it_it: Track_data non valido, deve essere di tipo `track` ottenuto `%(type)s`
pl_pl: Nieprawidłowy track_data, musi być typu `track` got `%(type)s`

source: Ignored non-track entry in playlist with type: %s
it_it: Elemento non tracciato ignorato nella scaletta con tipo: %s
pl_pl: Ignorowanie wpisu nieutworu na playliście z typu: %s
zh_cn: 忽略播放列表中的非轨迹条目类型： %s

source: Spotify Album total tacks: %(total)s Next URL: %(url)s
it_it: Puntate totali dell'album Spotify: %(total)s URL successivo: %(url)s
pl_pl: Łączne adresy dla albumu: %(total)s Następny URL: %(url)s

source: Getting Spotify Album Next URL: %s
it_it: Ottenere Spotify Album Prossimo URL: %s
pl_pl: Pobieranie Album Spotify Następny URL: %s
zh_cn: 获取 Spotify 相册下一个URL: %s

source: Spotify Album Object may not be complete, expected %(total)s tracks but got %(number)s
it_it: Spotify Album Object potrebbe non essere completo, atteso %(total)s brani ma ottenuto %(number)s
pl_pl: Obiekt Album Spotify może nie być kompletny, oczekiwano utworów %(total)s , ale uzyskał %(number)s

source: Spotify Album has more tracks than initial total.
it_it: Spotify Album ha più tracce del totale iniziale.
pl_pl: Album Spotify ma więcej utworów niż początkowa suma.
zh_cn: Spotify 相册比初始总数更多。

source: Spotify Playlist total tacks: %(total)s Next URL: %(url)s
it_it: Punteggi totali della scaletta Spotify: %(total)s URL successivo: %(url)s
pl_pl: Łączne adresy na liście odtwarzania Spotify %(total)s Następny URL: %(url)s

source: Getting Spotify Playlist Next URL: %s
it_it: Ottenere Playlist Spotify Prossimo URL: %s
pl_pl: Pobierz Spotify Playlist Następny URL: %s
zh_cn: 获取 Spotify 播放列表下一个URL: %s

source: Spotify Playlist Object may not be complete, expected %(total)s tracks but got %(number)s
it_it: Spotify Playlist Object potrebbe non essere completo, atteso %(total)s brani ma ottenuto %(number)s
pl_pl: Obiekt Spotify Playlist może nie być ukończony, oczekiwano utworów %(total)s , ale uzyskał %(number)s

source: Spotify Playlist has more tracks than initial total.
it_it: Spotify Playlist ha più tracce del totale iniziale.
pl_pl: Lista odtwarzania Spotify ma więcej utworów niż początkowa suma.
zh_cn: Spotify播放列表比初始播放列表更多的曲目。

source: Spotify Playlist contained %s usable tracks.
it_it: Spotify Playlist conteneva tracce utilizzabili %s.
pl_pl: Lista odtwarzania Spotify zawierała użyteczne utwory %s.
zh_cn: Spotify播放列表包含 %s 可用曲目。

source: Response status is not OK: [%(status)s] %(reason)s
it_it: Lo stato della risposta non va bene: [%(status)s] %(reason)s
pl_pl: Status odpowiedzi nie jest OK: [%(status)s] %(reason)s

source: Response JSON did not decode to a dict!
it_it: La risposta JSON non ha decodificato un detto!
pl_pl: Odpowiedź JSON nie zdekodowała na dykt!
zh_cn: 响应 JSON 没有解码到一个口令！

source: Failed making GET request to url: %s
it_it: Creazione della richiesta GET all'url non riuscita: %s
pl_pl: Nie udało się wysłać żądania GET do adresu url: %s
zh_cn: 向 url 发出GET 请求失败: %s

source: Could not make GET to URL: %(url)s Reason: %(raw_error)s
it_it: Impossibile rendere GET all'URL: %(url)s Motivo: %(raw_error)s
pl_pl: Nie można utworzyć GET do URL: %(url)s Powód: %(raw_error)s

source: Failed making POST request to url: %s
it_it: Creazione della richiesta POST all'url non riuscita: %s
pl_pl: Nie udało się wysłać żądania POST do adresu URL: %s
zh_cn: 向 url 发出POST 请求失败: %s

source: Could not make POST to URL: %(url)s Reason: %(raw_error)s
it_it: Impossibile rendere POST all'URL: %(url)s Motivo: %(raw_error)s
pl_pl: Nie można utworzyć POST na adres URL: %(url)s Powód: %(raw_error)s

source: Failed to get a guest token from Spotify, please try specifying client ID and client secret
it_it: Impossibile ottenere un token ospite da Spotify, si prega di provare a specificare l'ID client e il segreto client
pl_pl: Nie udało się uzyskać tokenu gościa ze Spotify, spróbuj określić identyfikator klienta i sekret klienta
zh_cn: 无法从 Spotify 获取访客令牌，请尝试指定客户端 ID 和客户端密钥

source: Created a new Guest Mode access token.
it_it: Creato un nuovo token di accesso in modalità ospite.
pl_pl: Utworzono nowy token dostępu do trybu gościa.
zh_cn: 创建了新访客模式访问令牌。

source: API response did not contain the expected data. Missing key: %(raw_error)s
it_it: La risposta API non contiene i dati attesi. Chiave mancante: %(raw_error)s
pl_pl: Odpowiedź API nie zawiera oczekiwanych danych. Brakuje klucza: %(raw_error)s

source: API response contained unexpected data. %(raw_error)s
it_it: La risposta API conteneva dati inattesi. %(raw_error)s
pl_pl: Odpowiedź API zawiera nieoczekiwane dane. %(raw_error)s

source: Requested a token from Spotify, did not end up getting one
it_it: Richiesto un token da Spotify, non è finito per ottenere uno
pl_pl: Żądany token ze Spotify nie został pobrany
zh_cn: 从 Spotify 请求一个令牌，最终没有得到一个

source: Created a new Client Mode access token.
it_it: Creato un nuovo token di accesso alla modalità client.
pl_pl: Utworzono nowy token dostępu do trybu klienta.
zh_cn: 创建了新客户端模式访问令牌。

source: API response status is not OK: [%(status)s] %(reason)s
it_it: Lo stato della risposta API non va bene: [%(status)s] %(reason)s
pl_pl: Status odpowiedzi API nie jest OK: [%(status)s] %(reason)s

source: Failed to get Spotify Guest Token.
it_it: Impossibile ottenere il Token di Spotify Ospite.
pl_pl: Nie udało się uzyskać tokenu gościa Spotify.
zh_cn: 获取 Spotify 访客令牌失败。

source: Failed to get Guest Token due to: %(raw_error)s
it_it: Impossibile ottenere il Token ospite a causa di: %(raw_error)s
pl_pl: Nie udało się uzyskać tokenu gości ze względu na: %(raw_error)s

source: Only the owner can use this command.
it_it: Solo il proprietario può usare questo comando.
pl_pl: Tylko właściciel może użyć tego polecenia.
zh_cn: 只有所有者可以使用此命令。

source: Only dev users can use this command.
it_it: Solo gli utenti dev possono usare questo comando.
pl_pl: Tylko deweloperzy mogą używać tej komendy.
zh_cn: 只有dev 用户可以使用此命令。

source: Cannot count members when voice_channel is None.
it_it: Impossibile contare i membri quando voice_channel è Nessuno.
pl_pl: Nie można liczyć członków, gdy kanał głosowy nie jest żadny.
zh_cn: 语音频道无时无法计数成员。

source: Failed to save ytdlp oauth2 token data due to: %s
it_it: Impossibile salvare i dati del token ytdlp oauth2 a causa di: %s
pl_pl: Nie udało się zapisać danych tokenu oauth2 ytdlp ze względu na: %s
zh_cn: 保存 ytdlp ooth2 令牌数据失败，原因是： %s

source: Loading YouTube TV OAuth2 token data.
it_it: Caricamento dei dati token OAuth2 di YouTube TV.
pl_pl: Wczytywanie danych tokenu YouTube TV OAuth2.
zh_cn: 正在加载 YouTube TV OAuth2 令牌数据。

source: Failed to load ytdlp oauth2 token data due to: %s
it_it: Caricamento dei dati del token ytdlp oauth2 non riuscito a causa di: %s
pl_pl: Nie udało się załadować danych tokenów oauth2 ytdlp z powodu: %s
zh_cn: 无法加载 ytdlp ooth2 令牌数据，原因是： %s

source: Storing YouTube TV OAuth2 token data
it_it: Memorizzazione dati token OAuth2 di YouTube TV
pl_pl: Przechowywanie danych tokenu YouTube TV OAuth2
zh_cn: 存储 YouTube TV OAuth2 令牌数据

source: Invalid cached OAuth2 token data.
it_it: Dati token OAuth2 nella cache non validi.
pl_pl: Nieprawidłowe dane tokenu OAuth2.
zh_cn: 无效缓存 OAuth2 令牌数据。

source: Access token expired, refreshing
it_it: Token di accesso scaduto, aggiornamento
pl_pl: Token dostępu wygasł, odświeżanie
zh_cn: 访问令牌已过期，正在刷新

source: YouTube cookies have been provided, but OAuth2 is being used. If you encounter problems, stop providing YouTube cookies to yt-dlp.
it_it: I cookie di YouTube sono stati forniti, ma viene utilizzato OAuth2. In caso di problemi, smetta di fornire i cookie di YouTube a yt-dlp.
pl_pl: Pliki cookie YouTube zostały dostarczone, ale OAuth2 są używane. Jeśli napotkasz problemy, przestań dostarczać pliki cookie YouTube do yt-dlp.
zh_cn: YouTube cookie 已经提供，但是OAuth2 正在使用。如果您遇到问题，停止提供 YouTube cookie 到 yt-dlp。

source: Refreshing YouTube TV oauth2 token...
it_it: Aggiornamento token di YouTube TV oauth2...
pl_pl: Odświeżanie tokenu oauth2 YouTube...
zh_cn: 正在刷新 YouTube TV oauth2 令牌...

source: Failed to refresh OAuth2 access token due to: %s Restarting authorization flow...
it_it: Impossibile aggiornare il token di accesso OAuth2 a causa di: %s Riavvio del flusso di autorizzazione...
pl_pl: Nie udało się odświeżyć tokenu dostępu OAuth2 ze względu na: %s Restartowanie przepływu autoryzacji...
zh_cn: 无法刷新 OAuth2 访问令牌，原因是： %s 重新启动授权流程...

source: Starting oauth2 flow...
it_it: Avvio flusso oauth2...
pl_pl: Uruchamianie przepływu oauth2 ...
zh_cn: 正在启动 oauth2 流程...

source: NOTICE: To give yt-dlp access to your account, visit: %s Then enter this authorization code: %s You have %s seconds to complete authorization.
it_it: AVVISO: Per dare accesso yt-dlp al tuo account, visita: %s Quindi inserisci questo codice di autorizzazione: %s Hai %s secondi per completare l'autorizzazione.
pl_pl: NOTICE: Aby dać yt-dlp dostęp do Twojego konta, odwiedzina: %s Następnie wprowadź kod autoryzacji: %s Masz %s sekund, aby ukończyć autoryzację.

source: The application may hang until authorization time out if closed at this point. This is normal.
it_it: L'applicazione può essere sospesa fino al tempo di autorizzazione se chiusa a questo punto. Ciò è normale.
pl_pl: Wniosek może być zawieszony do czasu zakończenia autoryzacji, jeśli jest zamknięty w tym punkcie.
zh_cn: 如果此时关闭，应用程序可以挂断直到授权超时。这是正常的。

source: Timed out while waiting for OAuth2 token.
it_it: Tempo scaduto durante l'attesa del token OAuth2.
pl_pl: Przekroczono limit czasu oczekiwania na token OAuth2.
zh_cn: 等待 OAuth2 令牌时超时。

source: The device code has expired, restarting authorization flow for yt-dlp.
it_it: Il codice del dispositivo è scaduto, riavviare il flusso di autorizzazione per yt-dlp.
pl_pl: Kod urządzenia wygasł, uruchamia ponownie przepływ autoryzacji dla yt-dlp.
zh_cn: 设备代码已过期，正在为yt-dlp重启授权流程。

source: Yt-dlp OAuth2 authorization successful.
it_it: Autorizzazione Yt-dlp OAuth2 riuscita.
pl_pl: Autoryzacja Yt-dlp OAuth2 zakończona pomyślnie.
zh_cn: Yt-dlp OAuth2 授权成功。

source: Adding OAuth2 Plugin to Yt-dlp IE: %s
it_it: Aggiunta del plugin OAuth2 a Yt-dlp IE: %s
pl_pl: Dodawanie wtyczki OAuth2 do Yt-dlp IE: %s
zh_cn: 将 OAuth2 插件添加到 Yt-dlp IE: %s

source: Default Yt-dlp Clients: %s
it_it: Client Yt-dlp Predefiniti: %s
pl_pl: Domyślni klienci Yt-dlp: %s
zh_cn: 默认 Yt-dlp 客户端: %s

source: Could not find git executable.
it_it: Impossibile trovare git eseguibile.
pl_pl: Nie można znaleźć pliku wykonywalnego git
zh_cn: 找不到 git 可执行文件。

source: Attempting to upgrade with `git pull` on current path.
it_it: Tentativo di aggiornare con `git pull` sul percorso corrente.
pl_pl: Próba uaktualnienia z `git pull` na bieżącej ścieżce.
zh_cn: 尝试使用当前路径上的 git 脉冲进行升级。

source: Result of git pull: %s
it_it: Risultato di git pull: %s
pl_pl: Wynik ściągnięcia git %s
zh_cn: git 脉冲的结果: %s

source: Upgrade failed, you need to run `git pull` manually.
it_it: Aggiornamento non riuscito, è necessario eseguire `git pull` manualmente.
pl_pl: Aktualizacja nie powiodła się, musisz uruchomić `git pull` ręcznie.
zh_cn: 升级失败，您需要手动运行 `git pull` 。

source: Cannot execute pip.
it_it: Impossibile eseguire pip.
pl_pl: Nie można wykonać pip.
zh_cn: 无法执行管道。

source: Error using -m method
it_it: Errore nell'utilizzo del metodo -m
pl_pl: Błąd przy użyciu metody -m
zh_cn: 使用 -m 方法出错

source: PIP failed while calling sub-process.
it_it: PIP non è riuscito durante la chiamata del sottoprocesso.
pl_pl: PIP nie powiodło się podczas podprocesu połączenia.
zh_cn: 调用子进程时PIP失败。

source: PIP failed due to Permission Error.
it_it: PIP non riuscito a causa di errore di autorizzazione.
pl_pl: PIP nie powiodło się z powodu błędu uprawnień.
zh_cn: 由于权限错误，PIP失败。

source: PIP failed due to missing Python executable? (%s)
it_it: PIP non riuscito a causa di Python eseguibile? (%s)
pl_pl: PIP nie powiódł się z powodu braku pliku wykonywalnego Pythona?%s)
zh_cn: PIP因缺少Python 可执行文件而失败？(%s)

source: PIP failed due to OSError.
it_it: PIP non è riuscito a causa di OSError.
pl_pl: PIP nie powiódł się z powodu OSError.
zh_cn: 由于OS错误，PIP失败。

source: Could not decode pip update report JSON.
it_it: Impossibile decodificare il rapporto di aggiornamento pip JSON.
pl_pl: Nie można dekodować raportu aktualizacji pip JSON.
zh_cn: 无法解码 pipp 更新报告 JSON

source: Cannot locate or execute python -m pip
it_it: Impossibile individuare o eseguire python -m pip
pl_pl: Nie można zlokalizować ani wykonać Python -m pip
zh_cn: 无法定位或执行 python -m pip

source: Attempting to upgrade with `%s` on current path...
it_it: Tentativo di aggiornare con `%s` sul percorso corrente...
pl_pl: Próba uaktualnienia z `%s` na bieżącej ścieżce...
zh_cn: 尝试在当前路径上使用%s升级...

source: Result of pip upgrade: %s
it_it: Risultato dell'aggiornamento dei pip: %s
pl_pl: Wynik ulepszenia pipy: %s
zh_cn: 螺丝刀升级结果: %s

source: Result exit code from pip upgrade: %s
it_it: Risultato codice di uscita dal pip upgrade: %s
pl_pl: Kod wyjścia wyniku z aktualizacji pip: %s
zh_cn: 从 pip 升级中退出代码: %s

source: Upgrade failed to execute or we could not understand the output
it_it: Aggiornamento non riuscito a eseguire o non siamo riusciti a capire l'output
pl_pl: Aktualizacja nie powiodła się lub nie mogliśmy zrozumieć wyjścia
zh_cn: 升级失败，或者我们无法理解输出

source: You may need to run `%s` manually.
it_it: Potrebbe essere necessario eseguire `%s` manualmente.
pl_pl: Może być konieczne ręczne uruchomienie `%s`.
zh_cn: 您可能需要手动运行 `%s'。

source: Press enter to continue . . .
it_it: Premere Invio per continuare . . .
pl_pl: Naciśnij Enter, aby kontynuować . . . .
zh_cn: 按回车键继续

source: Starting sanity checks
it_it: Iniziare controlli di sanità
pl_pl: Rozpoczęcie kontroli sanitarnej
zh_cn: 开始智能检查

source: Required checks passed.
it_it: Controlli richiesti superati.
pl_pl: Przesłano wymagane sprawdzenia.
zh_cn: 所需检查通过。

source: Skipped checking for updates.
it_it: Controllo degli aggiornamenti saltato.
pl_pl: Pominięto sprawdzanie aktualizacji.
zh_cn: 跳过检查更新。

source: Optional checks passed.
it_it: Controlli facoltativi superati.
pl_pl: Kontrole opcjonalne minęły.
zh_cn: 可选检查通过。

source: Checking for Python 3.8+
it_it: Controllo per Python 3.8+
pl_pl: Sprawdzanie języka Python 3.8+
zh_cn: 正在检查 Python 3.8+

source: Python 3.8+ is required. This version is %s
it_it: Python 3.8+ è obbligatorio. Questa versione è %s
pl_pl: Python 3.8+ jest wymagany. Ta wersja to %s
zh_cn: Python 3.8+ 是必需的。此版本是 %s

source: Attempting to locate Python 3.8...
it_it: Tentativo di localizzare Python 3.8...
pl_pl: Próba zlokalizowania Pythona 3.8...
zh_cn: 正在尝试找到 Python 3.8...

source: Could not locate py.exe
it_it: Impossibile individuare py.exe
pl_pl: Nie można zlokalizować py.exe
zh_cn: 无法定位py.exe

source: Could not execute `py.exe -3.8`
it_it: Impossibile eseguire `py.exe -3.8`
pl_pl: Nie można uruchomić pliku `py.exe -3.8`
zh_cn: 无法执行 py.exe -3.8`

source: Python 3 found. Launching bot...
it_it: Python 3 trovato. Avvio bot...
pl_pl: Znaleziono Python 3. Uruchamianie bota...
zh_cn: Python 3找到。正在启动机器人...

source: Trying "python3.8"
it_it: Provare "piton3.8"
pl_pl: Próba „python3.8”
zh_cn: 尝试"python3.8"

source: Could not locate python3.8 on path.
it_it: Impossibile individuare python3.8 sul percorso.
pl_pl: Nie można zlokalizować python3.8 na ścieżce.
zh_cn: 无法在路径上找到 python3.8

source: Python 3.8 found. Re-launching bot using: %s run.py
it_it: Python 3.8 trovato. Riavvio del bot utilizzando: %s run.py
pl_pl: Python 3.8 Znaleziono. Ponowne uruchamianie bota przy użyciu: %s run.py
zh_cn: Python 3.8已经找到。正在重启机器人使用： %s run.py

source: Could not find Python 3.8 or higher. Please run the bot using Python 3.8
it_it: Impossibile trovare Python 3.8 o superiore. Esegui il bot usando Python 3.8
pl_pl: Nie można znaleźć Pythona 3.8 lub wyższego. Uruchom bota za pomocą Pythona 3.8
zh_cn: 找不到 Python 3.8 或更高版本。请使用 Python 3.8 运行机器人。

source: Ensuring we're in the right environment
it_it: Garantire che ci troviamo nell'ambiente giusto
pl_pl: Zagwarantowanie właściwego otoczenia
zh_cn: 确保我们处于正确的环境

source: Failed environment check, %s
it_it: Controllo ambiente non riuscito, %s
pl_pl: Sprawdzanie środowiska nie powiodło się, %s
zh_cn: 环境检查失败， %s

source: Detected FFmpeg is installed at: %s
it_it: FFmpeg rilevato è installato a: %s
pl_pl: Wykryte FFmpeg jest zainstalowany w: %s
zh_cn: 检测到的 FFmpeg 安装于: %s

source: Adding local bins/ folder environment PATH for bundled ffmpeg...
it_it: Aggiunta ambiente bins/ cartella locale PATH per ffmpeg...
pl_pl: Dodawanie lokalnych binów / folderów środowiska PATH dla pakietów ffmpeg...
zh_cn: 正在为捆绑的 ffpeg添加本地bins/文件夹环境PATH ...
