Repository: Just-Some-Bots/MusicBot
Catalog: i18n/*/LC_MESSAGES/musicbot_messages.po
Languages: it_it, sv_se

source: Error locating config. Problem: Could not find or create a config file due to an error: %(raw_error)s Solution: Verify the config folder and files exist and can be read by MusicBot.
it_it: Errore nella localizzazione della configurazione. Problema: Impossibile trovare o creare un file di configurazione a causa di un errore: %(raw_error)s Soluzione: Verifica che la cartella di configurazione e i file esistano e possono essere letti da MusicBot.
sv_se: Fel vid lokalisering av konfiguration. Problem: Kunde inte hitta eller skapa en konfigurationsfil på grund av ett fel: %(raw_error)s Lösning: Verifiera konfigurationsmappen och filerna finns och kan läsas av MusicBot.

source: Error loading config. Problem: MusicBot could not read config file due to an error: %(raw_error)s Solution: Make sure the file is accessible and error free. Copy the example file from the repo if all else fails.
it_it: Errore nel caricamento della configurazione. Problema: MusicBot non ha potuto leggere il file di configurazione a causa di un errore: %(raw_error)s Soluzione: Assicurarsi che il file sia accessibile e privo di errori. Copiare il file di esempio dal repo se tutto il resto fallisce.
sv_se: Fel vid laddning av konfiguration. Problem: MusicBot kunde inte läsa konfigurationsfilen på grund av ett fel: %(raw_error)s Lösning: Se till att filen är tillgänglig och felfri. Kopiera exempelfilen från repo om allt annat misslyckas.

source: Error loading config value. Problem: The owner ID in [%(section)s] > %(option)s is not valid. Solution: Set %(option)s to a numerical ID or set it to `auto` or `0` for automatic owner binding.
it_it: Errore nel caricamento del valore di configurazione. Problema: L'ID proprietario in [%(section)s] > %(option)s non è valido. Soluzione: Imposta %(option)s su un ID numerico o impostalo su `auto` o `0` per il binding automatico del proprietario.
sv_se: Fel vid laddning av konfigurationsvärde. Problem: Ägar-ID i [%(section)s] > %(option)s är inte giltigt. Solution: sätt %(option)s till ett numeriskt ID eller sätt det till `auto` eller `0` för automatisk ägarbindning.

source: Error loading config value. Problem: The config option [%(section)s] > %(option)s is not a valid file location. Solution: Check the path setting and make sure the file exists and is accessible to MusicBot.
it_it: Errore nel caricamento del valore di configurazione. Problema: L'opzione di configurazione [%(section)s] > %(option)s non è una posizione valida del file. Soluzione: Controlla l'impostazione del percorso e assicurati che il file esista ed sia accessibile a MusicBot.
sv_se: Fel vid laddning av konfigurationsvärde. Problem: Konfigurationsalternativet [%(section)s] > %(option)s är inte en giltig filplats. Lösning: Kontrollera sökvägsinställningen och se till att filen finns och är tillgänglig för MusicBot.

source: Error loading config value. Problem: One of the IDs in option [%(section)s] > %(option)s is invalid. Solution: Ensure all IDs are numerical, and separated only by spaces or commas.
it_it: Errore nel caricamento del valore di configurazione. Problema: Uno degli ID nell'opzione [%(section)s] > %(option)s non è valido. Soluzione: Assicurati che tutti gli ID siano numerici e separati solo da spazi o virgole.
sv_se: Fel vid laddning av konfigurationsvärde. Problem: Ett av ID:n i alternativet [%(section)s] > %(option)s är ogiltigt. Lösning: Se till att alla ID är numeriska, och separeras endast med mellanslag eller kommatecken.

source: HEAD seems to have no headers...
it_it: HEAD sembra non avere intestazioni...
sv_se: HEAD verkar inte ha några rubriker...

source: Song info extraction returned no data.
it_it: L'estrazione di informazioni brano non ha restituito dati.
sv_se: Song info extrahering returnerade inga data.

source: Cannot continue extraction, event loop is closed.
it_it: Impossibile continuare l'estrazione, il ciclo dell'evento è chiuso.
sv_se: Kan inte fortsätta extraktionen, händelseslingan är stängd.

source: Spotify URL is invalid or not supported.
it_it: Spotify URL non è valido o non supportato.
sv_se: Spotify-URL är ogiltig eller stöds inte.

source: Error in yt-dlp while downloading data: %(raw_error)s
it_it: Errore in yt-dlp durante il download dei dati: %(raw_error)s
sv_se: Fel i yt-dlp vid nedladdning av data: %(raw_error)s

source: Cannot stream an invalid URL.
it_it: Impossibile trasmettere un URL non valido.
sv_se: Kan inte strömma en ogiltig URL.

source: The local media file could not be found.
it_it: Impossibile trovare il file multimediale locale.
sv_se: Den lokala mediefilen kunde inte hittas.

source: Cannot download Spotify links, processing error with type: %(type)s
it_it: Impossibile scaricare i collegamenti di Spotify, errore di elaborazione con il tipo: %(type)s
sv_se: Kan inte ladda ner Spotify-länkar, bearbetningsfel med typ: %(type)s

source: Download did not complete due to an error: %(raw_error)s
it_it: Il download non è stato completato a causa di un errore: %(raw_error)s
sv_se: Nedladdningen slutfördes inte på grund av ett fel: %(raw_error)s

source: Download failed due to a yt-dlp error: %(raw_error)s
it_it: Download fallito a causa di un errore yt-dlp: %(raw_error)s
sv_se: Nedladdning misslyckades på grund av ett yt-dlp fel: %(raw_error)s

source: Download failed due to an unhandled exception: %(raw_error)s
it_it: Download fallito a causa di un'eccezione non gestita: %(raw_error)s
sv_se: Nedladdning misslyckades på grund av ett ohanterat undantag: %(raw_error)s

source: Failed to extract data for the requested media.
it_it: Estrazione dei dati per il supporto richiesto non riuscita.
sv_se: Det gick inte att extrahera data för de begärda medierna.

source: List of command names allowed for use, separated by spaces. Sub-command access can be controlled by adding _ and the sub-command name. That is `config_set` grants only the `set` sub-command of the config command. This option overrides CommandBlacklist if set.
it_it: Elenco di nomi di comando consentiti per l'uso, separati da spazi. L'accesso al sottocomando può essere controllato aggiungendo _ e il nome del sottocomando. Questo è `config_set` concede solo il sottocomando `set` del comando di configurazione. Questa opzione sovrascrive CommandBlacklist se impostato.
sv_se: Lista över kommandonamn tillåtna för användning, separerade med mellanslag. Åtkomst till underkommando kan kontrolleras genom att lägga till _ och underkommandonamn. Det är `config_set` ger endast `set`-underkommandot för konfigurationskommandot. Detta alternativ åsidosätter CommandBlacklist om satt.

source: List of command names denied from use, separated by spaces. Will not work if CommandWhitelist is set!
it_it: Elenco dei nomi dei comandi negati dall'uso, separati da spazi. non funzionerà se CommandWhitelist è impostato!
sv_se: Lista över kommandonamn som nekas från användning, separerade med mellanslag. Fungerar inte om CommandWhitelist är satt!

source: When enabled, CommandBlacklist and CommandWhitelist are used together. Only commands in the whitelist are allowed, however sub-commands may be denied by the blacklist.
it_it: Quando abilitato, CommandBlacklist e CommandWhitelist sono usati insieme. Solo i comandi nella whitelist sono permessi, tuttavia i sottocomandi possono essere negati dalla blacklist.
sv_se: När detta är aktiverat används CommandBlacklist och CommandWhitelist tillsammans. Endast kommandon i vitlistan är tillåtna, men underkommandon kan nekas av svartlistan.

source: List of command names that can only be used while in the same voice channel as MusicBot. Some commands will always require the user to be in voice, regardless of this list. Command names should be separated by spaces.
it_it: Elenco dei nomi dei comandi che possono essere usati solo nello stesso canale vocale di MusicBot. Alcuni comandi richiederanno sempre che l'utente sia nella voce, indipendentemente da questa lista. I nomi dei comandi dovrebbero essere separati da spazi.
sv_se: Lista över kommandonamn som bara kan användas när du är i samma röstkanal som MusicBot. Vissa kommandon kräver alltid att användaren är i röst, oavsett denna lista. Kommandonamn bör separeras med mellanslag.

source: List of Discord server role IDs that are granted this permission group. This option is ignored if UserList is set.
it_it: Elenco degli ID del ruolo del server Discord a cui è concesso questo gruppo di autorizzazioni. Questa opzione viene ignorata se UserList è impostata.
sv_se: Lista över Discords serverrolls-ID som beviljas denna behörighetsgrupp. Detta alternativ ignoreras om användarlistan är inställd.

source: List of Discord member IDs that are granted permissions in this group. This option overrides GrantToRoles.
it_it: Elenco degli ID membri di Discord a cui sono concesse le autorizzazioni in questo gruppo. Questa opzione sostituisce GrantToRoles.
sv_se: Lista över Discord-medlems-ID som beviljas behörigheter i denna grupp. Detta alternativ åsidosätter GrantToRoles.

source: Maximum number of songs a user is allowed to queue. A value of 0 means unlimited.
it_it: Numero massimo di brani che un utente può mettere in coda. Un valore di 0 significa illimitato.
sv_se: Maximalt antal låtar en användare får köa. Ett värde på 0 betyder obegränsad.

source: Maximum length of a song in seconds. A value of 0 means unlimited. This permission may not be enforced if song duration is not available.
it_it: Lunghezza massima di un brano in secondi. Un valore di 0 significa illimitato. Questa autorizzazione potrebbe non essere applicata se la durata del brano non è disponibile.
sv_se: Maximal längd på en låt på några sekunder. Värdet 0 betyder obegränsad. Denna behörighet kan inte tillämpas om låtens varaktighet inte är tillgänglig.

source: Maximum number of songs a playlist is allowed to have when queued. A value of 0 means unlimited.
it_it: Numero massimo di brani che una scaletta può avere quando è in coda. Un valore di 0 significa illimitato.
sv_se: Maximalt antal låtar en spellista får ha när den köas. Ett värde på 0 betyder obegränsad.

source: The maximum number of items that can be returned in a search.
it_it: Il numero massimo di elementi che possono essere restituiti in una ricerca.
sv_se: Det maximala antalet artiklar som kan returneras i en sökning.

source: Allow users to queue playlists, or multiple songs at once.
it_it: Consenti agli utenti di mettere in coda le playlist, o più brani contemporaneamente.
sv_se: Tillåt användare att köa spellistor, eller flera låtar på en gång.

source: Allow users to skip without voting, if LegacySkip config option is enabled.
it_it: Consenti agli utenti di saltare senza voto, se l'opzione LegacySkip config è abilitata.
sv_se: Tillåt användare att hoppa över utan röstning, om alternativet LegacySkip är aktiverat.

source: Allows the user to skip a looped song.
it_it: Consente all'utente di saltare un brano in loop.
sv_se: Tillåter användaren att hoppa över en loopad låt.

source: Allows the user to remove any song from the queue. Does not remove or skip currently playing songs.
it_it: Consente all'utente di rimuovere qualsiasi brano dalla coda. non rimuove o salta i brani correntemente in riproduzione.
sv_se: Tillåter användaren att ta bort någon låt från kön. Ta inte bort eller hoppa över för närvarande spelar låtar.

source: Skip songs added by users who are not in voice when their song is played.
it_it: Salta le canzoni aggiunte dagli utenti che non sono in voce quando la loro canzone viene riprodotta.
sv_se: Hoppa över låtar som lagts till av användare som inte är i röst när deras låt spelas.

source: Allows the user to add songs to the queue when Karaoke Mode is enabled.
it_it: Consente all'utente di aggiungere brani alla coda quando la modalità Karaoke è abilitata.
sv_se: Tillåter användaren att lägga till låtar i kön när Karaokeläget är aktiverat.

source: Auto summon to user voice channel when using play commands, if bot isn't in voice already. The summon command must still be allowed for this group!
it_it: Chiamata automatica al canale vocale utente quando si usano i comandi di riproduzione, se il bot non è già nella voce. Il comando summon deve essere ancora consentito per questo gruppo!
sv_se: Automatiskt anropa till användarens röstkanal när du använder spelkommandon, om bot inte redan är i röst. Tillkallelsekommandot måste fortfarande tillåtas för denna grupp!

source: Specify yt-dlp extractor names, separated by spaces, that are allowed to be used. When empty, hard-coded defaults are used. The defaults are displayed above, but may change between versions. To allow all extractors, add `%(allow_all)s` without quotes to the list. Services/extractors supported by yt-dlp are listed here: https://github.com/yt-dlp/yt-dlp/blob/master/supportedsites.md MusicBot also provides one custom service `spotify:musicbot` to enable or disable Spotify API extraction. NOTICE: MusicBot might not support all services available to yt-dlp!
it_it: Specifica i nomi degli estrattori yt-dlp, separati da spazi, che possono essere usati. Quando vengono usati valori predefiniti vuoti e codificati in modo rigido. I valori predefiniti sono mostrati sopra, ma possono cambiare tra le versioni. Per consentire a tutti gli estrattori, aggiungi `%(allow_all)s` senza virgolette alla lista. Services/extractors supportati da yt-dlp sono elencati qui: https://github.com/yt-dlp/yt-dlp/blob/master/supportedsites. d MusicBot fornisce anche un servizio personalizzato `spotify:musicbot` per abilitare o disabilitare l'estrazione delle API di Spotify. AVVISO: MusicBot potrebbe non supportare tutti i servizi disponibili per yt-dlp!
sv_se: Ange yt-dlp extraktörnamn, separerade med mellanslag, som tillåts att användas. När det är tomt används hårdkodade standardinställningar. Standardinställningarna visas ovan, men kan ändras mellan versioner. För att tillåta alla extraherare, lägg till `%(allow_all)s` utan citat till listan. Services/extractors supported by yt-dlp are listed here: https://github.com/yt-dlp/yt-dlp/blob/master/supportedsites. d MusicBot erbjuder också en anpassad tjänst `spotify:musicbot` för att aktivera eller inaktivera Spotify API-extraktion. NOTICE: MusicBot kanske inte stöder alla tjänster som är tillgängliga för yt-dlp!

source: You do not have permission to play the requested media. The yt-dlp extractor `%(extractor)s` is not permitted in your group.
it_it: Non hai il permesso di riprodurre il supporto richiesto. L'estrattore yt-dlp `%(extractor)s` non è permesso nel tuo gruppo.
sv_se: Du har inte behörighet att spela de begärda medierna. yt-dlp extractor `%(extractor)s` är inte tillåtet i din grupp.

source: Could not extract information
it_it: Impossibile estrarre le informazioni
sv_se: Kunde inte extrahera information

source: This is a playlist.
it_it: Questa è una playlist.
sv_se: Detta är en spellista.

source: Invalid content type `%(type)s` for URL: %(url)s
it_it: Tipo di contenuto non valido `%(type)s` per URL: %(url)s
sv_se: Ogiltig innehållstyp `%(type)s` för URL: %(url)s

source: no duration data
it_it: nessun dato di durata
sv_se: ingen varaktighet data

source: no duration data in current entry
it_it: nessun dato di durata nella voce corrente
sv_se: ingen varaktighet i aktuell post

source: Invalid track_data, must be of type `track` got `%(type)s`
it_it: Track_data non valido, deve essere di tipo `track` ottenuto `%(type)s`
sv_se: Ogiltig track_data, måste vara av typen `track` fick `%(type)s`

source: Response status is not OK: [%(status)s] %(reason)s
it_it: Lo stato della risposta non va bene: [%(status)s] %(reason)s
sv_se: Svarsstatus är inte OK: [%(status)s] %(reason)s

source: Response JSON did not decode to a dict!
it_it: La risposta JSON non ha decodificato un detto!
sv_se: Svar JSON avkodade inte till en dict!

source: Could not make GET to URL: %(url)s Reason: %(raw_error)s
it_it: Impossibile rendere GET all'URL: %(url)s Motivo: %(raw_error)s
sv_se: Kunde inte göra GET till URL: %(url)s Orsak: %(raw_error)s

source: Could not make POST to URL: %(url)s Reason: %(raw_error)s
it_it: Impossibile rendere POST all'URL: %(url)s Motivo: %(raw_error)s
sv_se: Kunde inte göra POST till URL: %(url)s Orsak: %(raw_error)s

source: Failed to get a guest token from Spotify, please try specifying client ID and client secret
it_it: Impossibile ottenere un token ospite da Spotify, si prega di provare a specificare l'ID client e il segreto client
sv_se: Det gick inte att hämta en gästtoken från Spotify, försök ange klient-ID och klienthemlighet

source: API response did not contain the expected data. Missing key: %(raw_error)s
it_it: La risposta API non contiene i dati attesi. Chiave mancante: %(raw_error)s
sv_se: API-svaret innehöll inte förväntade data. Saknad nyckel: %(raw_error)s

source: API response contained unexpected data. %(raw_error)s
it_it: La risposta API conteneva dati inattesi. %(raw_error)s
sv_se: API-svar innehöll oväntade data. %(raw_error)s

source: Requested a token from Spotify, did not end up getting one
it_it: Richiesto un token da Spotify, non è finito per ottenere uno
sv_se: Begärda en token från Spotify, slutade inte få en

source: API response status is not OK: [%(status)s] %(reason)s
it_it: Lo stato della risposta API non va bene: [%(status)s] %(reason)s
sv_se: API-svarsstatus är inte OK: [%(status)s] %(reason)s

source: Only the owner can use this command.
it_it: Solo il proprietario può usare questo comando.
sv_se: Endast ägaren kan använda detta kommando.

source: Only dev users can use this command.
it_it: Solo gli utenti dev possono usare questo comando.
sv_se: Endast utvecklaranvändare kan använda detta kommando.
