Repository: Just-Some-Bots/MusicBot
Catalog: i18n/*/LC_MESSAGES/musicbot_logs.po
Languages: it_it, pl_pl, zh_cn

source: MusicBot could not locate FFmpeg binary in your environment. Please install FFmpeg so it is available in your environment PATH variable.
it_it: MusicBot non ha potuto individuare il binario FFmpeg nel tuo ambiente. Si prega di installare FFmpeg in modo che sia disponibile nella variabile PATH del tuo ambiente.
pl_pl: MusicBot nie mógł zlokalizować binarnego FFmpeg w twoim środowisku. Zainstaluj FFmpeg aby był dostępny w zmiennej PATH w środowisku.

source: On Windows, you can add a pre-compiled EXE to the MusicBot `bin` folder, or you can install FFmpeg system-wide using WinGet or by running the install.bat file.
it_it: Su Windows, puoi aggiungere una EXE pre-compilata alla cartella `bin` di MusicBot, o è possibile installare FFmpeg a livello di sistema utilizzando WinGet o eseguendo l'installazione. al file.
pl_pl: W systemie Windows możesz dodać wstępnie skompilowane EXE do folderu `bin` MusicBot, lub możesz zainstalować system FFmpeg za pomocą WinGet lub uruchamiając instalację. w pliku.
zh_cn: 在 Windows上，您可以将事先编译的 EXE 添加到 MusicBot `bin` 文件夹。 或者您可以通过 WinGet 或通过运行安装来安装 FFmpeg 。 在文件中。

source: On MacOS, you may be able to install FFmpeg via homebrew. Otherwise, check the official FFmpeg site for build or install steps.
it_it: Su MacOS, potresti essere in grado di installare FFmpeg tramite homebrew. Altrimenti, controlla il sito ufficiale FFmpeg per creare o installare i passaggi.
pl_pl: Na MacOS, możesz być w stanie zainstalować FFmpeg przez homebrew. W przeciwnym razie sprawdź oficjalną stronę FFmpeg w celu budowy lub zainstalowania kroków.

source: On Linux, many distros make FFmpeg available via system package managers. Check for ffmpeg with your system package manager or build from sources.
it_it: Su Linux, molte distribuzioni rendono FFmpeg disponibile tramite i gestori dei pacchetti di sistema. Verifica la presenza di ffmpeg con il gestore dei pacchetti di sistema o compila da sorgenti.
pl_pl: Na Linuksie, wiele distrosów udostępnia FFmpeg za pośrednictwem menedżerów pakietów systemowych. Sprawdź ffmpeg w menedżerze pakietów systemowych lub buduj z źródeł.

source: Less than %sMB of free space remains on this device
it_it: Rimangono meno di %sMB di spazio libero su questo dispositivo
pl_pl: Na tym urządzeniu pozostaje mniej niż %sMB wolnego miejsca
zh_cn: 此设备上剩余的剩余空间小于 %sMB

source: Checking for updates to MusicBot or dependencies...
it_it: Verifica aggiornamenti a MusicBot o dipendenze...
pl_pl: Sprawdzanie aktualizacji MusicBot lub zależności...
zh_cn: 正在检查对 MusicBot 或依赖关系的更新...

source: No MusicBot updates available via `git` command.
it_it: Nessun aggiornamento MusicBot disponibile tramite il comando `git`.
pl_pl: Brak aktualizacji MusicBot dostępnych za pomocą polecenia `git`.
zh_cn: 没有通过 `git` 命令提供的 MusicBot 更新。

source: Could not check for updates using `git` commands. You should check manually.
it_it: Impossibile controllare gli aggiornamenti usando i comandi `git`. Dovresti controllare manualmente.
pl_pl: Nie można sprawdzić aktualizacji używając komend `git`. Powinieneś sprawdzić ręcznie.
zh_cn: 无法使用 'git' 命令检查更新。您应该手动检查。

source: The following packages can be updated:
it_it: I seguenti pacchetti possono essere aggiornati:
pl_pl: Następujące pakiety mogą być aktualizowane:
zh_cn: 以下软件包可以更新：

source: %s to version: %s
it_it: %s alla versione: %s
pl_pl: %s do wersji: %s
zh_cn: %s 到版本: %s

source: No dependency updates available via `pip` command.
it_it: Nessun aggiornamento delle dipendenze disponibile tramite il comando `pip`.
pl_pl: Brak aktualizacji zależności dostępnych za pomocą polecenia `pip`.
zh_cn: 无法通过 `pip` 命令更新依赖信息。

source: Could not check for updates using `pip` commands. You should check manually.
it_it: Impossibile controllare gli aggiornamenti usando i comandi `pip`. Dovresti controllare manualmente.
pl_pl: Nie można sprawdzić aktualizacji używając komend `pip`. Powinieneś sprawdzić ręcznie.
zh_cn: 无法使用 "pip" 命令检查更新。您应该手动检查。

source: You can run a guided update by using the command: %s ./update.py
it_it: È possibile eseguire un aggiornamento guidato utilizzando il comando: %s ./update.py
pl_pl: Możesz uruchomić aktualizację z przewodnikiem używając polecenia: %s ./update.py
zh_cn: 您可以使用命令运行一个指导更新： %s ./update.py

source: Value is above the maximum limit.
it_it: Il valore è superiore al limite massimo.
pl_pl: Wartość jest wyższa od maksymalnego limitu.
zh_cn: 值高于最大限制。

source: Value must not be negative.
it_it: Il valore non deve essere negativo.
pl_pl: Wartość nie może być ujemna.
zh_cn: 值不能为负值。

source: Value for Max Logs Kept must be a number from 0 to %s
it_it: Valore per Max Logs Kept deve essere un numero da 0 a %s
pl_pl: Wartość maks. zachowanych dzienników musi być liczbą od 0 do %s
zh_cn: 最大日志的值必须是 0 到 %s 的数字

source: Log level '%s' is not available.
it_it: Il livello di log '%s' non è disponibile.
pl_pl: Poziom logowania '%s' jest niedostępny.
zh_cn: 日志关卡 '%s不可用。

source: Log Level must be one of: %s
it_it: Il livello di log deve essere uno di: %s
pl_pl: Poziom dziennika musi być jednym z: %s
zh_cn: 日志级别必须是: %s

source: Launch a music playing discord bot built using discord.py, youtubeDL, and ffmpeg.
it_it: Avviare un bot discord per la visualizzazione musicale costruito utilizzando discord.py, youtubeDL, e ffmpeg.
pl_pl: Uruchom muzykę odtwarzającego bota Discorda zbudowanego za pomocą Discord.py, youtubeDL i ffmpeg.
zh_cn: 启动使用 discord.py, youtubeDL 和 ffmpeg 构建的音乐播放机器人。

source: Available via Github:
it_it: Disponibile tramite Github:
pl_pl: Dostępne przez Github:
zh_cn: 通过 Github：

source: For more help and support with this bot, join our discord:
it_it: Per più aiuto e supporto con questo bot, unisciti alla nostra discorda:
pl_pl: Aby uzyskać więcej pomocy i wsparcia z tym botem, dołącz do naszego discorda:
zh_cn: 为了获得更多的帮助和支持，加入我们的不和：

source: This software is provided under the MIT License.
it_it: Questo software è fornito sotto la licenza MIT.
pl_pl: Oprogramowanie to jest dostępne na licencji MIT.
zh_cn: 这种软件是根据MIT许可证提供的。

source: See the `LICENSE` text file for complete details.
it_it: Vedere il file di testo `LICENSE` per dettagli completi.
pl_pl: Zobacz plik tekstowy `LICENSE` w celu uzyskania pełnych informacji.
zh_cn: 详情请参阅`LICENSE`文本文件。

source: Override the default / system detected language for all text in MusicBot.
it_it: Sovrascrivi la lingua predefinita / rilevata dal sistema per tutto il testo in MusicBot.
pl_pl: Zastąp domyślny / system wykryty dla całego tekstu w MusicBot.
zh_cn: 覆盖 MusicBot 中所有文本的默认值/系统。

source: Use this language for all server-side log messages from MusicBot.
it_it: Usa questa lingua per tutti i messaggi di registro del server da MusicBot.
pl_pl: Użyj tego języka dla wszystkich wiadomości dziennika po stronie serwera z MusicBot.
zh_cn: 对于来自 MusicBot 的所有服务器端日志消息使用此语言。

source: Use this language for all messages sent to discord from MusicBot. This does not prevent per-guild language selection.
it_it: Usa questa lingua per tutti i messaggi inviati a discord da MusicBot. Questo non impedisce la selezione della lingua per gilda.
pl_pl: Użyj tego języka dla wszystkich wiadomości wysyłanych do Discorda z MusicBot. To nie zapobiega wybraniu języka dla gildii.
zh_cn: 对于来自 MusicBot 发送到不和的所有消息使用此语言。 这并不阻止每个公会语言的选择。

source: Print the MusicBot version information and exit.
it_it: Stampare le informazioni sulla versione di MusicBot ed uscire.
pl_pl: Wydrukuj informacje o wersji MusicBot i wyjdź.
zh_cn: 打印MusicBot 版本信息并退出。

source: Skip all optional startup checks, including the update check.
it_it: Salta tutti i controlli di avvio opzionali, incluso il controllo di aggiornamento.
pl_pl: Pomiń wszystkie opcjonalne kontrole uruchomienia, w tym sprawdzanie aktualizacji.
zh_cn: 跳过所有可选的启动检查，包括更新检查。

source: Skip only the disk space check at startup.
it_it: Salta solo il controllo dello spazio su disco all'avvio.
pl_pl: Pomiń tylko sprawdzanie miejsca na dysku przy starcie.
zh_cn: 启动时仅跳过磁盘空间检查。

source: Skip only the update check at startup.
it_it: Salta solo il controllo di aggiornamento all'avvio.
pl_pl: Pomiń tylko sprawdzanie aktualizacji przy starcie.
zh_cn: 在启动时仅跳过更新检查。

source: Disable MusicBot from trying to install dependencies when it cannot import them.
it_it: Disabilita MusicBot dal tentativo di installare le dipendenze quando non può importarle.
pl_pl: Wyłącz MusicBot z próby zainstalowania zależności, gdy nie może ich zaimportować.
zh_cn: 禁用 MusicBot 在无法导入时无法安装依赖项。

source: Specify how many log files to keep, between 0 and %s inclusive. (Default: %s)
it_it: Specifica quanti file di registro mantenere, tra 0 e %s inclusi. (Predefinito: %s)
pl_pl: Określ ile plików dziennika chcesz zachować, pomiędzy 0 a %s włącznie. (Domyślnie: %s)
zh_cn: 指定要保存多少日志文件，介于 0 到 %s 之间。(默认： %s)

source: Override the log level settings set in config. Must be one of: %s
it_it: Sovrascrivi le impostazioni del livello di log impostate nella configurazione. Deve essere una di: %s
pl_pl: Zastąp ustawienia poziomu dziennika ustawione w konfiguracji. Musi być jednym z: %s
zh_cn: 覆盖配置中设置的日志级别设置。必须是: %s

source: Override the default date format used when rotating log files. This should contain values compatible with strftime(). (Default: '%s')
it_it: Sovrascrivi il formato di data predefinito usato per ruotare i file di registro. Questo dovrebbe contenere valori compatibili con strftime(). (Predefinito: '%s')
pl_pl: Zastąp domyślny format daty używany podczas obracania plików dziennika. Powinno to zawierać wartości zgodne z strftime(). (Standardowo: '%s')
zh_cn: 重写旋转日志文件时使用的默认日期格式。这应该包含与 strftime()兼容的值。(默认：'%s')

source: Version: %s
it_it: Versione: %s
pl_pl: Wersja: %s
zh_cn: 版本: %s

source: Opened a new MusicBot instance. This terminal can be safely closed!
it_it: Apri una nuova istanza di MusicBot. Questo terminale può essere chiuso in sicurezza!
pl_pl: Otwiera nową instancję MusicBot. Ten terminal może być bezpiecznie zamknięty!
zh_cn: 打开了一个新的 MusicBot 实例。此终端可以安全地关闭！

source: Loading MusicBot version: %s
it_it: Caricamento versione MusicBot: %s
pl_pl: Wczytywanie wersji MusicBot: %s
zh_cn: 正在加载 MusicBot 版本： %s

source: Log opened: %s
it_it: Log aperto: %s
pl_pl: Rejestr otwarty: %s
zh_cn: 日志已打开: %s

source: Changing working directory to: %s
it_it: Modifica della directory di lavoro in: %s
pl_pl: Zmiana katalogu roboczego na: %s
zh_cn: 更改工作目录到: %s

source: Cannot start the bot! You started `run.py` in the wrong directory and we could not locate `musicbot` and `.git` folders to verify a new directory location.
it_it: Impossibile avviare il bot! Hai iniziato `run.py` nella directory sbagliata e non abbiamo potuto individuare `musicbot` e `. it` cartelle per verificare una nuova posizione della directory.
pl_pl: Nie można uruchomić bota! Uruchomiłeś `run.py` w niewłaściwym katalogu i nie mogliśmy zlokalizować `musicbot` i `. foldery do zweryfikowania nowej lokalizacji katalogu.
zh_cn: 无法启动机器人！您在错误的目录中启动了`run.py`，我们无法定位`musicbot`和`。 它的文件夹以验证新的目录位置。

source: For best results, start `run.py` from the same folder you cloned MusicBot into. If you did not use git to clone the repository, you are strongly urged to.
it_it: Per ottenere risultati migliori, avvia `run.py` dalla stessa cartella in cui hai clonato MusicBot. Se non hai usato git per clonare il repository, sei fortemente sollecitato.
pl_pl: Aby uzyskać najlepsze wyniki, uruchom `run.py` z tego samego folderu, w którym sklonowano MusicBot. Jeśli nie używałeś git do sklonowania repozytorium, mocno poleca się cię.
zh_cn: 为了取得最好的结果，从同一个文件夹中开始`run.py`，你克隆了MusicBot。 如果你没有使用 git 来克隆仓库，你会被强烈敦促.

source: Certificate error is not a verification error, not trying certifi and exiting.
it_it: L'errore del certificato non è un errore di verifica, non è un tentativo di certifi e di uscita.
pl_pl: Błąd certyfikatu nie jest błędem weryfikacyjnym, nie próbuje certyfikować i wyjść.
zh_cn: 证书错误不是验证错误，而不是尝试验证和退出。

source: Here is the exact error, it could be a bug.
it_it: Ecco l'errore esatto, potrebbe essere un bug.
pl_pl: Oto dokładny błąd, może to być błąd.
zh_cn: 这是一个确切的错误，它可能是一个错误。

source: To easily add a certificate to Windows trust store, you can open the failing site in Microsoft Edge or IE...
it_it: Per aggiungere facilmente un certificato all'archivio di fiducia di Windows, è possibile aprire il sito fallito in Microsoft Edge o IE...
pl_pl: Aby z łatwością dodać certyfikat do sklepu zaufanych Windows możesz otworzyć uszkodzoną stronę w programie Microsoft Edge lub IE...
zh_cn: 若要轻松将证书添加到Windows信任商店， 您可以在 Microsoft Edge 或 IE中打开失败站点...

source: Could not get Issuer Certificate from default trust store, trying certifi instead.
it_it: Impossibile ottenere il certificato dell'emittente dall'archivio di fiducia predefinito, tentando invece il certificifi.
pl_pl: Nie można uzyskać certyfikatu wystawcy z domyślnego sklepu zaufania, zamiast tego próbuje certyfikować.
zh_cn: 无法从默认的信任商店获取发行者证书，请改用 certifi。

source: Syntax error (modification detected, did you edit the code?)
it_it: Errore di sintassi (modifica rilevata, hai modificato il codice?)
pl_pl: Błąd składni (wykryto modyfikację, czy edytowałeś kod?)
zh_cn: 语法错误(检测到更改，您是否编辑代码？)

source: Syntax error (this is a bug, not your fault)
it_it: Errore di sintassi (questo è un bug, non colpa tua)
pl_pl: Błąd składni (jest to błąd, nie twoja usterka)
zh_cn: 语法错误 (这是一个bug, 而不是你的错误)

source: Cannot start MusicBot due to an error! Problem: There was an error importing MusicBot or a dependency package. Solution: You need to manually install pip packages for MusicBot or launch without `--no-install-deps` and MusicBot will try to install them for you.
it_it: Impossibile avviare MusicBot a causa di un errore! Problema: Si è verificato un errore durante l'importazione di MusicBot o di un pacchetto di dipendenze. Soluzione: Devi installare manualmente pacchetti pip per MusicBot o lanciare senza `--no-install-deps` e MusicBot proverà ad installarli per te.
pl_pl: Nie można uruchomić MusicBot z powodu błędu! Problem: Wystąpił błąd podczas importowania MusicBot lub pakietu zależności. Rozwiązanie: Musisz ręcznie zainstalować pakiety pip dla MusicBot lub uruchomić bez `--no-install-deps` i MusicBot spróbuje je zainstalować dla Ciebie.

source: Attempting to install MusicBot dependency packages automatically...
it_it: Tentativo di installare automaticamente i pacchetti di dipendenza di MusicBot...
pl_pl: Próba zainstalowania pakietów zależności MusicBot automatycznie...
zh_cn: 尝试自动安装 MusicBot 依赖软件包...

source: MusicBot dependencies may not be installed! Problem: The pip install process ended with a possible error. Some or all of the the dependencies may be missing. Solution: You must manually install dependency packages. Open a CMD prompt / terminal to the MusicBot directory. You can try using the update scripts install packages. Or try this manual command: %(py_bin)s -m pip install -U -r ./requirements.txt You can also ask for help in MusicBot's support discord: https://discord.gg/bots
it_it: Le dipendenze di MusicBot potrebbero non essere installate! Problema: Il processo di installazione di pip è terminato con un possibile errore. Alcune o tutte le dipendenze potrebbero mancare. Soluzione: È necessario installare manualmente i pacchetti di dipendenza. Aprire un prompt / terminale CMD nella directory di MusicBot. Puoi provare a utilizzare i pacchetti di installazione degli script di aggiornamento. O prova questo comando manuale: %(py_bin)s -m pip install -U -r . requirements.txt Puoi anche chiedere aiuto nella discordia di supporto di MusicBot: https://discord.gg/bots
pl_pl: Zależności MusicBot mogą nie być zainstalowane! Problem: Proces instalacji pip zakończył się możliwym błędem. Może brakować niektórych lub wszystkich zależności. Rozwiązanie: Musisz ręcznie zainstalować pakiety zależności. Otwórz monit / terminal CMD do katalogu MusicBot. Możesz spróbować zainstalować pakiety skryptów aktualizacji. lub spróbuj tego polecenia ręcznego: %(py_bin)s -m pip install -U -r . requirements.txt Możesz również poprosić o pomoc na Discordzie obsługi MusicBot: https://discord.gg/bots

source: OK, lets hope installing dependencies worked!
it_it: OK, lascia funzionare la speranza di installare dipendenze!
pl_pl: OK, pozwala mieć nadzieję, że zainstalowanie zależności działa!
zh_cn: 好的，让我们希望安装依赖关系成功！

source: MusicBot got an ImportError after trying to install packages. MusicBot must exit...
it_it: MusicBot ha ottenuto un ImportError dopo aver provato a installare i pacchetti. MusicBot deve uscire...
pl_pl: MusicBot dostał błąd importu po próbie instalacji pakietów. MusicBot musi wyjść...
zh_cn: MusicBot 在尝试安装软件包后发生导入错误。MusicBot必须退出...

source: The exception which caused the above error:
it_it: L'eccezione che ha causato l'errore sopra:
pl_pl: Wyjątek, który spowodował powyższy błąd:
zh_cn: 造成上述错误的异常：

source: MusicBot is doing a soft restart...
it_it: MusicBot sta facendo un riavvio morbido...
pl_pl: MusicBot wykonuje miękki restart...
zh_cn: MusicBot 正在进行软重启...

source: MusicBot is doing a full process restart...
it_it: MusicBot sta facendo un riavvio completo...
pl_pl: MusicBot wykonuje pełny proces restartu...
zh_cn: MusicBot 正在重启整个进程...

source: Error starting bot
it_it: Errore nell'avvio del bot
pl_pl: Błąd podczas uruchamiania bota
zh_cn: 启动机器人出错

source: Closing event loop.
it_it: Ciclo dell'evento di chiusura.
pl_pl: Zamknij pętlę zdarzeń.
zh_cn: 关闭活动循环。

source: Restarting in %s seconds...
it_it: Riavvio in %s secondi...
pl_pl: Ponowne uruchomienie za %s sekund...
zh_cn: 在 %s 秒后重启...

source: All done.
it_it: Tutto fatto.
pl_pl: Wszystko gotowe.
zh_cn: 全部完成。

source: OK, we're closing!
it_it: OK, stiamo chiudendo!
pl_pl: OK, zamykamy!
zh_cn: 好的，我们正在关闭！
