Repository: Just-Some-Bots/MusicBot
Catalog: i18n/*/LC_MESSAGES/musicbot_logs.po
Languages: it_it, pl_pl, zh_cn

source: Event loop is closed, nothing else to do here.
it_it: Il ciclo di eventi è chiuso, nient'altro da fare qui.
pl_pl: Pętla zdarzeń jest zamknięta, nic innego do zrobienia tutaj.
zh_cn: 事件循环已关闭，此处不需要做任何其它事情。

source: Logout under way, ignoring this event.
it_it: Logout in corso, ignorando questo evento.
pl_pl: Wyloguj się, ignorując to wydarzenie.
zh_cn: 注销正在进行，忽略此事件。

source: VoiceClient says it is not connected, nothing else we can do here.
it_it: VoiceClient dice che non è connesso, niente altro che possiamo fare qui.
pl_pl: VoiceClient mówi, że nie jest połączony, nic innego nie możemy tutaj zrobić.
zh_cn: 语音客户端说它没有连接，我们在这里无法做任何其他事情。

source: Player finished and queue is empty, leaving voice channel...
it_it: Il giocatore finito e la coda è vuota, lasciando il canale vocale...
pl_pl: Gracz gotowy i kolejka jest pusta, pozostawiając kanał głosowy...
zh_cn: 播放器已完成，队列为空，离开语音频道...

source: Looping over queue to expunge songs with missing author...
it_it: Caricando sopra la coda per ripulire le canzoni con l'autore mancante...
pl_pl: Pętla nad kolejką do zdejmowania piosenek z brakującym autorem...
zh_cn: 正在循环播放队列以删除缺失作者的歌曲...

source: Author `%(user)s` absent, skipped (deleted) entry from queue: %(song)s
it_it: Autore `%(user)s` assente, saltato (cancellato) dalla coda: %(song)s
pl_pl: Autor `%(user)s` nieobecny, pominięty (usunięty) wpis z kolejki: %(song)s

source: No playable songs in the Guild autoplaylist, disabling.
it_it: Nessun brano riproducibile nella lista di riproduzione automatica della gilda, disabilitata.
pl_pl: Brak odtwarzanych utworów na liście autoplayerów, wyłączając.
zh_cn: 公会自动播放列表中没有可播放的歌曲，禁用。

source: No content in current autoplaylist. Filling with new music...
it_it: Nessun contenuto nella playlist automatica. Riempimento con nuova musica...
pl_pl: Brak zawartości w bieżącej autoplaylist. Wypełnianie nową muzyką...
zh_cn: 当前自动播放列表中没有内容。用新音乐填充...

source: Looping over player autoplaylist...
it_it: Caricamento sopra la playlist del giocatore...
pl_pl: Pętla nad autoplaylistą graczy...
zh_cn: 正在循环播放器自动布局列表...

source: Error while processing song "%(url)s": %(raw_error)s
it_it: Errore durante l'elaborazione del brano "%(url)s": %(raw_error)s
pl_pl: Błąd podczas przetwarzania utworu "%(url)s": %(raw_error)s

source: Error extracting song "%(url)s": %(raw_error)s
it_it: Errore nell'estrarre il brano "%(url)s": %(raw_error)s
pl_pl: Błąd podczas rozpakowywania utworu "%(url)s": %(raw_error)s

source: MusicBot needs to stop the auto playlist extraction and bail.
it_it: MusicBot ha bisogno di fermare l'estrazione della playlist automatica e la cauzione.
pl_pl: MusicBot musi zatrzymać automatyczne wydobycie i ratowanie listy odtwarzania.
zh_cn: MusicBot 需要停止自动播放列表提取和保释。

source: MusicBot got an unhandled exception in player finished event.
it_it: MusicBot ha ottenuto un'eccezione non gestita nell'evento finito dal giocatore.
pl_pl: MusicBot otrzymał nieobsługiwany wyjątek w wydarzeniu zakończonym.
zh_cn: 在玩家完成的活动中，MusicBot 有一个未处理的异常。

source: Expanding auto playlist with entries extracted from: %s
it_it: Espandendo playlist automatica con voci estratte da: %s
pl_pl: Rozszerzenie automatycznej listy odtwarzania o wpisy wyciągnięte z: %s

source: Error adding song from autoplaylist: %s
it_it: Errore nell'aggiungere il brano dalla playlist automatica: %s
pl_pl: Błąd podczas dodawania utworu z autoplaylisty: %s

source: Exception data for above error:
it_it: Eccezione di dati per l'errore sopra:
pl_pl: Dane wyjątku dla powyższego błędu:
zh_cn: 上述异常数据错误：

source: No playable songs in the autoplaylist, disabling.
it_it: Nessun brano riproducibile nella playlist automatica, disabilitato.
pl_pl: Brak odtwarzanych utworów na liście autoplayerów, wyłączając.
zh_cn: 自动播放列表中没有可播放的歌曲，禁用了。

source: Running on_player_entry_added
it_it: Esecuzione su_player_entry_added
pl_pl: Uruchamianie_gracz_wpis_dodane
zh_cn: 已添加 on_player_entry_添加

source: Automatically skipping auto-playlist entry for queued entry.
it_it: Saltando automaticamente la voce della scaletta automatica per la voce in coda.
pl_pl: Automatycznie pomijam wpis auto-listy odtwarzania dla wpisu w kolejce.
zh_cn: 自动跳过队列条目的自动播放列表条目。

source: MusicPlayer exception for entry: %r
it_it: Eccezione MusicPlayer per la voce: %r
pl_pl: Wyjątek MusicPlayer dla wpisu: %r

source: MusicPlayer exception.
it_it: Eccezione di MusicPlayer.
pl_pl: Wyjątek MusicPlayer
zh_cn: MusicPlayer 异常。

source: Auto playlist track could not be played: %r
it_it: Impossibile riprodurre la traccia della scaletta automatica: %r
pl_pl: Utwór automatycznej listy odtwarzania nie może być odtworzony: %r

source: Logout under way, ignoring status update event.
it_it: Logout in corso, ignorando l'aggiornamento dello stato.
pl_pl: Wyloguj się w toku, ignorując zdarzenie aktualizacji statusu.
zh_cn: 注销正在进行，忽略状态更新事件。

source: Update bot status: %(status)s -- %(activity)r
it_it: Aggiorna stato bot: %(status)s -- %(activity)r
pl_pl: Aktualizuj status bota: %(status)s -- %(activity)r

source: Serializing queue for %s
it_it: Serializzazione della coda per %s
pl_pl: Serializacja kolejki dla %s

source: Deserializing queue for %s
it_it: Deserializzazione della coda per %s
pl_pl: Deserializacja kolejki dla %s

source: Writing current song for %s
it_it: Scrittura del brano corrente per %s
pl_pl: Zapisywanie aktualnej piosenki dla %s

source: Cannot send non-response object: %r
it_it: Impossibile inviare l'oggetto non-risposta: %r
pl_pl: Nie można wysłać obiektu braku odpowiedzi: %r
zh_cn: 无法发送无响应对象： %r

source: [Dev Bug] Tried sending an invalid response object.
it_it: [Dev Bug] Provato a inviare un oggetto di risposta non valido.
pl_pl: [Dev Bug] Próba wysłania nieprawidłowego obiektu odpowiedzi.
zh_cn: [Dev Bug ] 试图发送无效的响应对象。

source: sending embed to: %s
it_it: invio incorporato a: %s
pl_pl: wysyłanie osadzonych do: %s

source: sending text to: %s
it_it: invio del testo a: %s
pl_pl: wysyłanie tekstu do: %s

source: Cannot send message to "%s", no permission
it_it: Impossibile inviare il messaggio a "%s", nessun permesso
pl_pl: Nie można wysłać wiadomości do "%s", brak uprawnień

source: Cannot send message to "%s", invalid or deleted channel
it_it: Impossibile inviare il messaggio a "%s", canale eliminato o non valido
pl_pl: Nie można wysłać wiadomości do "%s", nieprawidłowy lub usunięty kanał

source: Message is over the message size limit (%s)
it_it: Il messaggio è sopra il limite di dimensione del messaggio (%s)
pl_pl: Wiadomość przekracza limit rozmiaru wiadomości (%s)

source: Could not send private message, sending in fallback channel instead.
it_it: Impossibile inviare un messaggio privato, inviando un canale di ripiego.
pl_pl: Nie można wysłać prywatnej wiadomości, zamiast tego wysyłać na kanał awaryjny.
zh_cn: 无法发送私信，发送到后退频道中。

source: Rate limited send message, retrying in %s seconds.
it_it: Vota il messaggio di invio limitato, riprovando in %s secondi.
pl_pl: Ograniczono szybkość wysyłania wiadomości, ponowienie próby za %s sekund.

source: Cancelled message retry for: %s
it_it: Riprova messaggio annullato per: %s
pl_pl: Anulowano ponowną próbę wiadomości dla: %s

source: Rate limited send message, but cannot retry!
it_it: Valuta il messaggio di invio limitato, ma non riprovare!
pl_pl: Oceń ograniczoną wiadomość, ale nie można ponowić próby!
zh_cn: 评分有限的发送消息，但不能重试！

source: Failed to send message in fallback channel.
it_it: Impossibile inviare il messaggio nel canale di ripiego.
pl_pl: Nie udało się wysłać wiadomości na kanale awaryjnym.
zh_cn: 在后退频道中发送消息失败。

source: Failed to send due to an HTTP error.
it_it: Impossibile inviare a causa di un errore HTTP.
pl_pl: Nie udało się wysłać z powodu błędu HTTP.
zh_cn: 由于HTTP错误发送失败。

source: Cannot delete message "%s", no permission
it_it: Impossibile eliminare il messaggio "%s", nessun permesso
pl_pl: Nie można usunąć wiadomości "%s", brak uprawnień

source: Cannot delete message "%s", message not found
it_it: Impossibile eliminare il messaggio "%s", messaggio non trovato
pl_pl: Nie można usunąć wiadomości "%s", nie znaleziono wiadomości

source: Rate limited message delete, retrying in %s seconds.
it_it: Valuta l'eliminazione limitata dei messaggi, riprovando in %s secondi.
pl_pl: Ograniczono szybkość usuwania wiadomości, ponowienie próby za %s sekund.

source: Rate limited message delete, but cannot retry!
it_it: Valuta l'eliminazione del messaggio limitata, ma non riprova!
pl_pl: Oceń ograniczoną wiadomość usuniętą ale nie można ponowić próby!
zh_cn: 评分限制信息已删除，但无法重试！

source: Failed to delete message
it_it: Eliminazione del messaggio non riuscita
pl_pl: Nie udało się usunąć wiadomości
zh_cn: 删除消息失败

source: Got HTTPException trying to delete message: %s
it_it: Hai HTTPException cercando di eliminare il messaggio: %s
pl_pl: Masz HTTPException próbujący usunąć wiadomość: %s

source: Cannot edit message "%s", message not found
it_it: Impossibile modificare il messaggio "%s", messaggio non trovato
pl_pl: Nie można edytować wiadomości "%s", nie znaleziono wiadomości

source: Sending message instead
it_it: Invio messaggio invece
pl_pl: Wysyłanie wiadomości
zh_cn: 发送消息

source: Rate limited edit message, retrying in %s seconds.
it_it: Valuta il messaggio di modifica limitato, riprovando in %s secondi.
pl_pl: Ograniczona szybkość edycji wiadomości, ponowna próba za %s sekund.

source: Cancelled message edit for: %s
it_it: Modifica messaggio annullata per: %s
pl_pl: Anulowana edycja wiadomości dla: %s

source: Failed to edit message
it_it: Modifica del messaggio non riuscita
pl_pl: Nie udało się edytować wiadomości
zh_cn: 编辑消息失败

source: Got HTTPException trying to edit message %s to: %s
it_it: Hai HTTPException tentato di modificare il messaggio %s a: %s
pl_pl: Masz HTTPException próbujący edytować wiadomość %s do: %s

source: Cancelled delete for message (ID: %(id)s): %(content)s
it_it: Eliminazione annullata per il messaggio (ID: %(id)s): %(content)s
pl_pl: Anulowano usunięcie wiadomości (ID: %(id)s): %(content)s

source: Caught a signal from the OS: %s
it_it: Ricevuto un segnale dal sistema operativo: %s
pl_pl: Złapano sygnał z OS: %s

source: Disconnecting and closing down MusicBot...
it_it: Scollegare e chiudere MusicBot...
pl_pl: Rozłączanie i zamykanie MusicBot...
zh_cn: 断开和关闭MusicBot

source: Exception thrown while handling interrupt signal!
it_it: Eccezione lanciata durante la gestione del segnale di interruzione!
pl_pl: Wyjątek wyrzucony podczas obsługi sygnału!
zh_cn: 处理中断信号时抛出异常！

source: MusicBot is now doing shutdown steps...
it_it: MusicBot sta ora facendo passi di arresto...
pl_pl: MusicBot robi teraz kroki zamykania...
zh_cn: MusicBot 正在执行关闭步骤...

source: Failed Discord API Login! Problem: MusicBot could not log into Discord API. Your Token may be incorrect or there may be an API outage. Solution: Make sure you have the correct Token set in your config. Check API status at the official site: discordstatus.com
it_it: Accesso API Discord non riuscito! Problema: MusicBot non è riuscito ad accedere all'API Discord. Il tuo token potrebbe essere errato o potrebbe esserci un'interruzione dell'API. Soluzione: Assicurati di aver impostato il token corretto nella tua configurazione. Controlla lo stato dell'API sul sito ufficiale: discordstatus.com
pl_pl: Nieudane logowanie API Discorda! Problem: MusicBot nie mógł zalogować się do API Discorda. Twój token może być niepoprawny lub może wystąpić awaria API. Rozwiązanie: Upewnij się, że masz ustawiony odpowiedni token w konfiguracji. Sprawdź status API na oficjalnej stronie: discordstatus.com

source: Waiting for download threads to finish up...
it_it: In attesa che le discussioni di download finiscano...
pl_pl: Oczekiwanie na zakończenie pobierania wątków...
zh_cn: 正在等待下载线程完成...

source: Will wait for task: %(name)s (%(func)s)
it_it: Attenderà il compito: %(name)s (%(func)s)
pl_pl: Poczekamy na zadanie: %(name)s (%(func)s)

source: Will try to cancel task: %(name)s (%(func)s)
it_it: Cercherà di annullare l'attività: %(name)s (%(func)s)
pl_pl: Spróbuje anulować zadanie: %(name)s (%(func)s)

source: Awaiting pending tasks...
it_it: In attesa di attività...
pl_pl: Oczekiwanie na zadania...
zh_cn: 正在等待任务...

source: Closing HTTP Connector.
it_it: Chiusura Connettore HTTP.
pl_pl: Zamykanie konektora HTTP.
zh_cn: 关闭HTTP连接器。

source: Closing aiohttp session.
it_it: Chiusura sessione aiohttp.
pl_pl: Zamykanie sesji aiohttp.
zh_cn: 闭幕会议.

source: Logout has been called.
it_it: Il logout è stato chiamato.
pl_pl: Wylogowanie zostało wywołane.
zh_cn: 注销已被调用。

source: Exception in %(event)s: %(error)s
it_it: Eccezione in %(event)s: %(error)s
pl_pl: Wyjątek w %(event)s: %(error)s

source: Exception in %s
it_it: Eccezione in %s
pl_pl: Wyjątek w %s

source: MusicBot resumed a session with discord.
it_it: MusicBot ha ripreso una sessione con discord.
pl_pl: MusicBot wznowił sesję z discordem.
zh_cn: MusicBot恢复了不一致的会话。

source: Finish on_ready
it_it: Termina su_pronto
pl_pl: Zakończ w trybie _gotowym
zh_cn: 准备好完成

source: Logged in, now getting MusicBot ready...
it_it: Accesso effettuato, ora ottenendo MusicBot pronto...
pl_pl: Zalogowano. Przygotuj MusicBot...
zh_cn: 已登录，正在准备好MusicBot...

source: ClientUser is somehow none, we gotta bail...
it_it: ClientUser è in qualche modo nessuno, abbiamo ottenuto la bail...
pl_pl: Klient nie ma nikogo, mamy ratowanie...
zh_cn: 客户端在某种程度上是没有的，我们去做保释...

source: Owner: %(id)s/%(name)s#%(desc)s
it_it: Proprietario: %(id)s/%(name)s#%(desc)s
pl_pl: Właściciel: %(id)s/%(name)s#%(desc)s

source: Guild List:
it_it: Lista Gilda:
pl_pl: Lista gildii:
zh_cn: 公会列表：

source: Left %s due to bot owner not found
it_it: Sinistra %s a causa del proprietario del bot non trovato
pl_pl: Opuszczono %s z powodu nieznalezionego właściciela bota

source: Not proceeding with checks in %s servers due to unavailability
it_it: Non procedere con i controlli nei server %s a causa di indisponibilità
pl_pl: Nie kontynuowano sprawdzania na serwerach %s z powodu niedostępności

source: Owner could not be found on any guild (id: %s)
it_it: Il proprietario non può essere trovato in nessuna gilda (id: %s)
pl_pl: Właściciel nie został znaleziony w żadnej gildii (id: %s)

source: Owner unknown, bot is not on any guilds.
it_it: Proprietario sconosciuto, bot non è su alcuna gilda.
pl_pl: Właściciel nieznany, bot nie ma na żadnej gildii.
zh_cn: 所有者未知。机器人不在任何公会上。

source: To make the bot join a guild, paste this link in your browser. Note: You should be logged into your main account and have manage server permissions on the guild you want the bot to join. %s
it_it: Per far entrare il bot in una gilda, incolla questo link nel tuo browser. Nota: dovresti essere connesso al tuo account principale e avere i permessi per gestire i server nella gilda che vuoi entrare nel bot. %s
pl_pl: Aby bot dołączył do gildii, wklej ten link w swojej przeglądarce. Uwaga: Powinieneś być zalogowany na swoje konto główne i mieć zarządzać uprawnieniami serwera do gildii, do której chcesz, aby bot dołączył. %s

source: Got None for bound channel with ID: %d
it_it: Non c'è nessuno per il canale collegato con ID: %d
pl_pl: Nie masz żadnego kanału z ID: %d

source: Cannot bind to non Messageable channel with ID: %d
it_it: Impossibile collegare al canale non Messaggiabile con ID: %d
pl_pl: Nie można powiązać z kanałem bez wiadomości o ID: %d
zh_cn: 无法绑定到 ID 为 %d 的不可信频道

source: Bound to text channels:
it_it: Legato ai canali di testo:
pl_pl: Powiąż z kanałami tekstowymi:
zh_cn: 文本通道绑定：

source: Not bound to any text channels
it_it: Non associato a nessun canale di testo
pl_pl: Nie związane z żadnymi kanałami tekstowymi
zh_cn: 不绑定到任何文本频道

source: Got None for auto join channel with ID: %d
it_it: Non c'è nessuno per entrare automaticamente nel canale con ID: %d
pl_pl: Brak dla automatycznego dołączenia do kanału z ID: %d
zh_cn: 没有自动加入频道ID: %d

source: Cannot auto join a Private/Non-Guild channel with ID: %d
it_it: Impossibile entrare automaticamente in un canale Privato/Non-Gilda con ID: %d
pl_pl: Nie można automatycznie dołączyć do kanału prywatnego/niegildii z ID: %d
zh_cn: 无法自动加入私有/非公会频道与 ID: %d

source: Cannot auto join to non-connectable channel with ID: %d
it_it: Impossibile entrare automaticamente nel canale non connettibile con ID: %d
pl_pl: Nie można automatycznie dołączyć do niepodłączonego kanału z ID: %d
zh_cn: 无法自动加入不可连接的频道 ID: %d

source: Auto joining voice channels:
it_it: Collegamento automatico canali vocali:
pl_pl: Automatyczne dołączanie kanałów głosowych:
zh_cn: 自动加入语音频道：

source: Not auto joining any voice channels
it_it: Non si unisce automaticamente a nessun canale vocale
pl_pl: Brak automatycznego dołączania do żadnych kanałów głosowych
zh_cn: 不自动加入任何语音频道

source: Detected missing config options! Problem: You config options file is missing some options. Default settings will be used for these options. Here is a list of options we didn't find: %(missing)s Solution: Copy new options from the example options file. Or use the config command to set and save them.
it_it: Rilevato le opzioni di configurazione mancanti! Problema: Il file delle opzioni di configurazione manca di alcune opzioni. Le impostazioni predefinite saranno utilizzate per queste opzioni. Ecco un elenco di opzioni che non abbiamo trovato: %(missing)s Soluzione: Copia nuove opzioni dal file delle opzioni di esempio. Oppure usa il comando di configurazione per impostarli e salvarli.
pl_pl: Wykryto brakujące opcje konfiguracji! Problem: W pliku opcji konfiguracji brakuje niektórych opcji. Domyślne ustawienia zostaną użyte dla tych opcji. Oto lista opcji, których nie znaleźliśmy: %(missing)s Rozwiązanie: Skopiuj nowe opcje z przykładowego pliku opcji. lub użyj komendy konfiguracyjnej do ich ustawiania i zapisywania.

source: Event on_ready has fired %s times
it_it: L'evento on_ready ha sparato %s volte
pl_pl: Zdarzenie on_ready zostało wywołane %s razy

source: Getting application info.
it_it: Ottenere informazioni sull'applicazione.
pl_pl: Otrzymywanie informacji o aplikacji.
zh_cn: 正在获取应用程序信息。

source: Ensuring data folders exist
it_it: Assicurare l'esistenza di cartelle dati
pl_pl: Upewnij się, że foldery danych istnieją
zh_cn: 确保数据文件夹存在

source: Validating config
it_it: Convalida configurazione
pl_pl: Weryfikowanie konfiguracji
zh_cn: 正在验证配置

source: Validating permissions config
it_it: Convalida configurazione permessi
pl_pl: Sprawdzanie poprawności konfiguracji uprawnień
zh_cn: 正在验证权限配置

source: Disabled
it_it: Disabilitato
pl_pl: Wyłączone
zh_cn: 已禁用

source: Enabled
it_it: Abilitato
pl_pl: Włączone
zh_cn: 已启用

source: Options:
it_it: Opzione:
pl_pl: Opcje:
zh_cn: 选项：

source: Command prefix: %s
it_it: Prefisso dei comandi: %s
pl_pl: Prefiks polecenia: %s

source: Default volume: %d%%
it_it: Volume predefinito: %d%%
pl_pl: Domyślna głośność: %d%%

source: Skip threshold: %(num)d votes or %(percent).0f%%
it_it: Salta soglia: %(num)d voti o %(percent).0f%%
pl_pl: Próg pominięcia: %(num)d lub %(percent).0f%%

source: Now Playing @mentions: %s
it_it: Riproduzione Di @mentions: %s
pl_pl: Teraz odtwarzane @wzmianki: %s

source: Auto-Playlist: %(status)s (order: %(order)s)
it_it: Scaletta Automatica: %(status)s (ordine: %(order)s)
pl_pl: Auto-Playlist: %(status)s (kolejność: %(order)s)

source: random
it_it: casuale
pl_pl: losowy
zh_cn: 随机的

source: sequential
it_it: sequenziale
pl_pl: sekwencyjny
zh_cn: 序列

source: Auto-Pause: %s
it_it: Auto-Pausa: %s
pl_pl: Automatyczne wstrzymanie: %s

source: Delete Messages: %s
it_it: Elimina Messaggi: %s
pl_pl: Usuń wiadomości: %s

source: Delete Invoking: %s
it_it: Elimina Invoking: %s
pl_pl: Usuń wywołanie: %s

source: Delete Now Playing: %s
it_it: Elimina In Riproduzione: %s
pl_pl: Usuń teraz odtwarzanie: %s
zh_cn: 删除正在播放中: %s

source: Debug Mode: %s
it_it: Modalità Debug: %s
pl_pl: Tryb debugowania: %s

source: Downloaded songs will be %s
it_it: I brani scaricati saranno %s
pl_pl: Pobrane utwory będą %s

source: Delete if unused for %d days
it_it: Elimina se non utilizzato per %d giorni
pl_pl: Usuń jeśli nieużywane przez %d dni

source: Status message: %s
it_it: Messaggio di stato: %s
pl_pl: Komunikat statusu: %s

source: Spotify integration: %s
it_it: Integrazione Spotify: %s
pl_pl: Integracja ze Spotify: %s

source: Timeout: %s seconds
it_it: Timeout: %s secondi
pl_pl: Przekroczono czas: %s sekund

source: Timeout: %d seconds
it_it: Timeout: %d secondi
pl_pl: Przekroczono czas: %d sekund

source: Self Deafen: %s
pl_pl: Samodzielny Deafen: %s

source: Per-server command prefix: %s
it_it: Prefisso di comando per server: %s
pl_pl: Prefiks polecenia dla serwera: %s

source: Round Robin Queue: %s
it_it: Coda Round Robin: %s
pl_pl: Runda Kolejka Robina: %s

source: The requested song `%(subject)s` is blocked by the song block list.
it_it: La canzone richiesta `%(subject)s` è bloccata dalla lista dei brani.
pl_pl: Żądana piosenka `%(subject)s` jest zablokowana przez listę bloków utworu.

source: Attempted to handle Voice Channel inactivity, but Bot is not in voice...
it_it: Tentativo di gestire l'inattività del canale vocale, ma Bot non è in voce...
pl_pl: Próba obsługi nieaktywności kanału głosowego, ale bot nie jest w głosowaniu...
zh_cn: 试图处理 Voice Channot 处于无活动状态，但Bot 没有语音...

source: Channel activity already waiting in guild: %s
it_it: Attività canale già in attesa nella gilda: %s
pl_pl: Aktywność kanału już oczekuje w gildii: %s

source: Channel activity waiting %(time)d seconds to leave channel: %(channel)s
it_it: Attività del canale in attesa di %(time)d secondi per lasciare il canale: %(channel)s
pl_pl: Aktywność kanału oczekująca %(time)d sekund na opuszczenie kanału: %(channel)s

source: Channel activity timer for %s has expired. Disconnecting.
it_it: Il timer di attività del canale per %s è scaduto. Disconnessione.
pl_pl: Licznik aktywności kanału dla %s wygasł. Rozłączanie.

source: Channel activity timer canceled for: %(channel)s in %(guild)s
it_it: Timer attività canale annullato per: %(channel)s in %(guild)s
pl_pl: Timer aktywności kanału anulowany dla: %(channel)s w %(guild)s

source: Ignoring player inactivity in auto-joined channel: %s
it_it: Ignorare l'inattività del giocatore nel canale auto-entrato: %s
pl_pl: Ignorowanie nieaktywności gracza na kanale auto-dołączenia: %s

source: Player activity timer already waiting in guild: %s
it_it: Timer attività giocatore già in attesa nella gilda: %s
pl_pl: Licznik aktywności gracza już czeka w gildii: %s

source: Player activity timer waiting %(time)d seconds to leave channel: %(channel)s
it_it: Timer attività giocatore in attesa di %(time)d secondi per lasciare il canale: %(channel)s
pl_pl: Licznik aktywności gracza, oczekujący %(time)d sekund na opuszczenie kanału: %(channel)s

source: Player activity timer for %s has expired. Disconnecting.
it_it: Il timer di attività del giocatore per %s è scaduto. Disconnessione.
pl_pl: Licznik aktywności gracza dla %s wygasł. Rozłączanie.

source: Player activity timer canceled for: %(channel)s in %(guild)s
it_it: Timer attività giocatore annullato per: %(channel)s in %(guild)s
pl_pl: Timer aktywności gracza anulowany dla: %(channel)s w %(guild)s

source: Player activity timer is being reset.
it_it: Il timer dell'attività del giocatore è in fase di ripristino.
pl_pl: Czas aktywności gracza jest zresetowany.
zh_cn: 正在重置玩家活动计时器。

source: No such command
it_it: Comando inesistente
pl_pl: Nie ma takiej komendy
zh_cn: 没有这种命令

source: You must mention a user or provide their ID number.
it_it: È necessario menzionare un utente o fornire il loro numero di identità.
pl_pl: Musisz podać użytkownika lub jego numer identyfikacyjny.
zh_cn: 您必须提及用户或提供他们的身份号码。

source: Invalid sub-command given. Use `help blockuser` for usage examples.
it_it: Sottocomando fornito non valido. Usa `help blockuser` per esempi di utilizzo.
pl_pl: Podano nieprawidłowe polecenie. Użyj `help blockuser` dla przykładów użycia.
zh_cn: 给定的子命令无效。使用 "help blockuser" 作为使用示例。
