Repository: Just-Some-Bots/MusicBot
Catalog: i18n/*/LC_MESSAGES/musicbot_messages.po
Languages: it_it, sv_se

source: If enabled, status messages will report info on paused players.
it_it: Se abilitata, i messaggi di stato segnaleranno informazioni sui giocatori in pausa.
sv_se: Om aktiverad, kommer statusmeddelanden att rapportera information om pausade spelare.

source: If enabled, MusicBot will save the track title to: data/[Server ID]/current.txt
it_it: Se abilitata, MusicBot salverà il titolo della traccia in: data/[Server ID]/current.txt
sv_se: Om aktiverad, kommer MusicBot att spara låttiteln till: data/[Server ID]/current.txt

source: Allow the member who requested the song to skip it, bypassing votes.
it_it: Permetti al membro che ha richiesto la canzone di saltarla, aggirando i voti.
sv_se: Tillåt den medlem som bad låten att hoppa över den, kringgående röster.

source: Tries to use ffmpeg to get volume normalizing options for use in playback. This option can cause delay between playing songs, as the whole track must be processed.
it_it: Cerca di usare ffmpeg per ottenere opzioni di normalizzazione del volume per l'uso in riproduzione. Questa opzione può causare ritardi tra la riproduzione dei brani, poiché l'intera traccia deve essere elaborata.
sv_se: Försöker använda ffmpeg för att få volymnormaliserande alternativ för användning i uppspelning. Det här alternativet kan orsaka fördröjning mellan att spela låtar, eftersom hela låten måste bearbetas.

source: Allow MusicBot to format its messages as embeds.
it_it: Permetti a MusicBot di formattare i suoi messaggi come incorporati.
sv_se: Tillåt MusicBot att formatera sina meddelanden som inbäddar.

source: The number of entries to show per-page when using q command to list the queue.
it_it: Il numero di voci da mostrare per pagina quando si usa il comando q per elencare la coda.
sv_se: Antalet poster att visa per sida när du använder q-kommandot för att lista kön.

source: Enable MusicBot to automatically remove unplayable entries from the auto playlist.
it_it: Abilita MusicBot per rimuovere automaticamente le voci non riproducibili dalla scaletta automatica.
sv_se: Aktivera MusicBot att automatiskt ta bort ospelbara poster från auto-spellistan.

source: Display MusicBot config settings in the logs at startup.
it_it: Visualizza le impostazioni di configurazione di MusicBot nei log all'avvio.
sv_se: Visa konfigurationsinställningar för MusicBot i loggarna vid start.

source: Enable users with the InstaSkip permission to bypass skip voting and force skips.
it_it: Abilita gli utenti con il permesso InstaSkip per bypassare il voto saltato e salti forza.
sv_se: Aktivera användare med InstaSkip tillåtelse att kringgå röstning och tvinga hoppar över.

source: If enabled, MusicBot will leave servers if the owner is not in their member list.
it_it: Se abilitata, MusicBot lascerà i server se il proprietario non è nella loro lista di membri.
sv_se: Om aktiverad, kommer MusicBot att lämna servrar om ägaren inte är med i deras medlemslista.

source: If enabled, MusicBot will allow commands to have multiple names using data in: config/aliases.json
it_it: Se abilitato, MusicBot permetterà ai comandi di avere più nomi utilizzando i dati in: config/aliases.json
sv_se: Om aktiverad, kommer MusicBot att tillåta kommandon att ha flera namn med data i: config/aliases.json

source: Replace MusicBot name/version in embed footer with custom text. Only applied when UseEmbeds is enabled and it is not blank.
it_it: Sostituisci il nome/la versione di MusicBot nel piè di pagina incorporato con testo personalizzato. Applicato solo quando UseEmbeds è abilitato e non è vuoto.
sv_se: Ersätt MusicBot namn/version i inbäddad sidfot med anpassad text. Används endast när UseEmbeds är aktiverat och det är inte tomt.

source: Completely remove the footer from embeds.
it_it: Rimuovere completamente il piè di pagina dagli incorporati.
sv_se: Ta helt bort sidfoten från bäddar.

source: MusicBot will automatically deafen itself when entering a voice channel.
it_it: MusicBot si assorderà automaticamente quando si entra in un canale vocale.
sv_se: MusicBot kommer automatiskt att döva sig själv när du går in i en röstkanal.

source: If enabled, MusicBot will leave a voice channel when no users are listening, after waiting for a period set in LeaveInactiveVCTimeOut option. Listeners are channel members, excluding bots, who are not deafened.
it_it: Se abilitata, MusicBot lascerà un canale vocale quando nessun utente sta ascoltando, dopo aver aspettato un periodo impostato nell'opzione LeaveInactiveVCTimeOut. Gli ascoltatori sono membri del canale, esclusi i bot, che non sono assordati.
sv_se: Om aktiverad, kommer MusicBot att lämna en röstkanal när inga användare lyssnar, efter att ha väntat på en period i LeaveInactiveVCTimeOut alternativet. Lyssnare är kanalmedlemmar, exklusive botar, som inte är döva.

source: Set a period of time to wait before leaving an inactive voice channel. You can set this to a number of seconds or phrase like: 4 hours
it_it: Imposta un periodo di tempo da attendere prima di lasciare un canale vocale inattivo. È possibile impostare questo a un numero di secondi o frase come: 4 ore
sv_se: Ange en tidsperiod att vänta innan du lämnar en inaktiv röstkanal. Du kan ställa in detta till ett antal sekunder eller fras som: 4 timmar

source: If enabled, MusicBot will leave the channel immediately when the song queue is empty.
it_it: Se abilitata, MusicBot lascerà il canale immediatamente quando la coda del brano è vuota.
sv_se: Om aktiverad, kommer MusicBot att lämna kanalen omedelbart när låtkön är tom.

source: When paused or no longer playing, wait for this amount of time then leave voice. You can set this to a number of seconds of phrase like: 15 minutes Set it to 0 to disable leaving in this way.
it_it: Quando si è in pausa o non si gioca, attendere questa quantità di tempo poi lasciare la voce. È possibile impostare questo a un certo numero di secondi di frase come: 15 minuti Impostarlo a 0 per disabilitare la partenza in questo modo.
sv_se: När pausad eller inte längre spelar, vänta på denna tid sedan lämna röst. Du kan ställa in detta till ett antal sekunder av fras som: 15 minuter Sätt det till 0 för att inaktivera lämnar på detta sätt.

source: If enabled, users must indicate search result choices by sending a message instead of using reactions.
it_it: Se abilitato, gli utenti devono indicare le scelte dei risultati della ricerca inviando un messaggio invece di usare le reazioni.
sv_se: Om aktiverad, måste användare ange sökresultatval genom att skicka ett meddelande istället för att använda reaktioner.

source: Sets the default number of search results to fetch when using the search command without a specific number.
it_it: Imposta il numero predefinito di risultati di ricerca da recuperare quando si utilizza il comando di ricerca senza un numero specifico.
sv_se: Anger standardantalet sökresultat att hämta när du använder sökkommandot utan ett specifikt nummer.

source: Allow MusicBot to save a per-server command prefix, and enables the setprefix command.
it_it: Consenti a MusicBot di salvare un prefisso di comando per server, e abilita il comando setprefix.
sv_se: Tillåt MusicBot att spara ett kommando per server och aktivera kommandot setprefix.

source: If enabled and multiple members are adding songs, MusicBot will organize playback for one song per member.
it_it: Se abilitato e più membri aggiungono canzoni, MusicBot organizzerà la riproduzione per un brano per membro.
sv_se: Om aktiverad och flera medlemmar lägger till låtar, kommer MusicBot att organisera uppspelning för en låt per medlem.

source: Allow MusicBot to use timed pings to detect network outage and availability. This may be useful if you keep the bot joined to a channel or playing music 24/7. MusicBot must be restarted to enable network testing. By default this is disabled.
it_it: Consenti a MusicBot di utilizzare i ping temporizzati per rilevare l'interruzione della rete e la disponibilità. Questo può essere utile se si mantiene il bot unito a un canale o riprodurre musica 24/7. MusicBot deve essere riavviato per abilitare il test di rete. Per impostazione predefinita questo è disabilitato.
sv_se: Tillåt MusicBot att använda tidsinställda pings för att upptäcka nätverksavbrott och tillgänglighet. Detta kan vara användbart om du håller botten ansluten till en kanal eller spelar musik 24/7. MusicBot måste startas om för att aktivera nätverkstestning. Som standard är detta inaktiverat.

source: Enable saving all songs played by MusicBot to a global playlist file: %(filename)s This will contain all songs from all servers.
it_it: Abilita il salvataggio di tutti i brani riprodotti da MusicBot in un file di playlist globale: %(filename)s Questo conterrà tutti i brani da tutti i server.
sv_se: Aktivera sparande av alla låtar som spelas av MusicBot till en global spellistfil: %(filename)s Detta kommer att innehålla alla låtar från alla servrar.

source: Enable saving songs played per-server to a playlist file: %(basename)s[Server ID]%(ext)s
it_it: Abilita il salvataggio dei brani riprodotti per server su un file di playlist: %(basename)s[Server ID]%(ext)s
sv_se: Aktivera sparande av låtar som spelas per server till en spellistfil: %(basename)s[Server ID]%(ext)s

source: Enable playback of local media files using the play command. When enabled, users can use: `play file://path/to/file.ext` to play files from the local MediaFileDirectory path.
it_it: Abilita la riproduzione di file multimediali locali usando il comando di riproduzione. Quando abilitato, gli utenti possono usare: `play file://path/to/file. xt` per riprodurre i file dal percorso locale MediaFileDirectory.
sv_se: Aktivera uppspelning av lokala mediefiler med hjälp av uppspelningskommandot. När detta är aktiverat kan användare använda: `play file://path/to/fil. xt` för att spela upp filer från den lokala MediaFileDirectory-sökvägen.

source: Allow MusicBot to automatically unpause when play commands are used.
it_it: Permetti a MusicBot di smettere automaticamente quando vengono utilizzati i comandi di riproduzione.
sv_se: Tillåt MusicBot att automatiskt avpausa när spelkommandon används.

source: Experimental, HTTP/HTTPS proxy settings to use with ytdlp media downloader. The value set here is passed to `ytdlp --proxy` and aiohttp header checking. Leave blank to disable.
it_it: Impostazioni sperimentali, HTTP/HTTPS proxy da utilizzare con il download di file multimediali ytdlp. Il valore impostato qui viene passato al controllo dell'intestazione `ytdlp --proxy` e aiohttp. Lascia vuoto per disabilitare.
sv_se: Experimentella, HTTP/HTTPS proxyinställningar för att använda med ytdlp media downloader. Värdet som anges här skickas till `ytdlp --proxy` och aiohttp header checking. Lämna tomt för att inaktivera.

source: Experimental option to set a static User-Agent header in yt-dlp. It is not typically recommended by yt-dlp to change the UA string. For examples of what you might put here, check the following two links: https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/User-Agent https://www.useragents.me/ Leave blank to use default, dynamically generated UA strings.
it_it: Opzione sperimentale per impostare un'intestazione statica User-Agent in yt-dlp. In genere non è raccomandato da yt-dlp per cambiare la stringa UA. Per esempi di ciò che potresti mettere qui, controlla i seguenti due link: https://developer. ozilla.org/en-US/docs/Web/HTTP/Headers/User-Agent https://www.useragents.me/ Lascia vuoto per usare le stringhe UA predefinite generate dinamicamente.
sv_se: Experimentellt alternativ för att ställa in ett statiskt User-Agent-huvud i yt-dlp. Det rekommenderas inte typiskt av yt-dlp att ändra UA-strängen. För exempel på vad du kan sätta här, se följande två länkar: https://developer. ozilla.org/sv-SE/docs/Web/HTTP/Headers/User-Agent https://www.useragents.me/ Lämna tomt för att använda standardsträngar, dynamiskt genererade UA-strängar.

source: Experimental option to enable yt-dlp to use a YouTube account via OAuth2. When enabled, you must use the generated URL and code to authorize an account. The authorization token is then stored in the `%(oauthfile)s` file. This option should not be used when cookies are enabled. Using a personal account may not be recommended. Set yes to enable or no to disable.
it_it: Opzione sperimentale per abilitare yt-dlp per utilizzare un account YouTube tramite OAuth2. Se abilitato, è necessario utilizzare l'URL generato e il codice per autorizzare un account. Il token di autorizzazione viene quindi memorizzato nel file `%(oauthfile)s`. Questa opzione non deve essere utilizzata quando i cookie sono abilitati. L'utilizzo di un account personale potrebbe non essere raccomandato. Imposta sì per abilitare o no per disabilitare.
sv_se: Experimentellt alternativ för att aktivera yt-dlp att använda ett YouTube-konto via OAuth2. När den är aktiverad måste du använda den genererade URL:en och koden för att godkänna ett konto. Auktoriseringstoken lagras sedan i filen `%(oauthfile)s`. Detta alternativ bör inte användas när cookies är aktiverade. Att använda ett personligt konto kanske inte rekommenderas. Ställ in ja för att aktivera eller nej för att inaktivera.

source: Optional YouTube video URL used at start-up for triggering OAuth2 authorization. This starts the OAuth2 prompt early, rather than waiting for a song request. The URL set here should be an accessible YouTube video URL. Authorization must be completed before start-up will continue when this is set.
it_it: URL video di YouTube opzionale utilizzato all'avvio per attivare l'autorizzazione OAuth2. Questo avvia il prompt OAuth2 presto, piuttosto che aspettare una richiesta di canzone. L'URL impostato qui dovrebbe essere un URL video di YouTube accessibile. L'autorizzazione deve essere completata prima che l'avvio continui quando è impostato.
sv_se: Valfri YouTube-video-URL används vid uppstart för att utlösa OAuth2-behörighet. Detta startar OAuth2-prompten tidigt, snarare än att vänta på en låtbegäran. URL-adressen här bör vara en tillgänglig YouTube-video-URL. Auktoriseringen måste vara klar innan uppstart kommer att fortsätta när detta är inställt.

source: Toggle the user block list feature, without emptying the block list.
it_it: Attiva/disattiva la funzione lista blocchi utente, senza svuotare la lista blocchi.
sv_se: Växla funktionen för användarblocklistan, utan att tömma blocklistan.

source: An optional file path to a text file listing Discord User IDs, one per line.
it_it: Un percorso opzionale di un file di testo che elenca gli ID utente Discord, uno per riga.
sv_se: En valfri sökväg till en textfil som listar Discords användar-ID, en per rad.

source: Enable the song block list feature, without emptying the block list.
it_it: Abilita la funzione della lista dei brani, senza svuotare la lista dei blocchi.
sv_se: Aktivera funktionen för blockering av låtar, utan att tömma blocklistan.

source: An optional file path to a text file that lists URLs, words, or phrases one per line. Any song title or URL that contains any line in the list will be blocked.
it_it: Un percorso di file opzionale a un file di testo che elenca URL, parole o frasi una per riga. Qualsiasi titolo del brano o URL che contiene qualsiasi riga nella lista sarà bloccato.
sv_se: En valfri sökväg till en textfil som visar webbadresser, ord eller fraser en per rad. Varje låttitel eller URL som innehåller någon rad i listan kommer att blockeras.

source: An optional path to a directory containing auto playlist files. Each file should contain a list of playable URLs or terms, one track per line.
it_it: Un percorso opzionale a una directory contenente file di scaletta automatica. Ogni file deve contenere un elenco di URL o termini riproducibili, una traccia per riga.
sv_se: En valfri sökväg till en katalog som innehåller filer för automatisk spellista. Varje fil ska innehålla en lista över spelbara webbadresser eller termer, ett spår per rad.

source: An optional directory path where playable media files can be stored. All files and sub-directories can then be accessed by using 'file://' as a protocol. Example: file://some/folder/name/file.ext Maps to: %(path)s/some/folder/name/file.ext
it_it: Un percorso opzionale di directory dove possono essere memorizzati i file multimediali riproducibili. Tutti i file e le sottodirectory possono essere consultati usando 'file://' come protocollo. Esempio: file://some/folder/name/file.ext Mappe a: %(path)s/some/folder/name/file.ext
sv_se: En valfri sökväg där spelbara mediefiler kan lagras. Alla filer och underkataloger kan sedan nås genom att använda 'file://' som ett protokoll. Exempel: file://some/folder/name/file.ext Kartor till: %(path)s/some/folder/name/file.ext

source: An optional directory path where MusicBot will store long and short-term cache for playback.
it_it: Un percorso opzionale della directory in cui MusicBot memorizzerà la cache a lungo e breve termine per la riproduzione.
sv_se: En valfri sökväg där MusicBot lagrar lång- och kortsiktig cache för uppspelning.

source: Configure automatic log file rotation at restart, and limit the number of files kept. When disabled, only one log is kept and its contents are replaced each run. Set to 0 to disable. Maximum allowed number is %(max)s.
it_it: Configura la rotazione automatica del file di registro al riavvio e limita il numero di file conservati. Quando disabilitato, viene conservato un solo registro e il suo contenuto viene sostituito ogni esecuzione. Set to 0 to disable. Maximum allowed number is %(max)s.
sv_se: Konfigurera automatisk loggfil rotation vid omstart och begränsa antalet filer som behålls. När den är inaktiverad sparas endast en logg och dess innehåll byts ut varje körning. Sätt till 0 för att inaktivera. Maximalt tillåtet tal är %(max)s.

source: Configure the log file date format used when LogsMaxKept is enabled. If left blank, a warning is logged and the default will be used instead. Learn more about time format codes from the tables and data here: https://docs.python.org/3/library/datetime.html#strftime-strptime-behavior
it_it: Configura il formato della data del file di registro usato quando LogsMaxKept è abilitato. Se lasciato vuoto, viene registrato un avviso e verrà utilizzato il valore predefinito. Scopri di più sui codici di formato orario dalle tabelle e dai dati qui: https://docs.python.org/3/library/datetime.html#strftime-strptime-behavior
sv_se: Konfigurera loggfilens datumformat som används när LogsMaxKept är aktiverat. Om den lämnas tom, loggas en varning och standard kommer att användas istället. Läs mer om tidsformatkoder från tabeller och data här: https://docs.python.org/3/library/datetime.html#strftime-strptime-behavior

source: Error while reading config. Problem: One or more required config option sections are missing. The missing sections are: %(sections)s Solution: Repair your config options file. Each [Section] must appear only once, with no other text on the same line. Each section must have at least one option. Use the example options as a template or copy it from the repository.
it_it: Errore durante la lettura della configurazione. Problema: Mancano una o più sezioni di opzioni di configurazione richieste. Le sezioni mancanti sono: Soluzione %(sections)s : Riparare il file delle opzioni di configurazione. Ogni [Section] deve apparire una sola volta, senza nessun altro testo sulla stessa riga. Ogni sezione deve avere almeno un'opzione. Utilizzare le opzioni di esempio come modello o copiarlo dal repository.
sv_se: Fel vid läsning av konfigurationen. Problem: En eller flera obligatoriska konfigurationsalternativ saknas. De saknade avsnitten är: %(sections)s Lösning: Reparera konfigurationsalternativsfilen. Varje [Section] får bara visas en gång, utan någon annan text på samma rad. Varje avsnitt måste ha minst ett alternativ. Använd exempelalternativen som mall eller kopiera den från förrådet.

source: Error while validating config options. Problem: Config option AudioCachePath is not a directory. Solution: Make sure the path you configured is a path to a folder / directory.
it_it: Errore durante la convalida delle opzioni di configurazione. Problema: Opzione di configurazione AudioCachePath non è una directory. Soluzione: Assicurati che il percorso configurato sia un percorso per una cartella / directory.
sv_se: Fel vid validering av konfigurationsalternativ. Problem: Konfigurationsalternativet AudioCachePath är inte en katalog. Lösning: Kontrollera att sökvägen du har konfigurerat är en sökväg till en mapp / katalog.

source: Error while validating config options. Problem: AudioCachePath config option could not be set due to an error: %(raw_error)s Solution: Double check the setting is a valid, accessible directory path.
it_it: Errore durante la convalida delle opzioni di configurazione. Problema: l'opzione di configurazione AudioCachePath non può essere impostata a causa di un errore: %(raw_error)s Soluzione: Doppio controllo l'impostazione è valida, percorso directory accessibile.
sv_se: Fel vid validering av konfigurationsalternativ. Problem: AudioCachePath config option kunde inte ställas in på grund av ett fel: %(raw_error)s Solution: Dubbelkolla inställningen är giltig, sökväg för tillgänglig katalog.

source: Error while reading config options. Problem: No bot Token was specified in the config options or environment. Solution: Set the Token config option or set environment variable %(env_var)s with an App token.
it_it: Errore durante la lettura delle opzioni di configurazione. Problema: Nessun bot Token è stato specificato nelle opzioni di configurazione o ambiente. Soluzione: Imposta l'opzione di configurazione Token o imposta la variabile di ambiente %(env_var)s con un token App.
sv_se: Fel vid läsning av konfigurationsalternativ. Problem: Ingen bot Token angavs i konfigurationsalternativen eller miljön. Lösning: Ställ in konfigurationsalternativet eller ange miljövariabeln %(env_var)s med en app-token.

source: Error while fetching 'OwnerID' automatically. Problem: Discord App info is not available. This could be a temporary API outage or a bug. Solution: Manually set the 'OwnerID' config option or try again later.
it_it: Errore durante il recupero automatico di 'OwnerID'. Problema: Le informazioni Discord App non sono disponibili. Potrebbe trattarsi di un'interruzione temporanea delle API o di un bug. Soluzione : Imposta manualmente l'opzione di configurazione 'OwnerID' o riprova più tardi.
sv_se: Fel vid hämtning av 'OwnerID' automatiskt. Problem: Discord-appinfo är inte tillgänglig. Detta kan vara ett tillfälligt API-avbrott eller ett fel. Lösning: Ställ Manuellt in 'OwnerID' konfigurationsalternativet eller försök igen senare.

source: Error validating config options. Problem: The 'OwnerID' config is the same as your Bot / App ID. Solution: Do not use the Bot or App ID in the 'OwnerID' field.
it_it: Errore nella convalida delle opzioni di configurazione. Problema: La configurazione 'OwnerID' è la stessa del tuo Bot / ID app. Soluzione: Non utilizzare il Bot o l'App ID nel campo 'OwnerID'.
sv_se: Fel vid validering av konfigurationsalternativ. Problem: Konfigurationen 'OwnerID' är densamma som ditt Bot / App ID. Lösning: Använd inte Bot eller App ID i fältet 'OwnerID'.
