Repository: Just-Some-Bots/MusicBot
Catalog: i18n/*/LC_MESSAGES/musicbot_messages.po
Languages: it_it, sv_se

source: Could not convert `%(input)s` to a valid time in seconds.
it_it: Impossibile convertire `%(input)s` in un tempo valido in secondi.
sv_se: Kunde inte konvertera `%(input)s` till en giltig tid i sekunder.

source: Cannot seek to `%(input)s` (`%(seconds)s` seconds) in the current track with a length of `%(progress)s / %(total)s`
it_it: Impossibile cercare `%(input)s` (`%(seconds)s` secondi) nella traccia corrente con una lunghezza di `%(progress)s / %(total)s`
sv_se: Kan inte söka till `%(input)s` (`%(seconds)s` sekunder) i det aktuella spåret med en längd av `%(progress)s / %(total)s`

source: Seeking to time `%(input)s` (`%(seconds).2f` seconds) in the current song.
it_it: Cercando al tempo `%(input)s` (`%(seconds).2f` secondi) nella canzone corrente.
sv_se: Söker efter tid `%(input)s` (`%(seconds).2f` sekunder) i den aktuella låten.

source: Toggles playlist or song looping. If no option is provided the current song will be repeated. If no option is provided and the song is already repeating, repeating will be turned off.
it_it: Attiva/Disattiva scaletta o caricamento brano. Se non è fornita alcuna opzione, il brano corrente verrà ripetuto. Se non viene fornita alcuna opzione e il brano è già ripetuto, la ripetizione sarà disattivata.
sv_se: Växlar spellista eller låtslooping. Om inget alternativ anges kommer den aktuella låten att upprepas. Om inget alternativ finns och låten redan upprepas, kommer upprepningen att stängas av.

source: No songs are currently playing. Play something with a play command.
it_it: Nessun brano è attualmente in riproduzione. Riproduci qualcosa con un comando di riproduzione.
sv_se: Inga låtar spelas just nu. Spela något med ett låtkommando.

source: Invalid sub-command. Use the command `help repeat` for usage examples.
it_it: Sottocomando non valido. Usa il comando `help repeat` per gli esempi di utilizzo.
sv_se: Ogiltigt underkommando. Använd kommandot `help repeat` för användningsexempel.

source: Playlist is now repeating.
it_it: La scaletta ora si ripete.
sv_se: Spellistan repeterar nu.

source: Playlist is no longer repeating.
it_it: La scaletta non si ripete più.
sv_se: Spellistan repeterar inte längre.

source: Player will now loop the current song.
it_it: Il giocatore passerà ora alla canzone corrente.
sv_se: Spelaren kommer nu att loopa den aktuella låten.

source: Player will no longer loop the current song.
it_it: Il giocatore non passerà più al brano corrente.
sv_se: Spelaren kommer inte längre att loopa den aktuella låten.

source: Player is already looping a song!
it_it: Il giocatore sta già caricando una canzone!
sv_se: Spelaren har redan loopat en låt!

source: The player is not currently looping.
it_it: Il giocatore non si sta caricando.
sv_se: Spelaren loopar inte för närvarande.

source: Song is no longer repeating.
it_it: La canzone non si ripete più.
sv_se: Sången repeterar inte längre.

source: Song is now repeating.
it_it: La canzone si sta ripetendo.
sv_se: Sången repeterar nu.

source: Move song at position FROM to position TO.
it_it: Sposta il brano in posizione FROM alla posizione
sv_se: Flytta låten på plats FRÅN till plats TO.

source: Swap existing songs in the queue using their position numbers. Use the queue command to find track position numbers.
it_it: Scambia i brani esistenti nella coda usando i loro numeri di posizione. Usa il comando coda per trovare i numeri di posizione della traccia.
sv_se: Byt befintliga låtar i kön med hjälp av deras positionsnummer. Använd kökommandot för att hitta låtpositionsnummer.

source: There are no songs queued. Play something with a play command.
it_it: Non ci sono brani in coda. Riproduci qualcosa con un comando di riproduzione.
sv_se: Det finns inga låtar köade. Spela något med ett play-kommando.

source: Song positions must be integers!
it_it: Le posizioni brano devono essere intere!
sv_se: Sångpositioner måste vara heltal!

source: You gave a position outside the playlist size!
it_it: Hai dato una posizione fuori dalla dimensione della playlist!
sv_se: Du gav en position utanför spellistan storlek!

source: Successfully moved song from position %(from)s in queue to position %(to)s!
it_it: Hai spostato il brano dalla posizione %(from)s in coda alla posizione %(to)s!
sv_se: Låten flyttas framgångsrikt från position %(from)s i kö till position %(to)s!

source: This link contains a Playlist ID: `%(url)s` Do you want to queue the playlist too?
it_it: Questo link contiene un ID della Playlist: `%(url)s` Vuoi mettere in coda anche la playlist?
sv_se: Denna länk innehåller ett spellista-ID: `%(url)s` Vill du köa spellistan också?

source: Local media playback is not enabled.
it_it: La riproduzione multimediale locale non è abilitata.
sv_se: Lokal medieuppspelning är inte aktiverad.

source: Spotify URL is invalid or not currently supported.
it_it: L'URL di Spotify non è valido o non è attualmente supportato.
sv_se: Spotify-URL är ogiltig eller stöds inte för närvarande.

source: Detected a Spotify URL, but Spotify is not enabled.
it_it: Rilevato un URL Spotify, ma Spotify non è abilitato.
sv_se: Upptäckte en Spotify-URL, men Spotify är inte aktiverat.

source: You have reached your enqueued song limit (%(max)s)
it_it: Hai raggiunto il limite di canzone in coda (%(max)s)
sv_se: Du har nått din köade låtgräns (%(max)s)

source: Karaoke mode is enabled, please try again when its disabled!
it_it: La modalità Karaoke è abilitata, riprova quando è disabilitata!
sv_se: Karaoke-läget är aktiverat, försök igen när det är inaktiverat!

source: Failed to extract info due to error: %(raw_error)s
it_it: Impossibile estrarre le informazioni a causa di errore: %(raw_error)s
sv_se: Misslyckades att extrahera info på grund av fel: %(raw_error)s

source: That video cannot be played. Try using the stream command.
it_it: Questo video non può essere riprodotto. Prova a usare il comando streaming.
sv_se: Den videon kan inte spelas. Prova att använda strömkommandot.

source: YouTube search returned no results for: %(url)s
it_it: La ricerca su YouTube non ha prodotto alcun risultato per: %(url)s
sv_se: YouTube-sökning gav inga resultat för: %(url)s

source: No songs were added, all songs were over max duration (%(max)s seconds)
it_it: Nessuna canzone aggiunta, tutte le canzoni hanno una durata massima (%(max)s secondi)
sv_se: Inga låtar lades till, alla låtar var över max varaktighet (%(max)s sekunder)

source: Enqueued **%(number)s** songs to be played. Position in queue: %(position)s
it_it: Canzoni accodate **%(number)s** da riprodurre. Posizione nella coda: %(position)s
sv_se: Sångerna i kö **%(number)s** ska spelas. Position i kö: %(position)s

source: Song duration exceeds limit (%(length)s > %(max)s)
it_it: La durata del brano supera il limite (%(length)s > %(max)s)
sv_se: Sånglängden överskrider gränsen (%(length)s > %(max)s)

source: Enqueued `%(track)s` to be played. Position in queue: %(position)s
it_it: Accodato `%(track)s` per essere riprodotto. Posizione in coda: %(position)s
sv_se: Enqueued `%(track)s` ska spelas. Position i kön: %(position)s

source: Playing next!
it_it: Giocare dopo!
sv_se: Spelar nästa!

source: %(position)s - estimated time until playing: `%(eta)s`
it_it: %(position)s - tempo stimato fino alla riproduzione: `%(eta)s`
sv_se: %(position)s - uppskattad tid till att spela: `%(eta)s`

source: %(position)s - cannot estimate time until playing.
it_it: %(position)s - non può stimare il tempo fino alla riproduzione.
sv_se: %(position)s - kan inte uppskatta tiden innan du spelar.

source: Add a media URL to the queue as a Stream. The URL may be actual streaming media, like Twitch, Youtube, or a shoutcast like service. You can also use non-streamed media to play it without downloading it. Note: FFmpeg may drop the stream randomly or if connection hiccups happen.
it_it: Aggiungi un URL multimediale alla coda come Stream. L'URL può essere un reale media di streaming, come Twitch, Youtube, o un servizio come shoutcast. È anche possibile utilizzare i media non in streaming per riprodurli senza scaricarli. Nota: FFmpeg può rilasciare il flusso in modo casuale o se si verificano singhiozzi di connessione.
sv_se: Lägg till en media-URL i kön som en ström. URL kan vara faktiska strömmande medier, som Twitch, Youtube eller en shoutcast liknande tjänst. Du kan också använda icke-strömmade medier för att spela upp den utan att ladda ner den. Obs: FFmpeg kan släppa strömmen slumpmässigt eller om anslutning hicka händer.

source: Streaming playlists is not yet supported.
it_it: Le playlist in streaming non sono ancora supportate.
sv_se: Streaming av spellistor stöds ännu inte.

source: Now streaming track `%(track)s`
it_it: In streaming della traccia `%(track)s`
sv_se: Nu strömmande spår `%(track)s`

source: Search with service for a number of results with the search query.
it_it: Cerca con servizio per un certo numero di risultati con la query di ricerca.
sv_se: Sök med tjänst för ett antal resultat med sökfrågan.

source: Search YouTube for query but get a custom number of results. Note: the double-quotes are required in this case.
it_it: Cerca YouTube per la query ma ottieni un numero personalizzato di risultati. Nota: in questo caso sono necessarie le doppie quotazioni.
sv_se: Sök på YouTube efter frågor men få ett anpassat antal resultat. Obs: dubbelcitat krävs i detta fall.

source: Search a supported service and select from results to add to queue. Service and number arguments can be omitted, default number is 3 results. Select from these services: - yt, youtube (default) - sc, soundcloud - yh, yahoo
it_it: Cerca un servizio supportato e seleziona dai risultati da aggiungere alla coda. Gli argomenti servizio e numero possono essere omessi, il numero predefinito è 3 risultati. Select from these services: - yt, youtube (default) - sc, soundcloud - yh, yahoo
sv_se: Sök i en tjänst som stöds och välj från resultat att lägga till i kö. Service och nummerargument kan utelämnas, standardnummer är 3 resultat. Välj från dessa tjänster: - yt, youtube (standard) - sc, soundcloud - yh, yahoo

source: You have reached your playlist item limit (%(max)s)
it_it: Hai raggiunto il limite di elementi della playlist (%(max)s)
sv_se: Du har nått din gräns för spellistans objekt (%(max)s)

source: Please specify a search query. Use `help search` for more information.
it_it: Specifica una query di ricerca. Usa `help search` per maggiori informazioni.
sv_se: Ange en sökfråga. Använd `help search` för mer information.

source: You cannot search for more than %(max)s videos
it_it: Non puoi cercare più di %(max)s video
sv_se: Du kan inte söka efter mer än %(max)s videor

source: Searching for videos...
it_it: Ricerca video...
sv_se: Söker efter videor...

source: Search failed due to an error: %(error)s
it_it: Ricerca fallita a causa di un errore: %(error)s
sv_se: Sökning misslyckades på grund av ett fel: %(error)s

source: No videos found.
it_it: Nessun video trovato.
sv_se: Inga videor hittades.

source: To select a song, type the corresponding number.
it_it: Per selezionare un brano, digitare il numero corrispondente.
sv_se: För att välja en låt, skriv in motsvarande nummer.

source: Search results from %(service)s:
it_it: Risultati della ricerca da %(service)s:
sv_se: Sökresultat från %(service)s:

source: **%(index)s**. **%(track)s** | %(length)s
sv_se: **%(index)s**. **%(track)s** <unk> %(length)s

source: **0**. Cancel
it_it: **0**. Annulla
sv_se: **0**. Avbryt

source: Pick a song
it_it: Scegli un brano
sv_se: Välj en låt

source: Added song [%(track)s](%(url)s) to the queue.
it_it: Aggiunta canzone [%(track)s](%(url)s) alla coda.
sv_se: Lade till låt [%(track)s](%(url)s) till kön.

source: Result %(number)s of %(total)s: %(url)s
it_it: Risultato %(number)s di %(total)s: %(url)s
sv_se: Resultat %(number)s i %(total)s: %(url)s

source: Alright, coming right up!
it_it: Bene, arrivando a destra!
sv_se: Okej, kommer rakt upp!

source: Show information on what is currently playing.
it_it: Mostra informazioni su ciò che sta attualmente giocando.
sv_se: Visa information om vad som spelas just nu.

source: Now playing
it_it: In riproduzione
sv_se: Nu spelas

source: Currently streaming:
it_it: Attualmente in streaming:
sv_se: Strömmar just nu:

source: Currently playing:
it_it: In riproduzione:
sv_se: Spelar just nu:

source: Added By:
it_it: Aggiunto Da:
sv_se: Tillagd av:

source: Progress:
it_it: Progresso:
sv_se: Förlopp:

source: There are no songs queued! Queue something with a play command.
it_it: Non ci sono brani in coda! Coda qualcosa con un comando di riproduzione.
sv_se: Det finns inga låtar köade! Köa något med ett spelkommando.

source: Tell MusicBot to join the channel you're in.
it_it: Dica a MusicBot di unirsi al canale in cui ti trovi.
sv_se: Säg till MusicBot att gå med i kanalen du är i.

source: You are not connected to voice. Try joining a voice channel!
it_it: Non sei connesso alla voce. Prova ad unirti a un canale vocale!
sv_se: Du är inte ansluten till röst. Försök att ansluta till en röstkanal!

source: Connected to `%(channel)s`
it_it: Connesso a `%(channel)s`
sv_se: Ansluten till `%(channel)s`

source: Makes MusicBot follow a user when they change channels in a server.
it_it: Rendi MusicBot seguire un utente quando cambiano canali in un server.
sv_se: Gör MusicBot att följa en användare när de byter kanal på en server.

source: No longer following user `%(user)s`
it_it: Non più seguendo l'utente `%(user)s`
sv_se: Följer inte längre användaren `%(user)s`

source: Now following user `%(user)s` between voice channels.
it_it: Ora seguendo l'utente `%(user)s` tra i canali vocali.
sv_se: Nu följer användaren `%(user)s` mellan röstkanaler.

source: MusicBot cannot follow a user that is not a member of the server.
it_it: MusicBot non può seguire un utente che non è un membro del server.
sv_se: MusicBot kan inte följa en användare som inte är medlem i servern.

source: Will follow user `%(user)s` between voice channels.
it_it: Seguirà l'utente `%(user)s` tra i canali vocali.
sv_se: Följer användaren `%(user)s` mellan röstkanaler.

source: Pause playback if a track is currently playing.
it_it: Metti in pausa la riproduzione se una traccia è in riproduzione.
sv_se: Pausa uppspelning om en låt spelas upp.

source: Paused music in `%(channel)s`
it_it: Musica in pausa in `%(channel)s`
sv_se: Pausad musik i `%(channel)s`

source: Player is not playing.
it_it: Il giocatore non sta giocando.
sv_se: Spelaren spelar inte.

source: Resumes playback if the player was previously paused.
it_it: Riprende la riproduzione se il giocatore è stato precedentemente in pausa.
sv_se: Återuppspelning om spelaren tidigare var pausad.

source: Resumed music in `%(channel)s`
it_it: Riprendi musica in `%(channel)s`
sv_se: Återupptagen musik i `%(channel)s`

source: Resumed music queue
it_it: Ripresa coda musicale
sv_se: Återupptagen musikkö

source: Player is not paused.
it_it: Il giocatore non è in pausa.
sv_se: Spelaren är inte pausad.

source: Shuffle all current tracks in the queue.
it_it: Mischia tutte le tracce correnti nella coda.
sv_se: Blanda alla aktuella spår i kön.

source: Shuffled all songs in the queue.
it_it: Mischia tutte le canzoni nella coda.
sv_se: Blandade alla låtar i kön.

source: Removes all songs currently in the queue.
it_it: Rimuove tutti i brani attualmente in coda.
sv_se: Tar bort alla låtar i kön.

source: Cleared all songs from the queue.
it_it: Cancellati tutti i brani dalla coda.
sv_se: Rensade alla låtar från kön.

source: Remove a song from the queue, optionally at the given queue position. If the position is omitted, the song at the end of the queue is removed. Use the queue command to find position number of your track. However, positions of all songs are changed when a new song starts playing.
it_it: Rimuovi un brano dalla coda, opzionalmente alla posizione della coda data. Se la posizione viene omessa, il brano alla fine della coda viene rimosso. Usa il comando coda per trovare il numero di posizione della tua traccia. Tuttavia, le posizioni di tutte le canzoni sono cambiate quando una nuova canzone inizia a riprodurre.
sv_se: Ta bort en låt från kön, eventuellt på den givna köpositionen. Om positionen utelämnas tas låten i slutet av kön bort. Använd kökommandot för att hitta positionsnumret på din spår. Dock ändras positioner för alla låtar när en ny låt börjar spela.

source: Nothing in the queue to remove!
it_it: Niente nella coda da rimuovere!
sv_se: Ingenting i kön att ta bort!

source: Removed `%(track)s` added by `%(user)s`
it_it: Rimosso `%(track)s` aggiunto da `%(user)s`
sv_se: Tog bort `%(track)s` tillagd av `%(user)s`

source: Nothing found in the queue from user `%(user)s`
it_it: Niente trovato nella coda dall'utente `%(user)s`
sv_se: Ingenting hittades i kön från användaren `%(user)s`

source: You do not have the permission to remove that entry from the queue. You must be the one who queued it or have instant skip permissions.
it_it: Non hai il permesso di rimuovere questa voce dalla coda. Devi essere colui che l'ha accodata o che ha i permessi di salto istantanei.
sv_se: Du har inte behörighet att ta bort den posten från kön. Du måste vara den som köade det eller har omedelbar hoppa över behörigheter.

source: Invalid entry number. Use the queue command to find queue positions.
it_it: Numero di voce non valido. Usa il comando coda per trovare le posizioni della coda.
sv_se: Ogiltigt postnummer. Använd kökommandot för att hitta köpositioner.

source: Removed entry `%(track)s` added by `%(user)s`
it_it: Voce rimossa `%(track)s` aggiunta da `%(user)s`
sv_se: Tog bort post `%(track)s` tillagd av `%(user)s`

source: Removed entry `%(track)s`
it_it: Voce rimossa `%(track)s`
sv_se: Tog bort post `%(track)s`

source: Skip or vote to skip the current playing song. Members with InstaSkip permission may use force parameter to bypass voting. If LegacySkip option is enabled, the force parameter can be ignored.
it_it: Salta o vota per saltare la canzone in riproduzione. I membri con autorizzazione InstaSkip possono usare il parametro force per ignorare la votazione. Se l'opzione LegacySkip è abilitata, il parametro force può essere ignorato.
sv_se: Hoppa över eller rösta för att hoppa över den nuvarande låten. Medlemmar med InstaSkip tillstånd kan använda force parameter för att kringgå röstning. Om LegacySkip -alternativet är aktiverat kan kraftparametern ignoreras.

source: Can't skip! The player is not playing!
it_it: Impossibile saltare! Il giocatore non sta giocando!
sv_se: Kan inte hoppa över! Spelaren spelar inte!

source: The next song `%(track)s` is downloading, please wait.
it_it: La prossima canzone `%(track)s` è in download, si prega di attendere.
sv_se: Nästa låt `%(track)s` laddas ner, vänligen vänta.

source: The next song will be played shortly. Please wait.
it_it: La prossima canzone verrà riprodotta a breve. Attendere prego.
sv_se: Nästa låt kommer att spelas inom kort. Vänligen vänta.

source: Something odd is happening. You might want to restart the bot if it doesn't start working.
it_it: Qualcosa di strano sta accadendo. Potresti voler riavviare il bot se non inizia a funzionare.
sv_se: Något udda händer. Du kanske vill starta om boten om den inte börjar fungera.

source: Something strange is happening. You might want to restart the bot if it doesn't start working.
it_it: Sta accadendo qualcosa di strano. Potresti voler riavviare il bot se non inizia a funzionare.
sv_se: Något konstigt händer. Du kanske vill starta om boten om den inte börjar fungera.

source: You do not have permission to force skip a looped song.
it_it: Non hai il permesso di forzare un brano in loop.
sv_se: Du har inte behörighet att tvinga hoppa över en loopad låt.

source: Force skipped `%(track)s`.
it_it: Forza saltata `%(track)s`.
sv_se: Tvinga hoppad `%(track)s`.

source: You do not have permission to force skip.
it_it: Non hai il permesso di forzare il salto.
sv_se: Du har inte behörighet att tvinga hopp.

source: You do not have permission to skip a looped song.
it_it: Non hai il permesso di saltare una canzone in loop.
sv_se: Du har inte behörighet att hoppa över en loopad låt.

source: Your skip for `%(track)s` was acknowledged. The vote to skip has been passed.%(next_up)s
it_it: Il tuo salto per `%(track)s` è stato riconosciuto. Il voto da saltare è stato passato.%(next_up)s
sv_se: Din skip för `%(track)s` godkändes. Omröstningen att hoppa över har passerats.%(next_up)s

source: Next song coming up!
it_it: Prossima canzone in arrivo!
sv_se: Nästa låt kommer!

source: Your skip for `%(track)s` was acknowledged. Need **%(votes)s** more vote(s) to skip this song.
it_it: Il tuo salto per `%(track)s` è stato riconosciuto. Hai bisogno di **%(votes)s** più voto(i) per saltare questa canzone.
sv_se: Din hoppa över `%(track)s` blev erkänd. Behöver **%(votes)s** fler röster för att hoppa över denna låt.

source: Set the output volume level of MusicBot from 1 to 100. Volume parameter allows a leading + or - for relative adjustments. The volume setting is retained until MusicBot is restarted.
it_it: Impostare il livello di volume di uscita di MusicBot da 1 a 100. Il parametro del volume consente un leader + o - per le relative regolazioni. L'impostazione del volume viene mantenuta fino al riavvio di MusicBot.
sv_se: Set the output volume level of MusicBot from 1 to 100. Volymparameter tillåter en ledande + eller - för relativa justeringar. Volyminställningen behålls tills MusicBot startas om.

source: Current volume: `%(volume)s%%`
it_it: Volume attuale: `%(volume)s%%`
sv_se: Nuvarande volym: `%(volume)s%%`

source: `%(new_volume)s` is not a valid number
it_it: `%(new_volume)s` non è un numero valido
sv_se: `%(new_volume)s` är inte ett giltigt tal

source: Updated volume from **%(old)d** to **%(new)d**
it_it: Volume aggiornato da **%(old)d** a **%(new)d
sv_se: Uppdaterad volym från **%(old)d** till **%(new)d**

source: Unreasonable volume change provided: %(old_volume)s%(adjustment)s is %(new_volume)s. Volume can only be set from 1 to 100.
it_it: Variazione di volume irragionevole fornita: %(old_volume)s%(adjustment)s è %(new_volume)s. Il volume può essere impostato solo da 1 a 100.
sv_se: Orimlig volymförändring angiven: %(old_volume)s%(adjustment)s är %(new_volume)s. Volymen kan endast ändras från 1 till 100.

source: Unreasonable volume provided: %(volume)s. Provide a value between 1 and 100.
it_it: Volume irragionevole fornito: %(volume)s. Fornire un valore compreso tra 1 e 100.
sv_se: Orimlig volym angiven: %(volume)s. Ange ett värde mellan 1 och 100.

source: Change the playback speed of the currently playing track only. The rate must be between 0.5 and 100.0 due to ffmpeg limits. Streaming playback does not support speed adjustments.
it_it: Cambia la velocità di riproduzione solo della traccia in riproduzione. La velocità deve essere compresa tra 0.5 e 100. a causa dei limiti di ffmpeg. La riproduzione in streaming non supporta le regolazioni della velocità.
sv_se: Ändra endast uppspelningshastigheten för den nuvarande uppspelningslåten. Graden måste vara mellan 0.5 och 100. på grund av ffmpeg begränsningar. Uppspelning av strömning stöder inte hastighetsjusteringar.

source: No track is playing, cannot set speed. Use the config command to set a default playback speed.
it_it: Nessuna traccia in riproduzione, non è possibile impostare la velocità. Utilizzare il comando di configurazione per impostare una velocità di riproduzione predefinita.
sv_se: Inget spår spelas, kan inte ställa in hastighet. Använd konfigurationskommandot för att ställa in en standard uppspelningshastighet.

source: Speed cannot be applied to streamed media.
it_it: La velocità non può essere applicata ai media in streaming.
sv_se: Hastighet kan inte tillämpas på strömmade medier.
