Repository: Just-Some-Bots/MusicBot
Catalog: i18n/*/LC_MESSAGES/musicbot_logs.po
Languages: it_it, pl_pl, zh_cn

source: Aliases file not found, copying example_aliases.json
it_it: File alias non trovato, copia di example_aliases.json
pl_pl: Plik aliasów nie został znaleziony, kopiowanie przykładu_aliases.json
zh_cn: 找不到别名文件，正在复制 example_aliases.json

source: Error while loading aliases. Problem: Your aliases files (aliases.json & example_aliases.json) are missing. Solution: Replace the alias config file(s) or copy them from: https://github.com/Just-Some-Bots/MusicBot/
it_it: Errore durante il caricamento delle alias. Problema: Mancano i tuoi file alias (aliases.json & example_aliases.json). Soluzione : Sostituire il file di configurazione alias o copiarlo da: https://github.com/Just-Some-Bots/MusicBot/
pl_pl: Błąd podczas ładowania realizacji. Problem: Brakuje Twoich plików aliases.json & example_aliases.json. Rozwiązanie: Zastąp plik konfiguracyjny aliasu lub skopiuj go z https://github.com/Just-Some-Bots/MusicBot/

source: Failed to load aliases file: %s
it_it: Caricamento del file alias non riuscito: %s
pl_pl: Nie udało się załadować pliku aliasów: %s
zh_cn: 加载别名文件失败： %s

source: Failed to parse aliases file: %s Ensure the file contains valid JSON and restart the bot.
it_it: Analisi del file alias non riuscita: %s Assicurarsi che il file contenga JSON valido e riavviare il bot.
pl_pl: Nie udało się przetworzyć pliku aliasów: %s Upewnij się, że plik zawiera poprawny JSON i zrestartuj bota.
zh_cn: 解析别名文件失败： %s 确保文件包含有效的 JSON 并重启机器人。

source: Aliases skipped for non-existent command: %(command)s -> %(aliases)s
it_it: Alias saltati per il comando inesistente: %(command)s -> %(aliases)s
pl_pl: Aliasy pominięte dla nieistniejącego polecenia: %(command)s -> %(aliases)s

source: Alias(es) skipped for invalid alias data: %(command)s -> %(aliases)s
it_it: Alias(es) saltato per dati alias non validi: %(command)s -> %(aliases)s
pl_pl: Alias(y) pominięto dla nieprawidłowych danych aliasu: %(command)s -> %(aliases)s

source: Alias `%(alias)s` skipped as already exists on command: %(command)s
it_it: Alias `%(alias)s` saltato come esiste già sul comando: %(command)s
pl_pl: Alias `%(alias)s` pominięty jako już istnieje na polecenie: %(command)s

source: Error loading auto playlist file: %s
it_it: Errore nel caricare il file di scaletta automatica: %s
pl_pl: Błąd ładowania pliku automatycznej playlisty: %s
zh_cn: 加载自动播放列表文件时出错： %s

source: Removing unplayable song from playlist, %(playlist)s: %(track)s
it_it: Rimozione del brano non riproducibile dalla playlist, %(playlist)s: %(track)s
pl_pl: Usuwanie nieodtwarzanej piosenki z listy odtwarzania, %(playlist)s: %(track)s

source: Removing song from playlist, %(playlist)s: %(track)s
it_it: Rimozione del brano dalla playlist, %(playlist)s: %(track)s
pl_pl: Usuwanie utworu z listy odtwarzania, %(playlist)s: %(track)s

source: Could not log information about the playlist URL removal.
it_it: Impossibile registrare le informazioni sulla rimozione dell'URL della playlist.
pl_pl: Nie można zalogować informacji o usunięciu adresu URL playlisty.
zh_cn: 无法记录播放列表URL移除信息。

source: Updating playlist file...
it_it: Aggiornamento file playlist...
pl_pl: Aktualizowanie pliku playlisty...
zh_cn: 正在更新播放列表文件...

source: Failed to save playlist file: %s
it_it: Salvataggio del file playlist non riuscito: %s
pl_pl: Nie udało się zapisać pliku listy odtwarzania: %s
zh_cn: 保存播放列表文件失败： %s

source: URL already in playlist %s, ignoring
it_it: URL già in playlist %s, ignorando
pl_pl: Adres URL jest już na liście odtwarzania %s, ignoruje
zh_cn: 已经在播放列表 %s中的 URL，忽略

source: Adding new URL to playlist, %(playlist)s: %(track)s
it_it: Aggiunta di un nuovo URL alla playlist, %(playlist)s: %(track)s
pl_pl: Dodawanie nowego adresu URL do listy odtwarzania, %(playlist)s: %(track)s

source: Initializing MusicBot %s
it_it: Inizializzazione MusicBot %s
pl_pl: Inicjowanie MusicBot %s
zh_cn: 正在初始化 MusicBot %s

source: Loop is closed, cannot create task for: %r
it_it: Loop è chiuso, impossibile creare task per: %r
pl_pl: Pętla jest zamknięta, nie można utworzyć zadania dla: %r

source: Unhandled exception for task: %r
it_it: Eccezione non gestita per l'attività: %r
pl_pl: Nieobsługiwany wyjątek dla zadania: %r
zh_cn: 任务未处理异常： %r

source: Unhandled exception for task: %(task)r -- %(raw_error)s
it_it: Eccezione non gestita per l'attività: %(task)r -- %(raw_error)s
pl_pl: Nieobsługiwany wyjątek dla zadania: %(task)r -- %(raw_error)s

source: Spotify did not provide us with a token. Disabling.
it_it: Spotify non ci ha fornito un token. Disattivazione.
pl_pl: Spotify nie dostarczył nam tokenu. Wyłączanie.
zh_cn: Spotify没有为我们提供令牌。禁用。

source: Authenticated with Spotify successfully using client ID and secret.
it_it: Autenticato con Spotify con successo utilizzando l'ID client e segreto.
pl_pl: Uwierzytelniono ze Spotify za pomocą identyfikatora klienta i sekretu.
zh_cn: 通过Spotify验证成功使用客户端 ID 和秘密。

source: Could not start Spotify client. Is your client ID and secret correct? Details: %s. Continuing anyway in 5 seconds...
it_it: Impossibile avviare il client Spotify. Il tuo ID client e segreto sono corretti? Dettagli: %s. Continuare comunque in 5 secondi...
pl_pl: Nie można uruchomić klienta Spotify. Czy Twój identyfikator klienta i tajne dane są poprawne? Szczegóły: %s. Kontynuuj mimo to za 5 sekund...

source: The config did not have Spotify app credentials, attempting to use guest mode.
it_it: La configurazione non ha le credenziali dell'applicazione Spotify, tentando di utilizzare la modalità ospite.
pl_pl: Konfiguracja nie posiadała poświadczeń aplikacji Spotify, próbując użyć trybu gościa.
zh_cn: 配置没有 Spotify 应用凭据，正在尝试使用访客模式。

source: Authenticated with Spotify successfully using guest mode.
it_it: Autenticato con Spotify con successo utilizzando la modalità ospite.
pl_pl: Uwierzytelniono ze Spotify za pomocą trybu gościa.
zh_cn: 使用 Spotify 验证成功使用访客模式。

source: Could not start Spotify client using guest mode. Details: %s.
it_it: Impossibile avviare il client Spotify usando la modalità ospite. Dettagli: %s.
pl_pl: Nie można uruchomić klienta Spotify w trybie gościa. Szczegóły: %s.

source: Experimental Yt-dlp OAuth2 plugin is enabled. This might break at any point!
it_it: Il plugin sperimentale Yt-dlp OAuth2 è abilitato. Questo potrebbe rompere in qualsiasi punto!
pl_pl: Eksperymentalna wtyczka Yt-dlp OAuth2 jest włączona. Może się to zepsuć w dowolnym momencie!
zh_cn: 实验性的 Yt-dlp OAuth2 插件已启用。这可能会在任何时候中断！

source: Initialized, now connecting to discord.
it_it: Inizializzato, ora si collega alla discordia.
pl_pl: Zainicjowano połączenie, a teraz połączenie z discordem.
zh_cn: 已初始化，正在连接到 discord。

source: Network ping test is disabled via config.
it_it: Il test di rete ping è disabilitato tramite config.
pl_pl: Test ping sieci jest wyłączony przez konfigurację.
zh_cn: 通过配置禁用网络ping测试。

source: Network ping test is closing down.
it_it: Test ping di rete si sta chiudendo.
pl_pl: Test ping sieci jest zamknięty.
zh_cn: 网络Ping 测试正在关闭。

source: Could not resolve ping target.
it_it: Impossibile risolvere il ping target.
pl_pl: Nie można rozwiązać celu ping.
zh_cn: 无法解析 ping 目标。

source: Network ping test cancelled.
it_it: Test ping di rete annullato.
pl_pl: Test ping sieci został anulowany.
zh_cn: 网络Ping 测试已取消。

source: Network testing via HTTP does not have a session to borrow.
it_it: Il test di rete tramite HTTP non ha una sessione in prestito.
pl_pl: Testowanie sieci przez HTTP nie ma sesji do pożyczenia.
zh_cn: 通过 HTTP 进行网络测试没有要借用的会话。

source: Could not locate `ping` executable in your environment.
it_it: Impossibile trovare l'eseguibile `ping` nel tuo ambiente.
pl_pl: Nie można zlokalizować pliku wykonywalnego `ping` w twoim środowisku.
zh_cn: 无法在您的环境中找到 ping` 可执行文件。

source: MusicBot could not locate a `ping` command path. Will attempt to use HTTP ping instead. MusicBot tried the following command: %s You should enable ping in your system or container environment for best results. Alternatively disable network checking via config.
it_it: MusicBot non può trovare un percorso di comando `ping`. Tenterà invece di usare il ping HTTP. MusicBot ha provato il seguente comando: %s Dovresti abilitare il ping nel tuo ambiente di sistema o contenitore per ottenere i migliori risultati. In alternativa disabilita il controllo di rete tramite config.
pl_pl: MusicBot nie mógł zlokalizować ścieżki komendy `ping`. Zamiast tego spróbuje użyć ping HTTP. MusicBot wypróbował następujące polecenie: %s Powinieneś włączyć ping w systemie lub kontenerowce, aby uzyskać najlepsze wyniki. Alternatywnie wyłącz sprawdzanie sieci przez konfigurację.

source: MusicBot was denied permission to execute the `ping` command. Will attempt to use HTTP ping instead. MusicBot tried the following command: %s You should enable ping in your system or container environment for best results. Alternatively disable network checking via config.
it_it: MusicBot è stato negato il permesso di eseguire il comando `ping`. Tenterà invece di usare il ping HTTP. MusicBot ha provato il seguente comando: %s Dovresti abilitare il ping nel tuo ambiente di sistema o contenitore per ottenere i migliori risultati. In alternativa disabilita il controllo di rete tramite config.
pl_pl: MusicBot został pozbawiony uprawnień do wykonania komendy `ping`. Zamiast tego spróbuje użyć ping HTTP. MusicBot wypróbował następujące polecenie: %s Powinieneś włączyć ping w systemie lub kontenerowce, aby uzyskać najlepsze wyniki. Alternatywnie wyłącz sprawdzanie sieci przez konfigurację.

source: Your environment may not allow the `ping` system command. Will attempt to use HTTP ping instead. MusicBot tried the following command: %s You should enable ping in your system or container environment for best results. Alternatively disable network checking via config.
it_it: Il tuo ambiente potrebbe non consentire il comando di sistema `ping`. Tenterà invece di usare il ping HTTP. MusicBot ha provato il seguente comando: %s Dovresti abilitare il ping nel tuo ambiente di sistema o contenitore per ottenere i migliori risultati. In alternativa disabilita il controllo di rete tramite config.
pl_pl: Twoje środowisko może nie zezwolić na komendę systemową `ping`. Zamiast tego spróbuje użyć ping HTTP. MusicBot wypróbował następujące polecenie: %s Powinieneś włączyć ping w systemie lub kontenerowce, aby uzyskać najlepsze wyniki. Alternatywnie wyłącz sprawdzanie sieci przez konfigurację.

source: MusicBot detected network is available again.
it_it: MusicBot rilevato rete è nuovamente disponibile.
pl_pl: Sieć MusicBot jest znów dostępna.
zh_cn: 侦测到的 MusicBot 网络再次可用.

source: VoiceClient is not connected, waiting to resume MusicPlayer...
it_it: VoiceClient non è connesso, in attesa di riprendere MusicPlayer...
pl_pl: VoiceClient nie jest połączony, oczekiwanie na wznowienie MusicPlayer...
zh_cn: 语音客户端未连接，正在等待恢复 MusicPlayer...

source: Resuming playback of player: (%(guild_id)s) %(player)r
it_it: Riprendendo la riproduzione del giocatore: (%(guild_id)s) %(player)r
pl_pl: Wznawianie odtwarzania gracza: (%(guild_id)s) %(player)r

source: MusicBot detected a network outage.
it_it: MusicBot ha rilevato un'interruzione di rete.
pl_pl: MusicBot wykrył przerwę sieciową.
zh_cn: MusicBot 检测到网络停用。

source: Pausing MusicPlayer due to network availability: (%(guild_id)s) %(player)r
it_it: Pausa MusicPlayer a causa della disponibilità della rete: (%(guild_id)s) %(player)r
pl_pl: Wstrzymanie MusicPlayera z powodu dostępności sieci: (%(guild_id)s) %(player)r

source: Looking for owner in guild: %(guild)s (required voice: %(required)s) and got: %(owner)s
it_it: Alla ricerca del proprietario nella gilda: %(guild)s (voce obbligatoria: %(required)s) e ottiene: %(owner)s
pl_pl: Szukasz właściciela w gildii: %(guild)s (wymagany głos: %(required)s) i otrzymany: %(owner)s

source: Checking for channels to auto-join or resume...
it_it: Controllo della presenza di canali da auto-entrare o riprendere...
pl_pl: Sprawdzanie kanału do automatycznego dołączenia lub wznowienia ...
zh_cn: 正在检查频道以自动加入或恢复...

source: Guild not available, cannot auto join: %(id)s/%(name)s
it_it: Gilda non disponibile, impossibile entrare automaticamente: %(id)s/%(name)s
pl_pl: Gildia niedostępna, nie można automatycznie dołączyć: %(id)s/%(name)s

source: Found resumable voice channel: %(channel)s in guild: %(guild)s
it_it: Trovato canale vocale riproducibile: %(channel)s nella gilda: %(guild)s
pl_pl: Znaleziono wznawiany kanał głosowy: %(channel)s w gildii: %(guild)s

source: Will try resuming voice session instead of Auto-Joining channel: %s
it_it: Proverà a riprendere la sessione vocale invece di entrare automaticamente nel canale: %s
pl_pl: Spróbuje wznowić sesję głosową zamiast kanału automatycznego dołączenia: %s

source: Found owner in voice channel: %s
it_it: Trovato proprietario nel canale vocale: %s
pl_pl: Znaleziono właściciela na kanale głosowym: %s

source: Ignoring resumable channel, AutoSummon to owner in channel: %s
it_it: Ignorando il canale riattivabile, AutoSummon al proprietario nel canale: %s
pl_pl: Ignorowanie wznawianego kanału, Automatyczne przywoływanie do właściciela na kanale: %s

source: Ignoring Auto-Join channel, AutoSummon to owner in channel: %s
it_it: Ignorando il canale Auto-Entra automatico, AutoSummon al proprietario nel canale: %s
pl_pl: Ignorowanie kanału Auto-Dołącz automatycznie, AutoSummon do właściciela na kanale: %s

source: Already connected to channel: %(channel)s in guild: %(guild)s
it_it: Già connesso al canale: %(channel)s nella gilda: %(guild)s
pl_pl: Już połączono z kanałem: %(channel)s w gildii: %(guild)s

source: Attempting to join channel: %(channel)s in guild: %(guild)s
it_it: Tentativo di entrare nel canale: %(channel)s nella gilda: %(guild)s
pl_pl: Próba dołączenia do kanału: %(channel)s w gildii: %(guild)s

source: Discarding MusicPlayer and making a new one...
it_it: Scartare MusicPlayer e crearne uno nuovo...
pl_pl: Odrzucanie MusicPlayer i tworzenie nowego...
zh_cn: 丢弃音乐播放器并制作新音乐...

source: MusicBot will make a new MusicPlayer now...
it_it: MusicBot renderà un nuovo MusicPlayer ora...
pl_pl: MusicBot zrobi teraz nowego MusicPlayer
zh_cn: MusicBot 现在将创建一个新的 MusicPlayer ...

source: Not joining %(guild)s/%(channel)s, it isn't a supported voice channel.
it_it: Non entrando in %(guild)s/%(channel)s, non è un canale vocale supportato.
pl_pl: Nie dołączysz do %(guild)s/%(channel)s, nie jest to obsługiwany kanał głosowy.

source: Finished joining configured channels.
it_it: Completato il collegamento ai canali configurati.
pl_pl: Zakończono dołączanie skonfigurowanych kanałów.
zh_cn: 已完成加入配置频道。

source: Member is not voice-enabled and cannot use this command.
it_it: Il membro non è abilitato alla voce e non può usare questo comando.
pl_pl: Użytkownik nie jest włączony głosowo i nie może użyć tego polecenia.
zh_cn: 会员没有语音功能，无法使用此命令。

source: You cannot use this command when not in the voice channel.
it_it: Non puoi usare questo comando quando non è nel canale vocale.
pl_pl: Nie możesz użyć tej komendy gdy nie jest na kanale głosowym.
zh_cn: 您不能在语音频道中使用此命令。

source: Getting bot Application Info.
it_it: Ottenere bot Application Info.
pl_pl: Informacje o aplikacji bota.
zh_cn: 正在获取机器人应用程序信息。

source: MusicBot does not have permission to Connect in channel: %s
it_it: MusicBot non ha il permesso di connettersi nel canale: %s
pl_pl: MusicBot nie ma uprawnień do połączenia na kanale: %s

source: MusicBot does not have permission to Connect in channel: `%(name)s`
it_it: MusicBot non ha il permesso di connettersi nel canale: `%(name)s`
pl_pl: MusicBot nie ma uprawnień do połączenia na kanale: `%(name)s`

source: MusicBot does not have permission to Speak in channel: %s
it_it: MusicBot non ha il permesso di parlare nel canale: %s
pl_pl: MusicBot nie ma uprawnień do mówienia na kanale: %s

source: MusicBot does not have permission to Speak in channel: `%(name)s`
it_it: MusicBot non ha il permesso di parlare nel canale: `%(name)s`
pl_pl: MusicBot nie ma uprawnień do mówienia na kanale: `%(name)s`

source: Reusing bots VoiceClient from guild: %s
it_it: Riutilizzo di bot VoiceClient dalla gilda: %s
pl_pl: Ponowne użycie botów VoiceClient z gildii: %s

source: Forcing disconnect on stale VoiceClient in guild: %s
it_it: Forzare la disconnessione su VoiceClient obsoleto nella gilda: %s
pl_pl: Wymuszam rozłączenie na Niebieskim VoiceClient w gildii: %s

source: Disconnect failed or was cancelled?
it_it: Disconnessione fallita o annullata?
pl_pl: Rozłączenie nie powiodło się lub zostało anulowane?
zh_cn: 断开连接失败或已取消？

source: MusicBot is unable to connect to the channel right now: %(channel)s
it_it: MusicBot non è in grado di connettersi al canale in questo momento: %(channel)s
pl_pl: MusicBot nie może teraz połączyć się z kanałem: %(channel)s

source: MusicBot could not connect to the channel. Try again later, or restart the bot if this continues.
it_it: MusicBot non può connettersi al canale. Riprova più tardi, o riavvia il bot se continua.
pl_pl: MusicBot nie mógł połączyć się z kanałem. Spróbuj ponownie później lub zrestartuj bota jeśli to będzie kontynuowane.

source: MusicBot has a VoiceClient now...
it_it: MusicBot ha un VoiceClient ora...
pl_pl: MusicBot ma teraz VoiceClient...
zh_cn: MusicBot 现在有一个语音客户端...

source: Retrying connection after a timeout error (%(attempt)s) while trying to connect to: %(channel)s
it_it: Riprovare la connessione dopo un errore di timeout (%(attempt)s) durante il tentativo di connettersi a: %(channel)s
pl_pl: Ponawianie próby połączenia po przekroczeniu limitu czasu (%(attempt)s) podczas próby połączenia z: %(channel)s

source: MusicBot VoiceClient connection attempt was cancelled. No retry.
it_it: Il tentativo di connessione MusicBot VoiceClient è stato annullato. Nessun riprovo.
pl_pl: Próba połączenia MusicBot VoiceClient została anulowana. Bez ponawiania próby.
zh_cn: MusicBot 语音客户端连接尝试已取消。无需重试。

source: MusicBot connection to voice was cancelled. This is odd. Maybe restart?
it_it: La connessione MusicBot alla voce è stata annullata. Questo è strano. Forse riavviare?
pl_pl: Połączenie MusicBot z głosowaniem zostało anulowane. To jest dziwne. Może zrestartować?
zh_cn: MusicBot 与语音的连接已取消。这是奇异的。可能要重新启动吗？

source: MusicBot is requesting to speak in channel: %s
it_it: MusicBot sta chiedendo di parlare nel canale: %s
pl_pl: MusicBot prosi o mówienie na kanale: %s
zh_cn: MusicBot 请求在频道中说话: %s

source: MusicBot does not have permission to speak.
it_it: MusicBot non ha il permesso di parlare.
pl_pl: MusicBot nie ma uprawnień do mówienia.
zh_cn: MusicBot 没有发言权限。

source: MusicBot could not request to speak.
it_it: MusicBot non può richiedere di parlare.
pl_pl: MusicBot nie mógł prosić o głos.
zh_cn: MusicBot 无法请求发言。

source: Disconnecting a MusicPlayer in guild: %s
it_it: Disconnettere un musicista nella gilda: %s
pl_pl: Rozłączanie MusicPlayer w gildii: %s

source: Disconnecting VoiceClient before we kill the MusicPlayer.
it_it: Scollegare VoiceClient prima di uccidere MusicPlayer.
pl_pl: Rozłączanie VoiceClient zanim zabijemy MusicPlayera.
zh_cn: 在杀死MusicPlayer前断开语音客户端。

source: The disconnect failed or was cancelled.
it_it: La disconnessione non è riuscita o è stata annullata.
pl_pl: Rozłączenie nie powiodło się lub zostało anulowane.
zh_cn: 断开连接失败或取消。

source: MusicBot has a VoiceProtocol that is not a VoiceClient. Disconnecting anyway...
it_it: MusicBot ha un VoiceProtocol che non è un VoiceClient. Disconnettersi comunque...
pl_pl: MusicBot ma VoiceProtocol który nie jest VoiceClient. Rozłączanie mimo to...
zh_cn: MusicBot 有一个不是语音客户端的语音协议，仍然断开连接...

source: Disconnecting a rogue VoiceClient in guild: %s
it_it: Disconnettere un VoiceClient canaglia nella gilda: %s
pl_pl: Rozłączanie rogue VoiceClient w gildii: %s

source: Disconnecting a non-guild VoiceClient...
it_it: Disconnettere un non-guild VoiceClient...
pl_pl: Rozłączanie niegildii VoiceClient...
zh_cn: 断开非公会语音客户端的连接...

source: MusicBot.voice_clients list contains a non-VoiceClient object? The object is actually of type: %s
it_it: La lista MusicBot.voice_clients contiene un oggetto non-VoiceClient? L'oggetto è in realtà di tipo: %s
pl_pl: Lista MusicBot.voice_clients zawiera obiekt niebędący VoiceClient? Obiekt jest w rzeczywistości typu: %s

source: We still have a MusicPlayer ref in guild (%(guild_id)s): %(player)r
it_it: Abbiamo ancora un lettore musicale nella gilda (%(guild_id)s): %(player)r
pl_pl: Wciąż mamy ref MusicPlayer w gildii (%(guild_id)s): %(player)r

source: Guild (%(guild)s) wants a player, optional: %(player)r
it_it: Gilda (%(guild)s) vuole un giocatore, opzionale: %(player)r
pl_pl: Gildia (%(guild)s) chce gracza, opcjonalnie: %(player)r

source: [BUG] MusicPlayer is missing a VoiceClient somehow. You should probably restart the bot.
it_it: [BUG] MusicPlayer manca un VoiceClient in qualche modo. Probabilmente dovresti riavviare il bot.
pl_pl: [BUG] MusicPlayer brakuje jak. Prawdopodobnie powinieneś zrestartować bota.

source: MusicPlayer has a VoiceClient that is not connected.
it_it: MusicPlayer ha un VoiceClient che non è connesso.
pl_pl: MusicPlayer ma VoiceClient, który nie jest połączony.
zh_cn: MusicPlayer 有一个未连接的语音客户端。

source: Getting a MusicPlayer for guild: %(guild)s In Channel: %(channel)s Create: %(create)s Deserialize: %(serial)s
it_it: Ottenere un MusicPlayer per la gilda: %(guild)s Nel Canale: %(channel)s Crea: %(create)s Deserializza: %(serial)s
pl_pl: Otrzymywanie MusicPlayer dla gildii: %(guild)s na kanale: %(channel)s Utwórz: %(create)s Deserialize: %(serial)s

source: Created player via deserialization for guild %(guild_id)s with %(number)s entries
it_it: Giocatore creato tramite deserializzazione per la gilda %(guild_id)s con voci %(number)s
pl_pl: Utworzono gracza poprzez deserializację dla gildii %(guild_id)s z wpisami %(number)s

source: The bot is not in a voice channel. Use the summon command to bring the bot to your voice channel.
it_it: Il bot non è in un canale vocale. Usa il comando summon per portare il bot sul tuo canale vocale.
pl_pl: Bot nie jest na kanale głosowym. Użyj polecenia przywołania, aby przenieść bota do kanału głosowego.

source: Something is wrong, we didn't get the VoiceClient.
it_it: Qualcosa è sbagliato, non abbiamo ottenuto il VoiceClient.
pl_pl: Coś jest nie tak. Nie otrzymaliśmy VoiceClient.
zh_cn: 出错了，我们没有得到语音客户端。

source: Running on_player_play
it_it: Esecuzione on_player_play
pl_pl: Uruchamianie_gracz_gracza
zh_cn: 运行_player_player

source: Setting URL history guild %(guild_id)s == %(url)s
it_it: Impostazione della gilda cronologia URL %(guild_id)s == %(url)s
pl_pl: Ustawianie gildii historii URL %(guild_id)s == %(url)s

source: No thumbnail set for entry with URL: %s
it_it: Nessuna miniatura impostata per la voce con URL: %s
pl_pl: Nie ustawiono miniatury dla wpisu z adresem URL: %s
zh_cn: 没有为 URL 条目设置缩略图： %s

source: no channel to put now playing message into
it_it: nessun canale in cui inserire il messaggio in riproduzione
pl_pl: brak kanału do umieszczenia wiadomości odtwarzania
zh_cn: 没有频道放入正在播放消息

source: ignored now-playing message as it was already posted.
it_it: ignorato il messaggio in riproduzione ora come era già stato pubblicato.
pl_pl: zignorowano wiadomość, która została już opublikowana.
zh_cn: 忽略正在播放的消息，因为它已经被发布。

source: Running on_player_resume
it_it: Esecuzione on_player_resume
pl_pl: Uruchamianie_gracz_wznawianie
zh_cn: 运行 on_player_result

source: Running on_player_pause
it_it: Esecuzione on_player_pause
pl_pl: Uruchamianie_gracz_pauza
zh_cn: 运行 on_player_pause

source: Running on_player_stop
it_it: Esecuzione on_player_stop
pl_pl: Uruchamianie_gracz_zatrzymanie
zh_cn: 运行_player_stop

source: Running on_player_finished_playing
it_it: Esecuzione on_player_finished_playing
pl_pl: Uruchamianie_gracz_zakończone_grania
zh_cn: 运行_player_finished_play_playing
