Repository: Just-Some-Bots/MusicBot
Catalog: i18n/*/LC_MESSAGES/musicbot_messages.po
Languages: it_it, sv_se

source: The permission `%(option)s` is not available.
it_it: Il permesso `%(option)s` non è disponibile.
sv_se: Behörigheten `%(option)s` är inte tillgänglig.

source: This permission can only be set by editing the permissions file.
it_it: Questa autorizzazione può essere impostata solo modificando il file dei permessi.
sv_se: Denna behörighet kan bara ställas in genom att redigera behörighetsfilen.

source: By default this permission is set to: `%(value)s`
it_it: Per impostazione predefinita questa autorizzazione è impostata a: `%(value)s`
sv_se: Som standard är den här behörigheten satt till: `%(value)s`

source: **Permission:** `%(option)s` %(comment)s %(default)s
it_it: **Permesso:** `%(option)s` %(comment)s %(default)s
sv_se: **Behörighet:** `%(option)s` %(comment)s %(default)s

source: Cannot add group `%(group)s` it already exists.
it_it: Impossibile aggiungere il gruppo `%(group)s` che esiste già.
sv_se: Kan inte lägga till grupp `%(group)s` det finns redan.

source: Successfully added new group: `%(group)s` You can now customize the permissions with: `setperms set %(group)s` Make sure to save the new group with: `setperms save %(group)s`
it_it: Nuovo gruppo aggiunto con successo: `%(group)s` Ora puoi personalizzare i permessi con: `setperms set %(group)s` Assicurati di salvare il nuovo gruppo con: `setperms save %(group)s`
sv_se: Ny grupp lades till: `%(group)s` Du kan nu anpassa behörigheterna med: `setperms set %(group)s` Se till att spara den nya gruppen med: `setperms save %(group)s`

source: Cannot remove built-in group.
it_it: Impossibile rimuovere il gruppo integrato.
sv_se: Kan inte ta bort inbyggd grupp.

source: Successfully removed group: `%(group)s` Make sure to save this change with: `setperms save %(group)s`
it_it: Gruppo rimosso con successo: `%(group)s` Assicurati di salvare questa modifica con: `setperms save %(group)s`
sv_se: Tog bort grupp: `%(group)s` Se till att spara denna ändring med: `setperms save %(group)s`

source: The owner group is not editable.
it_it: Il gruppo proprietario non è modificabile.
sv_se: Ägargruppen är inte redigerbar.

source: Failed to save the group: `%(group)s`
it_it: Impossibile salvare il gruppo: `%(group)s`
sv_se: Det gick inte att spara gruppen: `%(group)s`

source: Successfully saved the group: `%(group)s`
it_it: Salvato con successo il gruppo: `%(group)s`
sv_se: Gruppen sparades framgångsrikt: `%(group)s`

source: **Permission:** `%(permission)s` Current Value: `%(loaded)s` INI File Value: `%(ini)s`
it_it: **Permesso:** `%(permission)s` Valore Attuale: `%(loaded)s` INI Valore Del File: `%(ini)s`
sv_se: **Behörighet:** `%(permission)s` Nuvarande värde: `%(loaded)s` INI filvärde: `%(ini)s`

source: Permission `%(option)s` was not updated!
it_it: Il permesso `%(option)s` non è stato aggiornato!
sv_se: Behörighet `%(option)s` uppdaterades inte!

source: Permission `%(permission)s` was updated for this session. To save the change use `setperms save %(section)s %(option)s`
it_it: Il permesso `%(permission)s` è stato aggiornato per questa sessione. Per salvare il cambiamento usa `setperms save %(section)s %(option)s`
sv_se: Behörighet `%(permission)s` uppdaterades för denna session. För att spara ändringen använd `setperms save %(section)s %(option)s`

source: Change the bot's username on discord. Note: The API may limit name changes to twice per hour.
it_it: Cambia il nome utente del bot su discord. Nota: l'API può limitare le modifiche del nome a due volte all'ora.
sv_se: Ändra botens användarnamn på diskett. Obs: API:et kan begränsa namnändringar till två gånger per timme.

source: Failed to change username. Did you change names too many times? Remember name changes are limited to twice per hour.
it_it: Impossibile modificare il nome utente. Hai cambiato i nomi troppe volte? Ricorda che i cambiamenti di nome sono limitati a due volte all'ora.
sv_se: Det gick inte att ändra användarnamn. Ändrade du namn för många gånger? Kom ihåg att namnändringar är begränsade till två gånger per timme.

source: Failed to change username due to error: %(raw_error)s
it_it: Impossibile modificare il nome utente a causa di errore: %(raw_error)s
sv_se: Misslyckades att ändra användarnamn på grund av fel: %(raw_error)s

source: Set the bot's username to `%(name)s`
it_it: Imposta il nome utente del bot su `%(name)s`
sv_se: Ange botens användarnamn till `%(name)s`

source: Change the MusicBot's nickname.
it_it: Cambia il soprannome di MusicBot.
sv_se: Ändra MusicBots smeknamn.

source: Unable to change nickname: no permission.
it_it: Impossibile cambiare il soprannome: nessun permesso.
sv_se: Det går inte att ändra smeknamn: ingen behörighet.

source: Failed to set nickname due to error: %(raw_error)s
it_it: Impossibile impostare il soprannome a causa di errore: %(raw_error)s
sv_se: Misslyckades att ange smeknamn på grund av fel: %(raw_error)s

source: Set the bot's nickname to `%(nick)s`
it_it: Imposta il nickname del bot su `%(nick)s`
sv_se: Sätt botens smeknamn till `%(nick)s`

source: Set a per-server command prefix.
it_it: Imposta un prefisso di comando per server.
sv_se: Ange ett prefix för kommandot per server.

source: Clear the per-server command prefix.
it_it: Pulisce il prefisso del comando per server.
sv_se: Rensa kommandoprefixet per server.

source: Override the default command prefix in the server. The option EnablePrefixPerGuild must be enabled first.
it_it: Sovrascrivi il prefisso predefinito del comando nel server. L'opzione AbilitaPrefixPerGuild deve essere abilitata prima.
sv_se: Åsidosätt standardkommandoprefixet på servern. Alternativet EnablePrefixPerGuild måste aktiveras först.

source: Custom emoji must be from this server to use as a prefix.
it_it: Le emoji personalizzate devono provenire da questo server per essere utilizzate come prefisso.
sv_se: Anpassad emoji måste vara från den här servern för att använda som prefix.

source: Server command prefix is cleared.
it_it: Il prefisso del comando del server è cancellato.
sv_se: Server-kommandoprefixet är rensat.

source: Server command prefix is now: %(prefix)s
it_it: Il prefisso del comando del server è ora: %(prefix)s
sv_se: Serverkommandoprefix är nu: %(prefix)s

source: Prefix per server is not enabled! Use the config command to update the prefix instead.
it_it: Prefisso per server non è abilitato! Usa il comando di configurazione per aggiornare il prefisso.
sv_se: Prefix per server är inte aktiverad! Använd konfigurationskommandot för att uppdatera prefixet istället.

source: Show language codes available to use.
it_it: Mostra i codici di lingua disponibili da usare.
sv_se: Visa språkkoder tillgängliga att använda.

source: Set the desired language for this server.
it_it: Imposta la lingua desiderata per questo server.
sv_se: Ange önskat språk för den här servern.

source: Reset the server language to bot's default language.
it_it: Reimposta la lingua del server alla lingua predefinita del bot.
sv_se: Återställ serverspråket till botens standardspråk.

source: Manage the language used for messages in the calling server.
it_it: Gestisce la lingua utilizzata per i messaggi nel server di chiamata.
sv_se: Hantera språket som används för meddelanden i samtalsservern.

source: This command can only be used in guilds.
it_it: Questo comando può essere usato solo nelle gilde.
sv_se: Detta kommando kan endast användas i guilds.

source: Invalid sub-command given. Use the help command for more information.
it_it: Sottocomando fornito non valido. Utilizzare il comando help per ulteriori informazioni.
sv_se: Ogiltigt underkommando ges. Använd hjälpkommandot för mer information.

source: **Current Language:** `%(locale)s` **Available Languages:** ``` %(languages)s```
it_it: **Lingua Attuale:** `%(locale)s` **Lingue Disponibili:** ``` %(languages)s```
sv_se: **Nuvarande språk:** `%(locale)s` **Tillgängliga språk:** ``` %(languages)s```

source: Cannot set language to `%(locale)s` it is not available.
it_it: Impossibile impostare la lingua su `%(locale)s` non è disponibile.
sv_se: Kan inte ställa in språk till `%(locale)s` det är inte tillgängligt.

source: Language for this server now set to: `%(locale)s`
it_it: Lingua per questo server impostata a: `%(locale)s`
sv_se: Språk för denna server nu satt till: `%(locale)s`

source: Language for this server has been reset to: `%(locale)s`
it_it: La lingua per questo server è stata reimpostata a: `%(locale)s`
sv_se: Språk för den här servern har återställts till: `%(locale)s`

source: Change MusicBot's avatar. Attaching a file and omitting the url parameter also works.
it_it: Cambia l'avatar di MusicBot. Allegare un file e omettere il parametro url funziona.
sv_se: Ändra MusicBots avatar. Att koppla en fil och utelämna url-parametern fungerar.

source: You must provide a URL or attach a file.
it_it: È necessario fornire un URL o allegare un file.
sv_se: Du måste ange en URL eller bifoga en fil.

source: Unable to change avatar due to error: %(raw_error)s
it_it: Impossibile cambiare l'avatar a causa dell'errore: %(raw_error)s
sv_se: Det gick inte att ändra avatar på grund av fel: %(raw_error)s

source: Changed the bot's avatar.
it_it: Cambiato l'avatar del bot.
sv_se: Ändrade botens avatar.

source: Force MusicBot to disconnect from the discord server.
it_it: Forza MusicBot a disconnettersi dal server discord.
sv_se: Tvinga MusicBot att koppla från discord-servern.

source: Disconnected from server `%(guild)s`
it_it: Disconnesso dal server `%(guild)s`
sv_se: Frånkopplad från servern `%(guild)s`

source: Disconnected a playerless voice client? [BUG]
it_it: Disconnesso un client vocale senza lettore? [BUG]
sv_se: Kopplade från en spellös röstklient? [BUG]

source: Not currently connected to server `%(guild)s`
it_it: Attualmente non connesso al server `%(guild)s`
sv_se: Inte ansluten till servern `%(guild)s`

source: Attempt to reload without process restart. The default option.
it_it: Tentativo di ricaricare senza riavviare il processo. L'opzione predefinita.
sv_se: Försök att ladda om utan processens omstart. Standardalternativet.

source: Attempt to restart the entire MusicBot process, reloading everything.
it_it: Tentativo di riavviare l'intero processo MusicBot, ricaricando tutto.
sv_se: Försök att starta om hela MusicBot processen, ladda om allt.

source: Full restart, but attempt to update pip packages before restart.
it_it: Riavvio completo, ma tenta di aggiornare i pacchetti pip prima del riavvio.
sv_se: Fullständig omstart, men försök att uppdatera pip-paket innan omstart.

source: Full restart, but update MusicBot source code with git first.
it_it: Riavvio completo, ma aggiorna il codice sorgente di MusicBot con git prima.
sv_se: Fullständig omstart, men uppdatera MusicBot källkod med git först.

source: Attempt to update all dependency and source code before fully restarting.
it_it: Tentativo di aggiornare tutte le dipendenze e il codice sorgente prima di riavviare completamente.
sv_se: Försök att uppdatera alla beroenden och källkod innan den startas om.

source: Attempts to restart the MusicBot in a number of different ways. With no option supplied, a `soft` restart is implied. It can be used to remotely update a MusicBot installation, but should be used with care. If you have a service manager, we recommend using it instead of this command for restarts.
it_it: Tentativi di riavviare MusicBot in diversi modi. Con nessuna opzione fornita, è implicito un riavvio `soft`. Può essere usato per aggiornare da remoto un'installazione di MusicBot, ma dovrebbe essere usato con cura. Se hai un service manager, ti consigliamo di usarlo invece di questo comando per il riavvio.
sv_se: Försök att starta om MusicBot på ett antal olika sätt. Med inget alternativ medföljer antyds en `soft`-omstart. Den kan användas för att fjärruppdatera en MusicBot installation, men bör användas med försiktighet. Om du har en servicehanterare, rekommenderar vi att du använder den istället för detta kommando för omstart.

source: Invalid option given, use one of: soft, full, upgrade, uppip, or upgit
it_it: Opzione fornita non valida, usa una di: soft, full, upgrade, uppip, or upgit
sv_se: Ogiltigt angivet alternativ, använd en av: mjuk, full, uppgradering, uppip eller upgit

source: %(emoji)s Restarting current instance...
it_it: %(emoji)s Riavvio dell'istanza corrente...
sv_se: %(emoji)s Startar om aktuell instans...

source: %(emoji)s Restarting bot process...
it_it: %(emoji)s Riavvio del processo robot...
sv_se: %(emoji)s Startar om botprocessen...

source: %(emoji)s Will try to upgrade required pip packages and restart the bot...
it_it: %(emoji)s Cercherà di aggiornare i pacchetti pip richiesti e riavviare il bot...
sv_se: %(emoji)s Försöker uppgradera nödvändiga pip-paket och starta om boten...

source: %(emoji)s Will try to update bot code with git and restart the bot...
it_it: %(emoji)s cercherà di aggiornare il codice bot con git e riavviare il bot...
sv_se: %(emoji)s Kommer att försöka uppdatera botkoden med git och starta om boten...

source: %(emoji)s Will try to upgrade everything and restart the bot...
it_it: %(emoji)s Cercherà di aggiornare tutto e riavviare il bot...
sv_se: %(emoji)s Kommer att försöka uppgradera allt och starta om boten...

source: Disconnect from all voice channels and close the MusicBot process.
it_it: Disconnetti da tutti i canali vocali e chiudi il processo MusicBot.
sv_se: Koppla från alla röstkanaler och avsluta MusicBot-processen.

source: Leave the discord server given by name or server ID.
it_it: Lascia il server discord dato dal nome o dal server ID.
sv_se: Lämna discord-servern med namn eller server-ID.

source: Force MusicBot to leave the given Discord server. Names are case-sensitive, so using an ID number is more reliable.
it_it: Forza MusicBot a lasciare il server Discord specificato. I nomi sono sensibili all'uso di maiuscolo/minuscolo, quindi l'uso di un numero ID è più affidabile.
sv_se: Tvinga MusicBot att lämna den angivna Discord-servern. Namnen är skiftlägeskänsliga, så att använda ett ID-nummer är mer tillförlitligt.

source: You must provide an ID or name.
it_it: Devi fornire un ID o un nome.
sv_se: Du måste ange ett ID eller namn.

source: No guild was found with the ID or name `%(input)s`
it_it: Nessuna gilda trovata con l'ID o il nome `%(input)s`
sv_se: Ingen guild hittades med ID eller namn `%(input)s`

source: Unknown
it_it: Sconosciuto
sv_se: Okänd

source: Left the guild: `%(name)s` (Owner: `%(owner)s`, ID: `%(id)s`)
it_it: Lasciato la gilda: `%(name)s` (Owner: `%(owner)s`, ID: `%(id)s`)
sv_se: Lämnade guilden: `%(name)s` (Owner: `%(owner)s`, ID: `%(id)s`)

source: This command issues a log at level CRITICAL, but does nothing else. Can be used to manually pinpoint events in the MusicBot log file.
it_it: Questo comando emette un log a livello CRITICA, ma non fa altro. Può essere usato per individuare manualmente gli eventi nel file di registro di MusicBot.
sv_se: Detta kommando utfärdar en logg på nivå CRITICAL, men gör inget annat. Kan användas för att manuellt identifiera händelser i MusicBot loggfilen.

source: Logged breakpoint with ID: %(uuid)s
it_it: Breakpoint loggato con ID: %(uuid)s
sv_se: Loggad brytpunkt med ID: %(uuid)s

source: View most common types reported by objgraph.
it_it: Visualizza i tipi più comuni riportati da objgraph.
sv_se: Visa de vanligaste typerna som rapporterats av objgraph.

source: View limited objgraph.show_growth() output.
it_it: Visualizza output objgraph.show_growth() limitato.
sv_se: Visa begränsad objgraph.show_growth() utgång.

source: View most common types of leaking objects.
it_it: Visualizza i tipi più comuni di oggetti fuoriusciti.
sv_se: Visa de vanligaste typerna av läckande objekt.

source: View typestats of leaking objects.
it_it: Visualizza i tipestat degli oggetti fuoriusciti.
sv_se: Visa typvärden för läckande objekt.

source: Evaluate the given function and arguments on objgraph.
it_it: Valuta la funzione e gli argomenti dati su objgraph.
sv_se: Utvärdera den givna funktionen och argumenten på objektgrafen.

source: Interact with objgraph, if it is installed, to gain insight into memory usage. You can pass an arbitrary method with arguments (but no spaces!) that is a member of objgraph. Since this method evaluates arbitrary code, it is considered dangerous like the debug command.
it_it: Interagire con objgraph, se installato, per ottenere informazioni sull'utilizzo della memoria. È possibile passare un metodo arbitrario con argomenti (ma non spazi!) che è un membro di objgraph. Poiché questo metodo valuta il codice arbitrario, è considerato pericoloso come il comando di debug.
sv_se: Interagera med objektgrafen, om den är installerad, för att få insikt i minnesanvändning. Du kan skicka en godtycklig metod med argument (men inga mellanslag!) som är medlem i objektgrafen. Eftersom denna metod utvärderar godtycklig kod anses den vara farlig som debug kommandot.

source: Could not import `objgraph`, is it installed?
it_it: Impossibile importare `objgraph`, è installato?
sv_se: Kunde inte importera `objgraph`, är det installerat?

source: This command will execute arbitrary python code in the command scope. First eval() is attempted, if exceptions are thrown exec() is tried next. If eval is successful, it's return value is displayed. If exec is successful, a value can be set to local variable `result` and that value will be returned. Multi-line code can be executed if wrapped in code-block. Otherwise only a single line may be executed. This command may be removed in a future version, and is used by developers to debug MusicBot behaviour. The danger of this command cannot be understated. Do not use it or give access to it if you do not understand the risks!
it_it: Questo comando eseguirà il codice python arbitrario nel campo di applicazione del comando. Primo eval() è tentato, se le eccezioni vengono lanciate exec() viene provato successivamente. Se eval ha successo, viene visualizzato il valore restituito. Se exec ha successo, un valore può essere impostato sulla variabile locale `result` e quel valore sarà restituito. Il codice multi-riga può essere eseguito se avvolto in un blocco di codice. Altrimenti può essere eseguita solo una singola riga. Questo comando può essere rimosso in una versione futura, ed è utilizzato dagli sviluppatori per debug del comportamento di MusicBot. Il pericolo di questo comando non può essere sottostimato. Non usarlo o dargli accesso se non capisci i rischi!
sv_se: Detta kommando kommer att exekvera godtycklig python-kod i kommandomfånget. Första eval() försöks, om undantag kastas exec() testas nästa. Om eval lyckas, visas dess returvärde. Om exec lyckas, kan ett värde ställas in på lokal variabel `result` och det värdet kommer att returneras. Multi-line-kod kan köras om den är insvept i kodblock. Annars kan endast en enda rad köras. Detta kommando kan tas bort i en framtida version, och används av utvecklare för att felsöka MusicBot beteende. Faran med detta kommando kan inte underskattas. Använd den inte eller ge tillgång till den om du inte förstår riskerna!

source: Failed to execute debug code: %(py_code)s Exception: ``` %(ex_name)s: %(ex_text)s```
it_it: Esecuzione del codice di debug non riuscita: %(py_code)s Eccezione: ``` %(ex_name)s: %(ex_text)s```
sv_se: Misslyckades att köra felsökningskod: %(py_code)s Undantag: ``` %(ex_name)s: %(ex_text)s```

source: Create 'markdown' for options, permissions, or commands from the code. The output is used to update GitHub Pages and is thus unsuitable for normal reference use.
it_it: Crea 'markdown' per opzioni, permessi o comandi dal codice. L'output viene utilizzato per aggiornare le pagine di GitHub ed è quindi inadatto per un uso di riferimento normale.
sv_se: Skapa 'markdown' för alternativ, behörigheter eller kommandon från koden. Utgången används för att uppdatera GitHub sidor och är därmed olämplig för normal referensanvändning.

source: Sub-command must be one of: %(options)s
it_it: Il sottocomando deve essere uno di: %(options)s
sv_se: Underkommando måste vara ett av: %(options)s

source: Makes default INI files.
it_it: Rende i file INI predefiniti.
sv_se: Gör standard INI-filer.

source: Saved the requested INI file to disk. Go check it
it_it: Salvato il file INI richiesto su disco. Vai a controllarlo
sv_se: Sparade den begärda INI-filen till disk. Gå och kontrollera den

source: Display the current bot version and check for updates to MusicBot or dependencies.
it_it: Visualizza la versione attuale del bot e controlla gli aggiornamenti di MusicBot o dipendenze.
sv_se: Visa den nuvarande botversionen och sök efter uppdateringar till MusicBot eller beroenden.

source: Could not locate git executable.
it_it: Impossibile individuare git eseguibile.
sv_se: Kunde inte lokalisera git körbar.

source: No updates in branch `%(branch)s` remote.
it_it: Nessun aggiornamento nel ramo `%(branch)s` remoto.
sv_se: Inga uppdateringar i grenen `%(branch)s` fjärrkontroll.

source: New commits are available in `%(branch)s` branch remote.
it_it: Nuovi commit sono disponibili in `%(branch)s` branch remote.
sv_se: Nya commits finns i `%(branch)s` branch remote.

source: Error while checking, see logs for details.
it_it: Errore durante il controllo, vedere i registri per i dettagli.
sv_se: Fel vid kontroll, se loggar för detaljer.

source: Update for `%(name)s` to version: `%(version)s`
it_it: Aggiorna per `%(name)s` alla versione: `%(version)s`
sv_se: Uppdatering för `%(name)s` till version: `%(version)s`

source: No updates for dependencies found.
it_it: Nessun aggiornamento per le dipendenze trovate.
sv_se: Inga uppdateringar för beroenden hittades.

source: There are updates for MusicBot available for download.
it_it: Ci sono aggiornamenti per MusicBot disponibili per il download.
sv_se: Det finns uppdateringar för MusicBot tillgängliga för nedladdning.

source: MusicBot is totally up-to-date!
it_it: MusicBot è completamente aggiornato!
sv_se: MusicBot är helt uppdaterad!

source: %(status)s **Source Code Updates:** %(git_status)s **Dependency Updates:** %(pip_status)s
it_it: %(status)s **Aggiornamenti Codice Sorgente:** %(git_status)s **Aggiornamenti Dipendenza:** %(pip_status)s
sv_se: %(status)s **Uppdateringar av källkod:** %(git_status)s **Uppdateringar för beroendeförhållanden:** %(pip_status)s

source: Displays the MusicBot uptime, or time since last start / restart.
it_it: Mostra l' uptime di MusicBot o il tempo dall' ultimo avvio / riavvio.
sv_se: Visar MusicBot upptid, eller tid sedan senaste start / omstart.

source: %(name)s has been online for `%(time)s`
it_it: %(name)s è stato online per `%(time)s`
sv_se: %(name)s har varit online för `%(time)s`

source: Display latency information for Discord API and all connected voice clients.
it_it: Visualizza le informazioni sulla latenza per le API Discord e tutti i client vocali connessi.
sv_se: Visa latensinformation för Discord API och alla anslutna röstklienter.

source: No voice clients connected.
it_it: Nessun client vocale connesso.
sv_se: Inga röstklienter anslutna.

source: Display API latency and Voice latency if MusicBot is connected.
it_it: Mostra latenza API e latenza vocale se MusicBot è connesso.
sv_se: Visa API-latens och röstfördröjning om MusicBot är ansluten.

source: auto
sv_se: automatiskt

source: Display MusicBot version number in the chat.
it_it: Mostra il numero di versione di MusicBot nella chat.
sv_se: Visa MusicBot versionsnummer i chatten.

source: https://github.com/Just-Some-Bots/MusicBot Current version: `%(version)s`
it_it: https://github.com/Just-Some-Bots/MusicBot Versione attuale: `%(version)s`
sv_se: https://github.com/Just-Some-Bots/MusicBot Aktuell version: `%(version)s`
