Repository: Just-Some-Bots/MusicBot
Catalog: i18n/*/LC_MESSAGES/musicbot_messages.po
Languages: it_it, sv_se

source: Update the cookies.txt file using a cookies.txt attachment.
it_it: Aggiornare il file cookies.txt utilizzando un allegato cookies.txt.
sv_se: Uppdatera cookies.txt-filen med hjälp av en cookies.txt-bilaga.

source: Enable or disable cookies.txt file without deleting it.
it_it: Abilita o disabilita il file cookies.txt senza eliminarlo.
sv_se: Aktivera eller inaktivera cookies.txt-fil utan att ta bort den.

source: Allows management of the cookies feature in yt-dlp. When updating cookies, you must upload a file named cookies.txt If cookies are disabled, uploading will enable the feature. Uploads will delete existing cookies, including disabled cookies file. WARNING: Copying cookies can risk exposing your personal information or accounts, and may result in account bans or theft if you are not careful. It is not recommended due to these risks, and you should not use this feature if you do not understand how to avoid the risks.
it_it: Consente la gestione della funzione cookie in yt-dlp. Quando si aggiornano i cookie, è necessario caricare un file con nome cookie. xt Se i cookie sono disabilitati, il caricamento attiverà la funzione. Uploads eliminerà i cookie esistenti, incluso il file dei cookie disabilitati. ATTENZIONE: La copia dei cookie può rischiare di esporre i tuoi dati personali o account, e può causare divieti di conto o furto se non stai attento. Non è raccomandato a causa di questi rischi, e non si dovrebbe utilizzare questa funzione se non si capisce come evitare i rischi.
sv_se: Tillåter hantering av funktionen cookies i yt-dlp. När du uppdaterar cookies måste du ladda upp en fil som heter cookies. xt Om cookies inaktiveras kommer uppladdning att aktivera funktionen. Uppladdningar kommer att radera befintliga cookies, inklusive inaktiverade cookie-filer. VARNING: Kopiering av cookies kan riskera att exponera dina personuppgifter eller konton, och kan resultera i bannlysningar eller stöld om du inte är försiktig. Det rekommenderas inte på grund av dessa risker, och du bör inte använda denna funktion om du inte förstår hur man undviker riskerna.

source: Cookies already enabled.
it_it: Cookie già abilitati.
sv_se: Cookies har redan aktiverats.

source: Cookies must be uploaded to be enabled. (Missing cookies file.)
it_it: I cookie devono essere caricati per essere abilitati. (File dei cookie).
sv_se: Cookies måste laddas upp för att kunna aktiveras. (Missing cookies file.)

source: Could not enable cookies due to error: %(raw_error)s
it_it: Impossibile abilitare i cookie a causa di errore: %(raw_error)s
sv_se: Kunde inte aktivera cookies på grund av fel: %(raw_error)s

source: Cookies have been enabled.
it_it: I cookie sono stati abilitati.
sv_se: Cookies har aktiverats.

source: Could not rename cookies file due to error: %(raw_error)s Cookies temporarily disabled and will be re-enabled on next restart.
it_it: Impossibile rinominare il file cookie a causa di errore: %(raw_error)s I cookie sono temporaneamente disabilitati e saranno riattivati al prossimo riavvio.
sv_se: Kunde inte byta namn på cookiefilen på grund av fel: %(raw_error)s Cookies tillfälligt inaktiverade och kommer att aktiveras igen vid nästa omstart.

source: Cookies have been disabled.
it_it: I cookie sono stati disabilitati.
sv_se: Cookies har inaktiverats.

source: No attached uploads were found, try again while uploading a cookie file.
it_it: Non sono stati trovati caricamenti allegati, riprova durante il caricamento di un file di cookie.
sv_se: Inga bifogade uppladdningar hittades, försök igen när du laddade upp en cookie-fil.

source: Error downloading the cookies file from discord: %(raw_error)s
it_it: Errore nel scaricare il file dei cookie da discord: %(raw_error)s
sv_se: Fel vid nedladdning av cookie-filen från diskett: %(raw_error)s

source: Could not save cookies to disk: %(raw_error)s
it_it: Impossibile salvare i cookie sul disco: %(raw_error)s
sv_se: Kunde inte spara kakor till disk: %(raw_error)s

source: Cookies uploaded and enabled.
it_it: Cookie caricati e abilitati.
sv_se: Cookies uppladdade och aktiverade.

source: You cannot use this bot in private messages.
it_it: Non puoi usare questo bot in messaggi privati.
sv_se: Du kan inte använda denna bot i privata meddelanden.

source: This command is not allowed for your permissions group: %(group)s
it_it: Questo comando non è consentito per il tuo gruppo di permessi: %(group)s
sv_se: Detta kommando är inte tillåtet för din behörighetsgrupp: %(group)s

source: This command requires you to be in a Voice channel.
it_it: Questo comando richiede di essere in un canale vocale.
sv_se: Detta kommando kräver att du är i en röstkanal.

source: **Command:** %(name)s
it_it: **Comando:** %(name)s
sv_se: **Kommando:** %(name)s

source: Exception Error
it_it: Errore Di Eccezione
sv_se: Fel vid undantag

source: **Example with prefix:** %(prefix)s`%(command)s ...`
it_it: **Esempio con prefisso:** %(prefix)s`%(command)s ...`
sv_se: **Exempel med prefix:** %(prefix)s`%(command)s ...`

source: No description given.
it_it: Nessuna descrizione fornita.
sv_se: Ingen beskrivning angiven.

source: No usage given.
it_it: Nessun utilizzo dato.
sv_se: Ingen användning angiven.

source: **Example usage:** ```%(usage)s``` %(prefix_note)s**Description:** %(desc)s
it_it: **Esempio di utilizzo:** ```%(usage)s``` %(prefix_note)s**Descrizione:** %(desc)s
sv_se: **Exempel användning:** ```%(usage)s``` %(prefix_note)s**Beskrivning:** %(desc)s

source: Leaving voice channel %(channel)s due to inactivity.
it_it: Lasciare il canale vocale %(channel)s a causa di inattività.
sv_se: Lämnar röstkanal %(channel)s på grund av inaktivitet.

source: Left `%(guild)s` due to bot owner not being found in it.
it_it: Left `%(guild)s` a causa del proprietario del bot che non viene trovato in esso.
sv_se: Vänster `%(guild)s` på grund av att bot ägaren inte hittas i den.

source: Set the log verbosity of MusicBot. Normally this should be set to INFO. It can be set to one of the following: CRITICAL, ERROR, WARNING, INFO, DEBUG, VOICEDEBUG, FFMPEG, NOISY, or EVERYTHING
it_it: Imposta la verbosità del log di MusicBot. Normalmente questo dovrebbe essere impostato su INFO. Può essere impostato su una delle seguenti: CRITICA, ERROR, WARNING, INFO, DEBUG, VOICEDEBUG, FFMPEG, NOISY, o TUTTO
sv_se: Set the log verbosity of MusicBot. Normalt bör detta vara inställt på INFO. Det kan ställas in på något av följande: KRITICAL, FEL, VARNING, INFO, DEBUG, VOICEDEBUG, FFMPEG, NOISY eller ALLTING

source: Discord bot authentication token for your Bot. Visit Discord Developer Portal to create a bot App and generate your Token. Never publish your bot token!
it_it: Token di autenticazione del bot Discord per il tuo Bot. Visita Discord Developer Portal per creare un bot App e generare il tuo Token. Non pubblicare mai il tuo bot token!
sv_se: Discord bot autentiseringstoken för din Bot. Besök Discord Developer Portal för att skapa en bot App och generera din Token. Publicera aldrig din bot token!

source: Provide your own Spotify Client ID to enable MusicBot to interact with Spotify API. MusicBot will try to use the web player API (guest mode) if nothing is set here. Using your own API credentials grants higher usage limits than guest mode.
it_it: Fornisci il tuo ID Client Spotify per consentire a MusicBot di interagire con le API di Spotify. MusicBot cercherà di utilizzare l'API web player (modalità ospiti) se non è impostato niente qui. L'utilizzo delle tue credenziali API garantisce limiti di utilizzo più elevati rispetto alla modalità ospite.
sv_se: Ge ditt eget Spotify-klient-ID för att aktivera MusicBot för att interagera med Spotify-API. MusicBot kommer att försöka använda webbspelarens API (gästläge) om inget är satt här. Använda dina egna API-uppgifter ger högre användningsgränser än gästläge.

source: Provide your Spotify Client Secret to enable MusicBot to interact with Spotify API. This is required if you set the Spotify_ClientID option above.
it_it: Fornisci il tuo client Spotify Secret per consentire a MusicBot di interagire con le API di Spotify. Questo è necessario se si imposta l'opzione Spotify_ClientID sopra.
sv_se: Ge din Spotify_ClientID hemlighet för att aktivera MusicBot för att interagera med Spotify-API. Detta krävs om du ställer in Spotify_ClientID-alternativet ovan.

source: Provide a Discord User ID number to set the owner of this bot. The word 'auto' or number 0 will set the owner based on App information. Only one owner ID can be set here. Generally, setting 'auto' is recommended.
it_it: Fornire un numero di ID utente Discord per impostare il proprietario di questo bot. La parola 'auto' o numero 0 imposterà il proprietario in base alle informazioni dell'app. Qui può essere impostato un solo ID proprietario. Generalmente, si consiglia di impostare 'auto'.
sv_se: Ange ett Discord-användar-ID för att ställa in ägaren av denna bot. Ordet 'auto' eller nummer 0 kommer att ställa in ägaren baserat på appinformation. Endast en ägare ID kan ställas in här. Generellt är inställningen 'auto' rekommenderas.

source: A list of Discord User IDs who can use the dev-only commands. Warning: dev-only commands can allow arbitrary remote code execution. Use spaces to separate multiple IDs. Most users should leave this setting blank.
it_it: Un elenco di ID utente Discord che possono usare i comandi dev-only. Attenzione: i comandi dev-only possono consentire l'esecuzione arbitraria di codice remoto. Usa spazi per separare più ID. La maggior parte degli utenti dovrebbe lasciare vuota questa impostazione.
sv_se: En lista över Discord-användar-ID som kan använda dev-enda-kommandon. Varning: dev-only kommandon kan tillåta godtycklig körning av fjärrkod. Använd mellanslag för att separera flera ID:n. De flesta användare bör lämna denna inställning tom.

source: Discord Member IDs for other bots that MusicBot should not ignore. Use spaces to separate multiple IDs. All bots are ignored by default.
it_it: Id Discord Member per altri bot che MusicBot non dovrebbe ignorare. Usa spazi per separare ID multipli. Tutti i bot vengono ignorati per impostazione predefinita.
sv_se: Discord-medlems-ID för andra robotar som MusicBot inte bör ignorera. Använd mellanslag för att separera flera ID:n. Alla robotar ignoreras som standard.

source: Command prefix is how all MusicBot commands must be started in Discord messages. E.g., if you set this to * the play command is trigger by *play ...
it_it: Il prefisso dei comandi è come tutti i comandi MusicBot devono essere avviati nei messaggi Discord. Ad esempio, se impostate questo su * il comando di riproduzione è attivato da *play ...
sv_se: Kommandoprefix är hur alla MusicBot kommandon måste startas i Discord-meddelanden. T.ex. om du anger detta till * så utlöses kommandot av *play ...

source: Enable using commands with @[YourBotNameHere] The CommandPrefix is still available, but can be replaced with @ mention.
it_it: Abilita usando i comandi con @[YourBotNameHere] Il CommandPrefix è ancora disponibile, ma può essere sostituito con @ mention.
sv_se: Aktivera med kommandon med @[YourBotNameHere] Kommandoprefixet är fortfarande tillgängligt, men kan ersättas med @ omnämnande.

source: ID numbers for text channels that MusicBot should exclusively use for commands. This can contain IDs for channels in multiple servers. Use spaces to separate multiple IDs. All channels are used if this is not set.
it_it: Numeri ID per canali di testo che MusicBot dovrebbe usare esclusivamente per i comandi. Questo può contenere ID per canali in più server. Usa spazi per separare ID multipli. Tutti i canali sono utilizzati se non è impostato.
sv_se: ID-nummer för textkanaler som MusicBot endast ska använda för kommandon. Detta kan innehålla ID för kanaler i flera servrar. Använd mellanslag för att separera flera ID:n. Alla kanaler används om detta inte är inställt.

source: Allow responses in all channels while no specific channel is set for a server. Only used when BindToChannels is missing an ID for a server.
it_it: Consenti risposte in tutti i canali mentre nessun canale specifico è impostato per un server. Usato solo quando BindToChannels manca un ID per un server.
sv_se: Tillåt svar i alla kanaler medan ingen specifik kanal är inställd på en server. Används endast när BindToChannels saknar ett ID för en server.

source: A list of Voice Channel IDs that MusicBot should automatically join on start up. Use spaces to separate multiple IDs.
it_it: Un elenco di ID canale vocale che MusicBot dovrebbe automaticamente unirsi all'avvio. Usa spazi per separare più ID.
sv_se: En lista över röstkanal-ID som MusicBot automatiskt bör ansluta till vid uppstart. Använd mellanslag för att separera flera ID:n.

source: MusicBot will try to send Now Playing notices directly to the member who requested the song instead of posting in a server channel.
it_it: MusicBot cercherà di inviare avvisi di riproduzione ora direttamente al membro che ha richiesto la canzone invece di pubblicare in un canale server.
sv_se: MusicBot kommer att försöka skicka Nu Spelar meddelanden direkt till medlemmen som begärde låten istället för att posta i en serverkanal.

source: Disable now playing messages for songs played via auto playlist.
it_it: Disabilita ora la riproduzione dei messaggi per i brani riprodotti tramite playlist automatica.
sv_se: Inaktivera nu spela meddelanden för låtar som spelas via automatisk spellista.

source: Forces MusicBot to use a specific channel to send now playing messages. Only one text channel ID can be used per server.
it_it: Forza MusicBot ad usare un canale specifico per inviare messaggi in riproduzione. È possibile utilizzare un solo ID di canale di testo per server.
sv_se: Tvingar MusicBot att använda en specifik kanal för att skicka nu spelande meddelanden. Endast en textkanal ID kan användas per server.

source: MusicBot will automatically delete Now Playing messages.
it_it: MusicBot eliminerà automaticamente i messaggi in riproduzione.
sv_se: MusicBot kommer automatiskt ta bort meddelanden som spelas upp.

source: Sets the default volume level MusicBot will play songs at. You can use any value from 0 to 1, or 0% to 100% volume.
it_it: Imposta il livello di volume predefinito MusicBot riprodurrà brani a. Puoi usare qualsiasi valore da 0 a 1, o da 0% a 100% volume.
sv_se: Anger standard volym MusicBot kommer att spela låtar på. Du kan använda valfritt värde från 0 till 1 eller 0% till 100% volym.

source: Sets the default speed MusicBot will play songs at. Must be a value from 0.5 to 100.0 for ffmpeg to use it. A value of 1 is normal playback speed. Note: Streamed media does not support speed adjustments.
it_it: Imposta la velocità predefinita MusicBot riprodurrà brani a. Deve essere un valore da 0.5 a 100.0 per ffmpeg per usarlo. Un valore di 1 è la normale velocità di riproduzione. Nota: il supporto in streaming non supporta le regolazioni della velocità.
sv_se: Anger standard hastighet MusicBot kommer att spela låtar på. Måste vara ett värde från 0,5 till 100,0 för ffmpeg för att använda den. Ett värde på 1 är normal uppspelningshastighet. Obs: Strömmat media stöder inte hastighetsjusteringar.

source: Number of channel member votes required to skip a song. Acts as a minimum when SkipRatio would require more votes.
it_it: Numero di voti dei membri del canale necessari per saltare una canzone. agisce come minimo quando SkipRatio richiederebbe più voti.
sv_se: Antal kanalmedlemmar röster som krävs för att hoppa över en låt. Agerar som ett minimum när SkipRatio skulle kräva fler röster.

source: This percent of listeners in voice must vote for skip. If SkipsRequired is lower than the computed value, it will be used instead. You can set this from 0 to 1, or 0% to 100%.
it_it: Questa percentuale di ascoltatori nella voce deve votare per saltare. Se SkipsRequired è inferiore al valore calcolato, verrà usato invece. È possibile impostare questo da 0 a 1, o 0% a 100%.
sv_se: Denna procent av lyssnarna i röst måste rösta på hoppa över. Om SkipsKrävs är lägre än det beräknade värdet, kommer det att användas istället. Du kan ställa in detta från 0 till 1, eller 0% till 100%.

source: Allow MusicBot to keep downloaded media, or delete it right away.
it_it: Permetti a MusicBot di mantenere i media scaricati o eliminarli subito.
sv_se: Tillåt MusicBot att hålla nedladdade medier, eller ta bort det direkt.

source: If SaveVideos is enabled, set a limit on how much storage space should be used.
it_it: Se SaveVideos è abilitato, imposta un limite a quanto spazio di archiviazione dovrebbe essere utilizzato.
sv_se: Om SaveVideos är aktiverat, ange en gräns för hur mycket lagringsutrymme som ska användas.

source: If SaveVideos is enabled, set a limit on how long files should be kept.
it_it: Se SaveVideos è abilitato, impostare un limite per quanto tempo i file dovrebbero essere mantenuti.
sv_se: Om SaveVideos är aktiverat, ange en gräns för hur länge filer ska behållas.

source: If SaveVideos is enabled, never purge auto playlist songs from the cache regardless of limits.
it_it: Se SaveVideos è abilitato, non elimina mai brani di playlist automatica dalla cache indipendentemente dai limiti.
sv_se: Om SaveVideos är aktiverad, rensa aldrig automatiskt låtarna från cachen oavsett begränsningar.

source: Mention the user who added the song when it is played.
it_it: Menziona l'utente che ha aggiunto il brano quando viene riprodotto.
sv_se: Nämn användaren som lagt till låten när den spelas.

source: Automatically join the owner if they are in an accessible voice channel when bot starts.
it_it: Unisciti automaticamente al proprietario se sono in un canale vocale accessibile all'avvio del bot.
sv_se: Automatiskt gå med i ägaren om de är i en tillgänglig röstkanal när bot startar.

source: Enable MusicBot to automatically play music from the auto playlist when the queue is empty.
it_it: Abilita MusicBot per riprodurre automaticamente musica dalla playlist automatica quando la coda è vuota.
sv_se: Aktivera MusicBot för att automatiskt spela upp musik från auto spellistan när kön är tom.

source: Shuffles the auto playlist tracks before playing them.
it_it: Mischia le tracce della scaletta automatica prima di riprodurle.
sv_se: Blanda automatiskt spellista spår innan du spelar dem.

source: Enable automatic skip of auto playlist songs when a user plays a new song. This only applies to the current playing song if it was added by the auto playlist.
it_it: Abilita il salto automatico dei brani della playlist automatica quando un utente riproduce una nuova canzone. Questo vale solo per il brano in riproduzione corrente se è stato aggiunto dalla scaletta automatica.
sv_se: Aktivera automatisk hoppa över automatiskt spellista låtar när en användare spelar en ny låt. Detta gäller endast för den aktuella låten om den lades till av auto spellista.

source: Remove songs from the auto playlist if they are found in the song block list.
it_it: Rimuovere i brani dalla playlist automatica se sono trovati nell'elenco dei brani.
sv_se: Ta bort låtar från auto spellistan om de finns i listan låtblock.

source: Allow MusicBot to automatically delete messages it sends, after a delay. Delay period is controlled by DeleteDelayShort and DeleteDelayLong.
it_it: Permetti a MusicBot di eliminare automaticamente i messaggi che invia, dopo un ritardo. Il periodo di ritardo è controllato da DeleteDelayShort e DeleteDelayLong.
sv_se: Tillåt MusicBot att automatiskt ta bort meddelanden som skickas, efter en fördröjning. Fördröjningsperioden kontrolleras av DeleteDelayShort och DeleteDelayLong.

source: Auto delete valid commands after a delay.
it_it: Eliminare automaticamente i comandi validi dopo un ritardo.
sv_se: Ta automatiskt bort giltiga kommandon efter försening.

source: Sets the short period of seconds before deleting messages. This period is used by messages that require no further interaction.
it_it: Imposta il breve periodo di secondi prima di eliminare i messaggi. Questo periodo è usato dai messaggi che non richiedono ulteriori interazioni.
sv_se: Anger den korta perioden av sekunder innan meddelanden tas bort. Denna period används av meddelanden som inte kräver någon ytterligare interaktion.

source: Sets the long delay period before deleting messages. This period is used by interactive or long-winded messages, like search and help.
it_it: Imposta il periodo di ritardo lungo prima di eliminare i messaggi. Questo periodo è usato da messaggi interattivi o a lunga scadenza, come ricerca e aiuto.
sv_se: Sätter den långa fördröjningsperioden innan meddelanden tas bort. Denna period används av interaktiva eller långlindade meddelanden, som sökning och hjälp.

source: Allow MusicBot to save the song queue, so queued songs will survive restarts.
it_it: Permetti a MusicBot di salvare la coda dei brani, in modo che i brani in coda sopravvivano ai riavvii.
sv_se: Tillåt MusicBot att spara låtkön, så köade låtar kommer att överleva omstart.

source: Enable MusicBot to download the next song in the queue while a song is playing. Currently this option does not apply to auto playlist or songs added to an empty queue.
it_it: Abilita MusicBot per scaricare il brano successivo nella coda mentre un brano è in riproduzione. Attualmente questa opzione non si applica alla playlist automatica o ai brani aggiunti a una coda vuota.
sv_se: Aktivera MusicBot att ladda ner nästa låt i kön medan en låt spelas. För närvarande gäller inte detta alternativ för automatisk spellista eller låtar som lagts till i en tom kön.

source: Specify a custom message to use as the bot's status. If left empty, the bot will display dynamic info about music currently being played in its status instead. Status messages may also use the following variables: {n_playing} = Number of currently Playing music players. {n_paused} = Number of currently Paused music players. {n_connected} = Number of connected music players, in any player state. The following variables give access to information about the player and track. These variables may not be accurate in multi-guild bots: {p0_length} = The total duration of the track, if available. Ex: [2:34] {p0_title} = The track title for the currently playing track. {p0_url} = The track URL for the currently playing track.
it_it: Specifica un messaggio personalizzato da usare come stato del bot. Se lasciato vuoto, il bot visualizzerà informazioni dinamiche sulla musica attualmente in riproduzione nel suo stato. I messaggi di stato possono anche utilizzare le seguenti variabili: {n_playing} = Numero di lettori musicali attualmente in riproduzione. {n_paused} = Numero di lettori musicali attualmente in pausa. {n_connected} = Numero di lettori musicali collegati, in qualsiasi stato di riproduzione. Le seguenti variabili danno accesso alle informazioni sul giocatore e sulla traccia. Queste variabili potrebbero non essere accurate nei bot multi-gilda: {p0_length} = La durata totale della traccia, se disponibile. Ex: [2:34] {p0_title} = Il titolo della traccia per la traccia in riproduzione. {p0_url} = L'URL della traccia per la traccia in riproduzione.
sv_se: Ange ett anpassat meddelande som ska användas som botens status. Om den lämnas tom, kommer boten att visa dynamisk information om musik som spelas i dess status istället. Statusmeddelanden kan också använda följande variabler: {n_playing} = Antal spelare som spelar musik just nu. {n_paused} = Antal för närvarande Pausade musikspelare. {n_connected} = Antal anslutna musikspelare, i alla spelartillstånd. Följande variabler ger tillgång till information om spelaren och spåret. Dessa variabler kanske inte är korrekta i multi-guild bots: {p0_length} = Spårets totala varaktighet, om tillgängligt. Ex: [2:34] {p0_title} = Spårtiteln för den aktuella låten. {p0_url} = Spår-URL för den nuvarande uppspelningslåten.
