Repository: Just-Some-Bots/MusicBot
Catalog: i18n/*/LC_MESSAGES/musicbot_logs.po
Languages: it_it, pl_pl, zh_cn

source: Error while validating config options. Problem: AudioCachePath config option could not be set due to an error: %(raw_error)s Solution: Double check the setting is a valid, accessible directory path.
it_it: Errore durante la convalida delle opzioni di configurazione. Problema: l'opzione di configurazione AudioCachePath non può essere impostata a causa di un errore: %(raw_error)s Soluzione: Doppio controllo l'impostazione è valida, percorso directory accessibile.
pl_pl: Błąd podczas sprawdzania opcji konfiguracji. Problem: Opcja konfiguracji AudioCachePath nie mogła zostać ustawiona z powodu błędu: %(raw_error)s Rozwiązanie: Sprawdź, czy ustawienia są poprawne, dostępna ścieżka katalogu.

source: Audio Cache will be stored in: %s
it_it: La cache audio sarà memorizzata in: %s
pl_pl: Pamięć podręczna audio będzie przechowywana w: %s
zh_cn: 音频缓存将存储在: %s

source: Error while reading config options. Problem: No bot Token was specified in the config options or environment. Solution: Set the Token config option or set environment variable %(env_var)s with an App token.
it_it: Errore durante la lettura delle opzioni di configurazione. Problema: Nessun bot Token è stato specificato nelle opzioni di configurazione o ambiente. Soluzione: Imposta l'opzione di configurazione Token o imposta la variabile di ambiente %(env_var)s con un token App.
pl_pl: Błąd podczas odczytywania opcji konfiguracji. Problem: Nie określono tokenu bota w opcjach konfiguracji lub środowisku. Rozwiązanie: Ustaw opcję konfiguracji tokenu lub ustaw zmienną środowiskową %(env_var)s z tokenem aplikacji.

source: StatusMessage config option is too long, it will be limited to 128 characters.
it_it: L'opzione di configurazione statusMessage è troppo lunga, sarà limitata a 128 caratteri.
pl_pl: Opcja StatusMessage jest zbyt długa, będzie ograniczona do 128 znaków.
zh_cn: 状态消息配置选项太长，它将被限制为128个字符。

source: The default playback speed must be between 0.5 and 100.0. The option value of %.3f will be limited instead.
it_it: La velocità di riproduzione predefinita deve essere compresa tra 0.5 e 100.0. Il valore di opzione di %.3f sarà limitato.
pl_pl: Domyślna prędkość odtwarzania musi wynosić od 0,5 do 100.0. Wartość opcji %.3f będzie ograniczona.
zh_cn: 默认播放速度必须在 0.5 和 100.0之间。 %.3f 的选项值将被限制。

source: Cookies TXT file detected. MusicBot will pass them to yt-dlp. Cookies are not recommended, may not be supported, and may totally break. Copying cookies from your web-browser risks exposing personal data and in the best case can result in your accounts being banned! You have been warned! Good Luck! \U0001F596
it_it: Rilevato file TXT cookie. MusicBot li passerà a yt-dlp. I cookie non sono raccomandati, potrebbero non essere supportati e potrebbero rompersi completamente. La copia dei cookie dal tuo browser web rischia di esporre i dati personali e nel migliore dei casi può comportare il divieto dei tuoi account! Sei stato avvisato! Buona Fortuna! \U0001F596
pl_pl: Wykryto plik TXT ciasteczka. MusicBot przekaże je do yt-dlp. Pliki cookie nie są zalecane, mogą nie być obsługiwane i mogą całkowicie uszkodzone. Kopiowanie ciasteczek z przeglądarki internetowej stwarza ryzyko narażenia danych osobowych, a w najlepszym przypadku może doprowadzić do zablokowania Twoich kont. Zostałeś ostrzeżony! Powodzenia! \U0001F596
zh_cn: 检测到 Cookies TXT 文件。MusicBot 会将它们传递到 yt-dlp. Cookies 不被推荐，可能不被支持，可能完全断开。 从您的网页浏览器复制cookie有暴露个人数据的风险， 在最好的情况下可能导致您的账户被禁止！ 您已被警告！祝您好运！ \U0001F596

source: Validating options with service data...
it_it: Validazione delle opzioni con i dati del servizio...
pl_pl: Sprawdzanie opcji z danymi usługi...
zh_cn: 正在通过服务数据验证选项...

source: Acquired owner ID via API
it_it: ID proprietario acquisito tramite API
pl_pl: Nabyty identyfikator właściciela przez API
zh_cn: 通过 API 获得所有者ID

source: Error while fetching 'OwnerID' automatically. Problem: Discord App info is not available. This could be a temporary API outage or a bug. Solution: Manually set the 'OwnerID' config option or try again later.
it_it: Errore durante il recupero automatico di 'OwnerID'. Problema: Le informazioni Discord App non sono disponibili. Potrebbe trattarsi di un'interruzione temporanea delle API o di un bug. Soluzione : Imposta manualmente l'opzione di configurazione 'OwnerID' o riprova più tardi.
pl_pl: Błąd podczas pobierania "ID właściciela". Problem: Informacje o aplikacji Discord nie są dostępne. To może być tymczasowy brak API lub błąd. Rozwiązanie: ręcznie ustaw opcję 'WłaścicielID' lub spróbuj ponownie później.

source: MusicBot does not have a user instance, cannot proceed.
it_it: MusicBot non ha un'istanza utente, non può procedere.
pl_pl: MusicBot nie ma instancji użytkownika, nie można kontynuować.
zh_cn: MusicBot 没有用户实例，不能继续。

source: Error validating config options. Problem: The 'OwnerID' config is the same as your Bot / App ID. Solution: Do not use the Bot or App ID in the 'OwnerID' field.
it_it: Errore nella convalida delle opzioni di configurazione. Problema: La configurazione 'OwnerID' è la stessa del tuo Bot / ID app. Soluzione: Non utilizzare il Bot o l'App ID nel campo 'OwnerID'.
pl_pl: Błąd podczas sprawdzania opcji konfiguracji. Problem: Konfiguracja 'WłaścicielID' jest taka sama jak Twój bot / ID aplikacji. Rozwiązanie: Nie używaj Bot ani App ID w polu 'OwnerID'.
zh_cn: 验证配置选项时出错。 问题： “所有者ID”配置与您的 Bot / App ID相同。 解决方案： 不要在“所有者ID”字段中使用机器人或App ID。

source: Config options file not found. Checking for alternatives...
it_it: File delle opzioni di configurazione non trovato. Verifica la presenza di alternative...
pl_pl: Nie znaleziono pliku opcji konfiguracyjnych. Sprawdzanie alternatyw...
zh_cn: 找不到配置选项文件，正在检查替代...

source: Renaming %(ini_file)s to %(option_file)s, you should probably turn file extensions on.
it_it: Rinomina %(ini_file)s in %(option_file)s, probabilmente dovresti attivare le estensioni dei file.
pl_pl: Zmiana nazwy %(ini_file)s na %(option_file)s, prawdopodobnie powinieneś włączyć rozszerzenia plików.

source: Copying existing example options file: %(example_file)s
it_it: Copia del file delle opzioni di esempio esistenti: %(example_file)s
pl_pl: Kopiowanie istniejącego przykładowego pliku opcji: %(example_file)s

source: Something went wrong while trying to find a config option file.
it_it: Qualcosa è andato storto durante il tentativo di trovare un file di opzione di configurazione.
pl_pl: Coś poszło nie tak podczas próby znalezienia pliku opcji konfiguracji.
zh_cn: 试图找到配置选项文件时出了错。

source: Error locating config. Problem: Could not find or create a config file due to an error: %(raw_error)s Solution: Verify the config folder and files exist and can be read by MusicBot.
it_it: Errore nella localizzazione della configurazione. Problema: Impossibile trovare o creare un file di configurazione a causa di un errore: %(raw_error)s Soluzione: Verifica che la cartella di configurazione e i file esistano e possono essere letti da MusicBot.
pl_pl: Błąd lokalizacji konfiguracji. Problem: Nie można znaleźć ani utworzyć pliku konfiguracyjnego z powodu błędu: %(raw_error)s Rozwiązanie: Zweryfikuj folder konfiguracyjny i pliki istnieją i mogą być odczytane przez MusicBot.
zh_cn: 定位配置时出错。 问题： 由于错误无法找到或创建配置文件： %(raw_error)s 解决方案： 验证配置文件夹和文件存在并且可以通过 MusicBot 读取。

source: Error loading config. Problem: MusicBot could not read config file due to an error: %(raw_error)s Solution: Make sure the file is accessible and error free. Copy the example file from the repo if all else fails.
it_it: Errore nel caricamento della configurazione. Problema: MusicBot non ha potuto leggere il file di configurazione a causa di un errore: %(raw_error)s Soluzione: Assicurarsi che il file sia accessibile e privo di errori. Copiare il file di esempio dal repo se tutto il resto fallisce.
pl_pl: Błąd ładowania konfiguracji. Problem: MusicBot nie mógł odczytać pliku konfiguracyjnego z powodu błędu: %(raw_error)s Rozwiązanie: Upewnij się, że plik jest dostępny i nie ma błędu. Skopiuj przykładowy plik z repozytorium, jeśli wszystko inne nie powiedzie się.

source: Dev Bug! Config option has getter that is not available.
it_it: Dev Bug! L'opzione di configurazione ha getter che non è disponibile.
pl_pl: Dev Bug! Opcja konfiguracji ma getter, który jest niedostępny.
zh_cn: 开发错误！配置选项有不可用的getter。

source: Dev Bug! Config option has invalid type, getter and default must be the same type.
it_it: Dev Bug! L'opzione di configurazione ha tipo non valido, getter e predefinito deve essere lo stesso tipo.
pl_pl: Błąd dev Bug! Opcja konfiguracji ma nieprawidłowy typ, getter i domyślny musi być tym samym typem.
zh_cn: 开发错误！配置选项的类型无效，获取类型和默认类型必须相同。

source: Option was missing previously.
it_it: L'opzione mancava in precedenza.
pl_pl: Wcześniej brakowało wariantu.
zh_cn: 此前缺少备选办法。

source: Config section not in parsed config! Missing: %s
it_it: Sezione di configurazione non in configurazione analizzata! Mancante: %s
pl_pl: Sekcja konfiguracji nie jest w pliku konfiguracyjnym! Brakuje: %s
zh_cn: 配置部分不在解析后的配置中！缺少： %s

source: Saved config option: %(config)s = %(value)s
it_it: Opzione di configurazione salvata: %(config)s = %(value)s
pl_pl: Zapisana opcja konfiguracji: %(config)s = %(value)s

source: Failed to save config: %s
it_it: Salvataggio della configurazione non riuscito: %s
pl_pl: Nie udało się zapisać konfiguracji: %s
zh_cn: 保存配置失败： %s

source: Option names are not unique between INI sections! Resolver is disabled.
it_it: I nomi delle opzioni non sono univoci tra le sezioni INI! Resolver è disabilitato.
pl_pl: Nazwy opcji nie są unikalne pomiędzy sekcjami INI! Rozpoznawanie jest wyłączone.
zh_cn: 选项名称在INI部分之间并不唯一！解析器已被禁用。

source: Failed to save default INI file at: %s
it_it: Impossibile salvare il file INI predefinito in: %s
pl_pl: Nie udało się zapisać domyślnego pliku INI na: %s
zh_cn: 保存默认 INI 文件失败: %s

source: Error loading config value. Problem: The owner ID in [%(section)s] > %(option)s is not valid. Solution: Set %(option)s to a numerical ID or set it to `auto` or `0` for automatic owner binding.
it_it: Errore nel caricamento del valore di configurazione. Problema: L'ID proprietario in [%(section)s] > %(option)s non è valido. Soluzione: Imposta %(option)s su un ID numerico o impostalo su `auto` o `0` per il binding automatico del proprietario.
pl_pl: Błąd ładowania wartości konfiguracji. Problem: Identyfikator właściciela w [%(section)s] > %(option)s jest nieprawidłowy. Rozwiązanie: Ustaw %(option)s na numeryczny identyfikator lub ustaw go na `auto` lub `0` dla automatycznego powiązania właściciela.

source: Error loading config value. Problem: The config option [%(section)s] > %(option)s is not a valid file location. Solution: Check the path setting and make sure the file exists and is accessible to MusicBot.
it_it: Errore nel caricamento del valore di configurazione. Problema: L'opzione di configurazione [%(section)s] > %(option)s non è una posizione valida del file. Soluzione: Controlla l'impostazione del percorso e assicurati che il file esista ed sia accessibile a MusicBot.
pl_pl: Błąd ładowania wartości konfiguracji. Problem: Opcja konfiguracji [%(section)s] > %(option)s nie jest prawidłową lokalizacją pliku. Rozwiązanie: Sprawdź ustawienia ścieżki i upewnij się, że plik istnieje i jest dostępny dla MusicBot.

source: Error loading config value. Problem: One of the IDs in option [%(section)s] > %(option)s is invalid. Solution: Ensure all IDs are numerical, and separated only by spaces or commas.
it_it: Errore nel caricamento del valore di configurazione. Problema: Uno degli ID nell'opzione [%(section)s] > %(option)s non è valido. Soluzione: Assicurati che tutti gli ID siano numerici e separati solo da spazi o virgole.
pl_pl: Błąd ładowania wartości konfiguracji. Problem: Jeden z ID w opcji [%(section)s] > %(option)s jest nieprawidłowy. Rozwiązanie: Upewnij się, że wszystkie ID są liczbowe i oddzielone tylko spacjami lub przecinkami.

source: Invalid DebugLevel option "%(value)s" given, falling back to level: %(fallback)s
it_it: Opzione DebugLevel "%(value)s" non valida, tornando al livello: %(fallback)s
pl_pl: Podano nieprawidłową opcję DebugLevel "%(value)s", spadając z powrotem do poziomu: %(fallback)s

source: Option [%(section)s] > %(option)s has invalid config value '%(value)s' using default instead.
it_it: Opzione [%(section)s] > %(option)s ha valore di configurazione non valido '%(value)s' usando invece predefinito.
pl_pl: Opcja [%(section)s] > %(option)s ma nieprawidłową wartość konfiguracji '%(value)s' zamiast domyślnej.

source: Option [%(section)s] > %(option)s has a value greater than 100 %% (%(value)s) and will be set to %(fallback)s instead.
it_it: Opzione [%(section)s] > %(option)s ha un valore maggiore di 100 %% (%(value)s) e sarà invece impostato su %(fallback)s.
pl_pl: Opcja [%(section)s] > %(option)s ma wartość większą niż 100 %% (%(value)s) i zamiast tego zostanie ustawiona na %(fallback)s.

source: Renaming INI file entry [%(old_s)s] > %(old_o)s to [%(new_s)s] > %(new_o)s
it_it: Rinomina la voce del file INI [%(old_s)s] > %(old_o)s in [%(new_s)s] > %(new_o)s
pl_pl: Zmiana nazwy pliku INI [%(old_s)s] > %(old_o)s na [%(new_s)s] > %(new_o)s

source: Upgrading config file with renamed options...
it_it: Aggiornamento file di configurazione con opzioni rinominate...
pl_pl: Aktualizowanie pliku konfiguracyjnego ze zmienionymi nazwami opcji...
zh_cn: 使用重命名选项升级配置文件...

source: Failed to upgrade config. You'll need to upgrade it manually.
it_it: Impossibile aggiornare la configurazione. Dovrai aggiornarla manualmente.
pl_pl: Nie udało się zaktualizować konfiguracji. Musisz uaktualnić ją ręcznie.
zh_cn: 升级配置失败。您需要手动升级。

source: Block list file not found: %s
it_it: File elenco blocco non trovato: %s
pl_pl: Nie znaleziono pliku listy bloków: %s
zh_cn: 未找到方块列表文件： %s

source: Could not load block list from file: %s
it_it: Impossibile caricare l'elenco dei blocchi dal file: %s
pl_pl: Nie można załadować listy bloków z pliku: %s
zh_cn: 无法从文件加载块列表： %s

source: Could not update the block list file: %s
it_it: Impossibile aggiornare il file elenco blocchi: %s
pl_pl: Nie można zaktualizować pliku listy bloków: %s
zh_cn: 无法更新块列表文件： %s

source: Loaded User Block list with %s entries.
it_it: Lista Blocco utente caricata con voci %s.
pl_pl: Załadowano listę bloków użytkowników z wpisami %s.
zh_cn: 使用 %s 条目加载用户块列表。

source: We found a legacy blacklist file, it will be renamed to: %s
it_it: Abbiamo trovato un file di blacklist legacy, che verrà rinominato in: %s
pl_pl: Znaleźliśmy starszy plik czarnej listy, zostanie on zmieniony na: %s
zh_cn: 我们找到了一个旧的黑名单文件，它将被重命名为: %s

source: Loaded a Song Block list with %s entries.
it_it: Caricato un elenco di blocchi brani con voci %s.
pl_pl: Załadowano listę bloków piosenek z wpisami %s.
zh_cn: 使用 %s 条目加载歌曲方块列表。

source: Cannot load data for guild with ID 0. This is likely a bug in the code!
it_it: Impossibile caricare i dati per la gilda con ID 0. Probabilmente è un bug nel codice!
pl_pl: Nie można załadować danych dla gildii o ID 0. Jest to prawdopodobnie błąd w kodzie!
zh_cn: 无法用ID0加载公会数据。这可能是代码中的错误！

source: No file for guild %(id)s/%(name)s
it_it: Nessun file per la gilda %(id)s/%(name)s
pl_pl: Brak pliku dla gildii %(id)s/%(name)s

source: Loading guild data for guild with ID: %(id)s/%(name)s
it_it: Caricamento dei dati della gilda con ID: %(id)s/%(name)s
pl_pl: Ładowanie danych gildii dla gildii z ID: %(id)s/%(name)s

source: An OS error prevented reading guild data file: %s
it_it: Un errore OS ha impedito di leggere il file dati della gilda: %s
pl_pl: Błąd systemu operacyjnego uniemożliwił odczyt pliku danych gildii: %s
zh_cn: 一个操作系统错误阻止读取公会数据文件： %s

source: Guild %(id)s/%(name)s has custom command prefix: %(prefix)s
it_it: La Gilda %(id)s/%(name)s ha il prefisso del comando personalizzato: %(prefix)s
pl_pl: Gildia %(id)s/%(name)s ma niestandardowy prefiks poleceń: %(prefix)s

source: Cannot save data for guild with ID 0. This is likely a bug in the code!
it_it: Impossibile salvare i dati per la gilda con ID 0. Probabilmente è un bug nel codice!
pl_pl: Nie można zapisać danych dla gildii o ID 0. Jest to prawdopodobnie błąd w kodzie!
zh_cn: 无法保存与 ID 0的公会数据。这可能是代码中的一个错误！

source: Could not save guild specific data due to OS Error.
it_it: Impossibile salvare i dati specifici della gilda a causa di un errore del sistema.
pl_pl: Nie można zapisać danych specyficznych dla gildii z powodu błędu systemu operacyjnego.
zh_cn: 由于操作系统错误，无法保存公会特定数据。

source: Failed to serialize guild specific data due to invalid data.
it_it: Impossibile serializzare i dati specifici della gilda a causa di dati non validi.
pl_pl: Nie udało się zserializować danych specyficznych dla gildii z powodu nieprawidłowych danych.
zh_cn: 由于无效数据，无法序列化公会特定数据。

source: Forcing YTDLP to use User Agent: %s
it_it: Forzare YTDLP per utilizzare l'agente utente: %s
pl_pl: Wymuszanie YTDLP do używania User Agent: %s
zh_cn: 强制YTDLP使用用户代理: %s

source: MusicBot will use cookies for yt-dlp from: %s
it_it: MusicBot utilizzerà i cookie per yt-dlp da: %s
pl_pl: MusicBot będzie używać ciasteczek do yt-dlp z: %s
zh_cn: MusicBot 将使用 cookie 的 yt-dlp: %s

source: Yt-dlp will use your configured proxy server.
it_it: Yt-dlp userà il tuo server proxy configurato.
pl_pl: Yt-dlp użyje skonfigurowanego serwera proxy.
zh_cn: Yt-dlp 将使用您配置的代理服务器。

source: Original OAuth2 plugin is installed and will be used instead. This may cause MusicBot to not close completely, or hang pending authorization! To close MusicBot, you must manually Kill the MusicBot process! Yt-dlp is being set to show warnings and other log messages, to show the Auth code. Uninstall the yt-dlp-youtube-oauth2 package to use integrated OAuth2 features instead.
it_it: Il plugin originale OAuth2 è installato e verrà utilizzato al suo posto. Questo potrebbe far sì che MusicBot non si chiuda completamente, o appenda l'autorizzazione in sospeso! Per chiudere MusicBot, devi uccidere manualmente il processo MusicBot! Yt-dlp è impostato per mostrare avvisi e altri messaggi di registro, per mostrare il codice Auth. Disinstalla il pacchetto yt-dlp-youtube-oauth2 per utilizzare invece le funzionalità integrate di OAuth2.
pl_pl: Oryginalna wtyczka OAuth2 jest zainstalowana i będzie użyta. Może to spowodować, że MusicBot nie zamknie się całkowicie lub zawiesić oczekującą autoryzację! Aby zamknąć MusicBot, musisz ręcznie zabić proces MusicBot! Yt-dlp jest ustawiony aby pokazać ostrzeżenia i inne wiadomości dziennika, aby wyświetlić kod uwierzytelniania. Odinstaluj pakiet yt-dlp-youtube-oauth2, aby zamiast tego używać zintegrowanych funkcji OAuth2.

source: HEAD seems to have no headers...
it_it: HEAD sembra non avere intestazioni...
pl_pl: HEAD wydaje się, że nie ma nagłówków...
zh_cn: HEAD 似乎没有信头...

source: Checking media headers failed due to timeout.
it_it: Controllo intestazioni multimediali non riuscito a causa del timeout.
pl_pl: Sprawdzanie nagłówków mediów nie powiodło się z powodu przekroczenia limitu czasu.
zh_cn: 由于超时检查媒体头部失败。

source: Failed HEAD request for: %s
it_it: Richiesta HEAD non riuscita per: %s
pl_pl: Nieudane żądanie HEAD dla: %s
zh_cn: HEAD 请求失败： %s

source: HEAD Request exception:
it_it: Richiesta di eccezione HEAD:
pl_pl: Wyjątek żądania HEAD:
zh_cn: HEAD 请求异常：

source: Sanitized YTDL Extraction Info (not JSON): %s
it_it: Informazioni Di Estrazione Ytdl Sanitizzate (non Json): %s
pl_pl: Informacje o ekstrakcji YTDL (nie JSON): %s
zh_cn: 卫生化的 YTDL 提取信息(非JSON ): %s

source: Sanitized YTDL Extraction Info (not JSON): %s
it_it: Informazioni Di Estrazione Ytdl Sanitizzate (non Json): %s
pl_pl: Informacje o ekstrakcji YTDL (nie JSON): %s
zh_cn: 已卫生化的 YTDL 提取信息(而不是JSON ): %s

source: Song info extraction returned no data.
it_it: L'estrazione di informazioni brano non ha restituito dati.
pl_pl: Wyciąg informacji o utworze nie zwrócił żadnych danych.
zh_cn: 歌曲信息提取没有返回数据。

source: Called extract_info with: '%(subject)s', %(args)s, %(kws)s
it_it: Chiamato extract_info con: '%(subject)s', %(args)s, %(kws)s
pl_pl: Wywołany extract_info z: '%(subject)s', %(args)s, %(kws)s

source: Cannot run extraction, loop is closed. (This is normal on shutdowns.)
it_it: Impossibile eseguire l'estrazione, il ciclo è chiuso. (Questo è normale in caso di arresti)
pl_pl: Nie można uruchomić ekstrakcji, pętla jest zamknięta. (To jest normalne przy wyłączeniu.)
zh_cn: 无法运行提取，循环已关闭。(关机时这是正常的。)

source: Cannot continue extraction, event loop is closed.
it_it: Impossibile continuare l'estrazione, il ciclo dell'evento è chiuso.
pl_pl: Nie można kontynuować ekstrakcji, pętla zdarzeń jest zamknięta.
zh_cn: 无法继续提取，事件循环已关闭。

source: Spotify URL is invalid or not supported.
it_it: Spotify URL non è valido o non supportato.
pl_pl: Adres URL Spotify jest nieprawidłowy lub nie jest obsługiwany.
zh_cn: Spotify URL 无效或不支持。

source: Error in yt-dlp while downloading data: %(raw_error)s
it_it: Errore in yt-dlp durante il download dei dati: %(raw_error)s
pl_pl: Błąd w yt-dlp podczas pobierania danych: %(raw_error)s

source: Download Error with stream URL
it_it: Errore di download con URL dello stream
pl_pl: Błąd pobierania z URL strumienia
zh_cn: 下载流URL错误

source: Assuming content is a direct stream
it_it: Supponendo che il contenuto sia uno stream diretto
pl_pl: Zakładając, że zawartość jest bezpośrednim strumieniem
zh_cn: 假设内容是直接流

source: Cannot stream an invalid URL.
it_it: Impossibile trasmettere un URL non valido.
pl_pl: Nie można strumieniować nieprawidłowego URL.
zh_cn: 无法生成无效的 URL。

source: Caught NoSupportingHandlers, trying again after replacing colon with space.
it_it: Catturato NoSupportingHandlers, riprovando dopo aver sostituito colon con spazio.
pl_pl: Złap NoSupportingHandlers, spróbuj ponownie po zastąpieniu colona miejscem.
zh_cn: 捕捉到NoSupportingHanders，在用空格替换冒号后再次尝试。

source: Extractor youtube:search returned single-entry result, replacing base info with entry info.
it_it: Estrattore youtube:search ha restituito il risultato di un singolo ingresso, sostituendo le informazioni di base con le informazioni di entrata.
pl_pl: Wyciągnij youtube:search zwrócił wynik pojedynczego wpisu, zastępując informacje bazowe informacjami o wpisie.
zh_cn: Extractor youtube:search 返回了单条目结果，以条目信息取代基础信息。

source: Called safe_extract_info with: %(args)s, %(kws)s
it_it: Chiamato safe_extract_info con: %(args)s, %(kws)s
pl_pl: Wywołano safe_extract_info z: %(args)s, %(kws)s

source: The local media file could not be found.
it_it: Impossibile trovare il file multimediale locale.
pl_pl: Nie znaleziono lokalnego pliku multimedialnego.
zh_cn: 找不到本地媒体文件。

source: Missing __input_subject from YtdlpResponseDict
it_it: Manca __input_subject da YtdlpResponseDict
pl_pl: Brakuje __input_subject z YtdlpResponseDict
zh_cn: YtdlpResponseDict 缺少__input_subject

source: Entries is not a list in YtdlpResponseDict, set process=True to avoid this.
it_it: Le voci non sono una lista in YtdlpResponseDict, set process=True per evitare questo.
pl_pl: Wpisy nie są listą w YtdlpResponseDict, ustaw proces = True, aby tego uniknąć.
zh_cn: 条目不是 YtdlpResponseDict 中的列表, 设置进程=True 以避免这种情况。

source: Warning, duration error for: %(url)s
it_it: Attenzione, errore di durata per: %(url)s
pl_pl: Ostrzeżenie, czas trwania błędu dla: %(url)s

source: module 'pymediainfo' not found, will fall back to ffprobe.
it_it: modulo 'pymediainfo' non trovato, cadrà di nuovo a ffprobe.
pl_pl: moduł 'pymediainfo' nie znaleziony, wróci do ffprobe.
zh_cn: 未找到模块“pymediainfo”，将会退回到ffprobe。

source: Created future for %r
it_it: Creato il futuro per %r
pl_pl: Stworzona przyszłość dla %r
zh_cn: %r 未来创建

source: Completed futures for %(entry)r with %(callback)r
it_it: Futures completati per %(entry)r con %(callback)r
pl_pl: Zakończone kontrakty futures dla %(entry)r z %(callback)r
