Repository: Just-Some-Bots/MusicBot
Catalog: i18n/*/LC_MESSAGES/musicbot_logs.po
Languages: it_it, pl_pl, zh_cn

source: MusicBot could not find the user(s) you specified.
it_it: MusicBot non ha trovato gli utenti specificati.
pl_pl: MusicBot nie mógł znaleźć podanego użytkownika.
zh_cn: MusicBot 无法找到您指定的用户。

source: The owner cannot be added to the block list.
it_it: Il proprietario non può essere aggiunto all'elenco dei blocchi.
pl_pl: Właściciel nie może być dodany do listy bloków.
zh_cn: 所有者不能添加到方块列表。

source: Not adding user to block list, already blocked: %(id)s/%(name)s
it_it: Non aggiungere l'utente alla lista di blocchi, già bloccato: %(id)s/%(name)s
pl_pl: Nie dodano użytkownika do listy, już zablokowano: %(id)s/%(name)s

source: Not removing user from block list, not listed: %(id)s/%(name)s
it_it: Non rimuovere l'utente dalla lista dei blocchi, non elencato: %(id)s/%(name)s
pl_pl: Nie usuwa użytkownika z listy bloków, nie wymieniono: %(id)s/%(name)s

source: Cannot add the users you listed, they are already added.
it_it: Non è possibile aggiungere gli utenti elencati, sono già aggiunti.
pl_pl: Nie można dodać użytkowników, których wymieniłeś, są już dodane.
zh_cn: 无法添加您列出的用户，他们已经被添加。

source: You must provide a song subject if no song is currently playing.
it_it: Devi fornire un oggetto del brano se nessuna canzone è attualmente in riproduzione.
pl_pl: Musisz podać temat utworu, jeśli nie ma aktualnie odtwarzanej piosenki.
zh_cn: 如果没有歌曲正在播放，您必须提供一个歌曲主题。

source: Invalid sub-command given. Use `help blocksong` for usage examples.
it_it: Sottocomando fornito non valido. Usa `help blocksong` per esempi di utilizzo.
pl_pl: Podano nieprawidłowe polecenie. Użyj `help blocksong` dla przykładów użycia.
zh_cn: 给定的子命令无效。使用 "help blocksong" 作为使用示例。

source: Subject `%(subject)s` is already in the song block list.
it_it: L'oggetto `%(subject)s` è già nella lista dei brani.
pl_pl: Temat%(subject)s` jest już na liście bloków utworu.

source: The subject is not in the song block list and cannot be removed.
it_it: L'oggetto non è nell'elenco dei brani e non può essere rimosso.
pl_pl: Temat nie znajduje się na liście bloków piosenek i nie może zostać usunięty.
zh_cn: 主题不在歌曲块列表中，无法删除。

source: Invalid sub-command given. Use `help autoplaylist` for usage examples.
it_it: Sottocomando fornito non valido. Usa `help autoplaylist` per esempi di utilizzo.
pl_pl: Podano nieprawidłowe polecenie. Użyj `help autoplaylist` dla przykładów użycia.
zh_cn: 给定的子命令无效。使用 "help autoplaylist" 作为使用示例。

source: The supplied song link is invalid
it_it: Il link del brano fornito non è valido
pl_pl: Podany link do utworu jest nieprawidłowy
zh_cn: 提供的歌曲链接无效

source: The queue is empty. Add some songs with a play command!
it_it: La coda è vuota. Aggiungi alcuni brani con un comando di riproduzione!
pl_pl: Kolejka jest pusta. Dodaj kilka piosenek poleceniem odtwarzania!
zh_cn: 队列为空。用播放命令添加一些歌曲！

source: This song is already in the autoplaylist.
it_it: Questo brano è già nella playlist automatica.
pl_pl: Ta piosenka jest już na autoplaylist.
zh_cn: 这首歌已经在自动播放列表中。

source: This song is not yet in the autoplaylist.
it_it: Questa canzone non è ancora nella playlist automatica.
pl_pl: Ta piosenka nie znajduje się jeszcze na liście autoplay.
zh_cn: 这首歌尚未在自动播放列表中。

source: You must provide a playlist filename.
it_it: È necessario fornire un nome file playlist.
pl_pl: Musisz podać nazwę pliku listy odtwarzania.
zh_cn: 您必须提供一个播放列表文件名。

source: You are not allowed to request playlists
it_it: Non sei autorizzato a richiedere playlist
pl_pl: Nie masz uprawnień do żądania playlist
zh_cn: 您无权请求播放列表

source: Playlist has too many entries (%(songs)s but max is %(max)s)
it_it: La playlist ha troppe voci (%(songs)s ma il massimo è %(max)s)
pl_pl: Playlista ma zbyt wiele wpisów (%(songs)s ale max to %(max)s)

source: The playlist entries will exceed your queue limit. There are %(songs)s in the list, and %(queued)s already in queue. The limit is %(max)s for your group.
it_it: Le voci della playlist supereranno il limite della tua coda. Ci sono %(songs)s nella lista, e %(queued)s già in coda. Il limite è %(max)s per il tuo gruppo.
pl_pl: Wpisy listy odtwarzania przekroczą limit twojej kolejki. Na liście znajdują się %(songs)s i %(queued)s już w kolejce. Limit wynosi %(max)s dla twojej grupy.

source: Ignoring auto-pause due to network outage.
it_it: Ignorare la pausa automatica a causa dell'interruzione della rete.
pl_pl: Ignorowanie automatycznej pauzy z powodu przerwy w sieci.
zh_cn: 由于网络停电，忽略自动暂停。

source: MusicPlayer has no VoiceClient or has no channel data, cannot process auto-pause.
it_it: MusicPlayer non ha VoiceClient o non ha dati di canale, non è possibile elaborare la pausa automatica.
pl_pl: MusicPlayer nie ma VoiceClient lub nie ma żadnych danych kanałowych, nie można przetwarzać automatycznego wstrzymania.
zh_cn: MusicPlayer 没有 VoiceClient 或没有频道数据，无法处理自动暂停。

source: Already processing auto-pause, ignoring this event.
it_it: Elaborazione della pausa automatica, ignorando questo evento.
pl_pl: Przetwarzanie automatycznej pauzy, ignorując to wydarzenie.
zh_cn: 已经在处理自动暂停，忽略此事件。

source: %sVoiceClient not connected, waiting %s seconds to handle auto-pause in guild: %s
it_it: %sVoiceClient non connesso, in attesa di %s secondi per gestire la pausa automatica nella gilda: %s
pl_pl: %sVoiceClient nie podłączony, oczekiwanie %s sekund na automatyczne wstrzymanie w gildii: %s

source: Auto-pause waiting was cancelled.
it_it: Auto-pausa attesa è stata annullata.
pl_pl: Automatyczne wstrzymanie oczekiwania zostało anulowane.
zh_cn: 自动暂停等待已取消。

source: A new MusicPlayer is being connected, ignoring old auto-pause event.
it_it: Un nuovo MusicPlayer è in fase di connessione, ignorando il vecchio evento di pausa automatica.
pl_pl: Nowy odtwarzacz muzyki jest podłączony, ignorując stare zdarzenie auto-pauzy.
zh_cn: 一个新的 MusicPlayer 正在连接，忽略旧的自动暂停事件。

source: Playing in an empty voice channel, running auto pause for guild: %s
it_it: Riproduzione in un canale vocale vuoto, in pausa automatica per gilda: %s
pl_pl: Odtwarzanie na pustym kanale głosowym, uruchamianie automatycznego pauzy dla gildii: %s

source: Previously auto paused player is unpausing for guild: %s
it_it: Il giocatore precedentemente in pausa automatica è in pausa per la gilda: %s
pl_pl: Wcześniej auto-wstrzymany gracz jest niezapłacony dla gildii: %s

source: Cannot use seek if there is nothing playing.
it_it: Impossibile usare la ricerca se non c'è niente di giocare.
pl_pl: Nie można użyć szukania, jeśli nic nie gra.
zh_cn: 如果没有播放，无法使用寻找。

source: Cannot use seek on current track, it has an unknown duration.
it_it: Impossibile usare la ricerca sulla traccia corrente, ha una durata sconosciuta.
pl_pl: Nie można użyć szukania bieżącego utworu, ma nieznany czas trwania.
zh_cn: 无法在当前轨道上使用寻找，它有未知的持续时间。

source: Seeking is not supported for streams.
it_it: La ricerca non è supportata per gli streaming.
pl_pl: Szukanie nie jest obsługiwane dla strumieni.
zh_cn: 不支持搜索。

source: Cannot use seek without a time to position playback.
it_it: Impossibile usare la ricerca senza un tempo per posizionare la riproduzione.
pl_pl: Nie można użyć wyszukiwania bez czasu na umiejscowienie odtwarzania.
zh_cn: 没有时间定位播放，无法使用搜索引擎。

source: Could not convert `%(input)s` to a valid time in seconds.
it_it: Impossibile convertire `%(input)s` in un tempo valido in secondi.
pl_pl: Nie można przekonwertować `%(input)s` na poprawny czas w sekundach.

source: Cannot seek to `%(input)s` (`%(seconds)s` seconds) in the current track with a length of `%(progress)s / %(total)s`
it_it: Impossibile cercare `%(input)s` (`%(seconds)s` secondi) nella traccia corrente con una lunghezza di `%(progress)s / %(total)s`
pl_pl: Nie można szukać `%(input)s` (`%(seconds)s` sekund) w bieżącym utworze o długości `%(progress)s / %(total)s`

source: Invalid sub-command. Use the command `help repeat` for usage examples.
it_it: Sottocomando non valido. Usa il comando `help repeat` per gli esempi di utilizzo.
pl_pl: Nieprawidłowe polecenie podrzędne. Użyj polecenia `help repeat` dla przykładów użycia.
zh_cn: 无效的子命令。使用命令“help repat”作为使用示例。

source: The player is not currently looping.
it_it: Il giocatore non si sta caricando.
pl_pl: Odtwarzacz nie jest obecnie w pętli.
zh_cn: 玩家目前没有循环中。

source: Song positions must be integers!
it_it: Le posizioni brano devono essere intere!
pl_pl: Pozycje piosenek muszą być liczbą całkowitą!
zh_cn: 歌曲位置必须是整数！

source: You gave a position outside the playlist size!
it_it: Hai dato una posizione fuori dalla dimensione della playlist!
pl_pl: Dałeś pozycję poza rozmiarem playlisty!
zh_cn: 您提供了一个超出播放列表大小的位置！

source: Could not prompt for playlist playback, no message to add reactions to.
it_it: Impossibile richiedere la riproduzione della playlist, nessun messaggio a cui aggiungere reazioni.
pl_pl: Nie można poprosić o odtwarzanie playlisty, nie ma wiadomości do dodania reakcji.
zh_cn: 无法提示播放列表播放，没有消息添加反应。

source: Local media playback is not enabled.
it_it: La riproduzione multimediale locale non è abilitata.
pl_pl: Lokalne odtwarzanie mediów nie jest włączone.
zh_cn: 本地媒体播放未启用。

source: Spotify URL is invalid or not currently supported.
it_it: L'URL di Spotify non è valido o non è attualmente supportato.
pl_pl: Adres URL Spotify jest nieprawidłowy lub nie jest obecnie obsługiwany.
zh_cn: Spotify URL 无效或目前不支持。

source: Detected a Spotify URL, but Spotify is not enabled.
it_it: Rilevato un URL Spotify, ma Spotify non è abilitato.
pl_pl: Wykryto adres URL Spotify, ale Spotify nie jest włączony.
zh_cn: 检测到 Spotify 网址，但Spotify 未启用。

source: You have reached your enqueued song limit (%(max)s)
it_it: Hai raggiunto il limite di canzone in coda (%(max)s)
pl_pl: Osiągnąłeś limit utworów w kolejce (%(max)s)

source: Karaoke mode is enabled, please try again when its disabled!
it_it: La modalità Karaoke è abilitata, riprova quando è disabilitata!
pl_pl: Tryb Karaoke jest włączony, spróbuj ponownie, gdy jest wyłączony!
zh_cn: Karaoke模式已启用，请禁用后再试一次！

source: Issue with extract_info():
it_it: Problema con extract_info():
pl_pl: Problem z extract_info():
zh_cn: 与extract_info() 有关的问题：

source: Failed to extract info due to error: %(raw_error)s
it_it: Impossibile estrarre le informazioni a causa di errore: %(raw_error)s
pl_pl: Nie udało się wyodrębnić informacji z powodu błędu: %(raw_error)s

source: That video cannot be played. Try using the stream command.
it_it: Questo video non può essere riprodotto. Prova a usare il comando streaming.
pl_pl: Nie można odtworzyć tego wideo. Spróbuj użyć komendy streamu.
zh_cn: 无法播放该视频。请尝试使用流命令。

source: YouTube search returned no results for: %(url)s
it_it: La ricerca su YouTube non ha prodotto alcun risultato per: %(url)s
pl_pl: Wyszukiwanie YouTube nie zwróciło żadnych wyników dla: %(url)s

source: Processed %(number)d of %(total)d songs in %(time).3f seconds at %(time_per).2f s/song
it_it: Elaborato %(number)d di %(total)d canzoni in %(time).3f secondi in %(time_per).2f s/song
pl_pl: Przetworzono %(number)d z %(total)d utworów w %(time).3f sekund w %(time_per).2f s/spiosenka

source: No songs were added, all songs were over max duration (%(max)s seconds)
it_it: Nessuna canzone aggiunta, tutte le canzoni hanno una durata massima (%(max)s secondi)
pl_pl: Nie dodano piosenek, wszystkie piosenki przekroczyły maksymalny czas trwania (%(max)s sekund)

source: Extracted an entry with 'youtube:playlist' as extractor key
it_it: Estratto una voce con 'youtube:playlist' come chiave estrattore
pl_pl: Wyróżniono wpis z 'youtube:playlist' jako klucz ekstraktora
zh_cn: 提取了“youtube:playlist”作为提取器键的条目

source: Song duration exceeds limit (%(length)s > %(max)s)
it_it: La durata del brano supera il limite (%(length)s > %(max)s)
pl_pl: Czas trwania piosenki przekracza limit (%(length)s > %(max)s)

source: Added song(s) at position %s
it_it: Aggiunti brani alla posizione %s
pl_pl: Dodano utwór na pozycji %s

source: Cannot estimate time until playing for position: %d
it_it: Impossibile stimare il tempo di riproduzione per la posizione: %d
pl_pl: Nie można oszacować czasu do odtworzenia pozycji: %d

source: Failed to get info from the stream request: %s
it_it: Recupero delle informazioni dalla richiesta dello stream non riuscito: %s
pl_pl: Nie udało się uzyskać informacji z żądania streamu: %s

source: Streaming playlists is not yet supported.
it_it: Le playlist in streaming non sono ancora supportate.
pl_pl: Strumieniowanie list odtwarzania nie jest jeszcze obsługiwane.
zh_cn: 尚不支持流播放列表。

source: You have reached your playlist item limit (%(max)s)
it_it: Hai raggiunto il limite di elementi della playlist (%(max)s)
pl_pl: Osiągnąłeś limit przedmiotów na liście odtwarzania (%(max)s)

source: Please specify a search query. Use `help search` for more information.
it_it: Specifica una query di ricerca. Usa `help search` per maggiori informazioni.
pl_pl: Proszę określić zapytanie wyszukiwania. Aby uzyskać więcej informacji, użyj `help search`.
zh_cn: 请指定一个搜索查询。使用 "help search " 获取更多信息。

source: You cannot search for more than %(max)s videos
it_it: Non puoi cercare più di %(max)s video
pl_pl: Nie możesz wyszukać więcej niż filmy %(max)s

source: Waiting for summon lock: %s
it_it: In attesa del blocco della voce: %s
pl_pl: Oczekiwanie na zablokowanie wezwania: %s

source: Summon lock acquired for: %s
it_it: Evoca blocco acquisito per: %s
pl_pl: Przywołanie blokady za: %s

source: You are not connected to voice. Try joining a voice channel!
it_it: Non sei connesso alla voce. Prova ad unirti a un canale vocale!
pl_pl: Nie jesteś połączony z głosowaniem. Spróbuj dołączyć do kanału głosowego!
zh_cn: 您没有连接到语音。请尝试加入一个语音频道！

source: Joining %(guild)s/%(channel)s
it_it: Entrare In %(guild)s/%(channel)s
pl_pl: Dołączanie do %(guild)s/%(channel)s

source: MusicBot cannot follow a user that is not a member of the server.
it_it: MusicBot non può seguire un utente che non è un membro del server.
pl_pl: MusicBot nie może śledzić użytkownika, który nie jest członkiem serwera.
zh_cn: MusicBot 不能关注不是服务器成员的用户。

source: Player is not playing.
it_it: Il giocatore non sta giocando.
pl_pl: Gracz nie gra.
zh_cn: 播放器未播放。

source: Nothing in the queue to remove!
it_it: Niente nella coda da rimuovere!
pl_pl: Nic w kolejce do usunięcia!
zh_cn: 队列中没有要移除的内容！

source: Nothing found in the queue from user `%(user)s`
it_it: Niente trovato nella coda dall'utente `%(user)s`
pl_pl: Nic nie znaleziono w kolejce od użytkownika `%(user)s`

source: You do not have the permission to remove that entry from the queue. You must be the one who queued it or have instant skip permissions.
it_it: Non hai il permesso di rimuovere questa voce dalla coda. Devi essere colui che l'ha accodata o che ha i permessi di salto istantanei.
pl_pl: Nie masz uprawnień do usuwania tego wpisu z kolejki. Musisz być tym, który ma w kolejce do kolejki lub ma natychmiastowe uprawnienia do pominięcia.

source: Invalid entry number. Use the queue command to find queue positions.
it_it: Numero di voce non valido. Usa il comando coda per trovare le posizioni della coda.
pl_pl: Nieprawidłowy numer wpisu. Użyj polecenia kolejki, aby znaleźć pozycje kolejki.
zh_cn: 无效的条目编号。使用队列命令来查找队列位置。

source: Can't skip! The player is not playing!
it_it: Impossibile saltare! Il giocatore non sta giocando!
pl_pl: Nie można pominąć! Gracz nie gra!
zh_cn: 无法跳过！玩家没有在玩！

source: You do not have permission to force skip a looped song.
it_it: Non hai il permesso di forzare un brano in loop.
pl_pl: Nie masz uprawnień, aby wymusić pominięcie piosenki w pętli.
zh_cn: 您没有权限强制跳过循环歌曲。

source: You do not have permission to force skip.
it_it: Non hai il permesso di forzare il salto.
pl_pl: Nie masz uprawnień do wymuszania pominięcia.
zh_cn: 您没有强制跳过的权限。

source: You do not have permission to skip a looped song.
it_it: Non hai il permesso di saltare una canzone in loop.
pl_pl: Nie masz uprawnień, aby pominąć piosenkę w pętli.
zh_cn: 您没有权限跳过循环歌曲。

source: `%(new_volume)s` is not a valid number
it_it: `%(new_volume)s` non è un numero valido
pl_pl: `%(new_volume)s` nie jest poprawną liczbą

source: Unreasonable volume change provided: %(old_volume)s%(adjustment)s is %(new_volume)s. Volume can only be set from 1 to 100.
it_it: Variazione di volume irragionevole fornita: %(old_volume)s%(adjustment)s è %(new_volume)s. Il volume può essere impostato solo da 1 a 100.
pl_pl: Nieuzasadniona zmiana głośności: %(old_volume)s%(adjustment)s to %(new_volume)s. Głośność można ustawić tylko od 1 do 100.

source: Unreasonable volume provided: %(volume)s. Provide a value between 1 and 100.
it_it: Volume irragionevole fornito: %(volume)s. Fornire un valore compreso tra 1 e 100.
pl_pl: Podano nieracjonalny wolumen: %(volume)s. Podaj wartość między 1 a 100.

source: No track is playing, cannot set speed. Use the config command to set a default playback speed.
it_it: Nessuna traccia in riproduzione, non è possibile impostare la velocità. Utilizzare il comando di configurazione per impostare una velocità di riproduzione predefinita.
pl_pl: Brak odtwarzanego utworu, nie można ustawić prędkości. Użyj komendy konfiguracyjnej, aby ustawić domyślną prędkość odtwarzania.

source: Speed cannot be applied to streamed media.
it_it: La velocità non può essere applicata ai media in streaming.
pl_pl: Prędkość nie może być zastosowana do mediów strumieniowych.
zh_cn: 速度不能应用于流媒体。

source: You must provide a speed to set.
it_it: Devi fornire una velocità da impostare.
pl_pl: Musisz podać szybkość, aby ustawić.
zh_cn: 您必须提供一个速度来设置。

source: The speed you provided is invalid. Use a number between 0.5 and 100.
it_it: La velocità fornita non è valida. Usa un numero compreso tra 0.5 e 100.
pl_pl: Podana prędkość jest nieprawidłowa. Użyj liczby od 0,5 do 100.
zh_cn: 您提供的速度无效。请使用0.5 至 100之间的数字。

source: Invalid option for command: `%(option)s`
it_it: Opzione non valida per il comando: `%(option)s`
pl_pl: Nieprawidłowa opcja dla polecenia: `%(option)s`

source: Failed to save aliases due to error: `%(raw_error)s`
it_it: Impossibile salvare gli alias a causa di errore: `%(raw_error)s`
pl_pl: Nie udało się zapisać aliasów z powodu błędu: `%(raw_error)s`

source: You must supply an alias and a command to alias
it_it: Devi fornire un alias e un comando all'alias
pl_pl: Musisz podać alias i polecenie do aliasu
zh_cn: 您必须为别名提供别名和命令

source: You must supply an alias name to remove.
it_it: Devi fornire un nome alias da rimuovere.
pl_pl: Musisz podać nazwę aliasu aby usunąć.
zh_cn: 您必须提供一个别名来移除。

source: The alias `%(alias)s` does not exist.
it_it: L'alias `%(alias)s` non esiste.
pl_pl: Alias `%(alias)s` nie istnieje.

source: Config cannot use channel and user mentions at the same time.
it_it: La configurazione non può usare le menzioni del canale e dell'utente allo stesso tempo.
pl_pl: Konfiguracja nie może używać kanału i wzmianek użytkownika w tym samym czasie.
zh_cn: 配置不能同时使用频道和用户提到。

source: Unable to reload Config due to the following error: %(raw_error)s
it_it: Impossibile ricaricare la configurazione a causa del seguente errore: %(raw_error)s
pl_pl: Nie można przeładować konfiguracji z powodu następującego błędu: %(raw_error)s

source: Could not resolve section name from option name. Please provide a valid section and option name.
it_it: Impossibile risolvere il nome della sezione dal nome dell'opzione. Si prega di fornire una sezione e un nome di opzione validi.
pl_pl: Nie można ustalić nazwy sekcji z nazwy opcji. Proszę podać poprawną sekcję i nazwę opcji.
zh_cn: 无法解析选项名称中的部分名称。请提供一个有效的部分和选项名称。

source: The option given is ambiguous, please provide a section name.
it_it: L'opzione data è ambigua, si prega di fornire un nome di sezione.
pl_pl: Podana opcja jest niejednoznaczna, proszę podać nazwę sekcji.
zh_cn: 给定的选项含混，请提供一个章节名称。

source: You must provide a section name and option name for this command.
it_it: Devi fornire un nome di sezione e un nome di opzione per questo comando.
pl_pl: Musisz podać nazwę sekcji i nazwę opcji dla tej komendy.
zh_cn: 您必须提供此命令的部分名称和选项名称。

source: The section `%(section)s` is not available. The available sections are: %(sections)s
it_it: La sezione `%(section)s` non è disponibile. Le sezioni disponibili sono: %(sections)s
pl_pl: Sekcja `%(section)s` jest niedostępna. Dostępne sekcje to: %(sections)s

source: The option `%(option)s` is not available.
it_it: L'opzione `%(option)s` non è disponibile.
pl_pl: Opcja `%(option)s` jest niedostępna.

source: Option `%(option)s` is not editable. Cannot save to disk.
it_it: L'opzione `%(option)s` non è modificabile. Impossibile salvare sul disco.
pl_pl: Opcja `%(option)s` nie jest edytowalna. Nie można zapisać na dysku.

source: Failed to save the option: `%(option)s`
it_it: Impossibile salvare l'opzione: `%(option)s`
pl_pl: Nie udało się zapisać opcji: `%(option)s`

source: Option `%(option)s` is not editable, value cannot be displayed.
it_it: L'opzione `%(option)s` non è modificabile, il valore non può essere visualizzato.
pl_pl: Opcja `%(option)s` nie jest edytowalna, wartość nie może być wyświetlana.

source: Option `%(option)s` is not editable. Cannot update setting.
it_it: L'opzione `%(option)s` non è modificabile. Impossibile aggiornare l'impostazione.
pl_pl: Opcja `%(option)s` nie jest edytowalna. Nie można zaktualizować ustawienia.

source: You must provide a section, option, and value for this sub command.
it_it: Devi fornire una sezione, un'opzione e un valore per questo sottocomando.
pl_pl: Musisz podać sekcję, opcję i wartość dla tej podkomendy.
zh_cn: 您必须为此子命令提供一个章节、选项和值。

source: Doing set with on %(config)s == %(value)s
it_it: Impostazione con %(config)s == %(value)s
pl_pl: Ustawiono na %(config)s == %(value)s

source: Option `%(option)s` was not updated!
it_it: L'opzione `%(option)s` non è stata aggiornata!
pl_pl: Opcja `%(option)s` nie została zaktualizowana!

source: Option `%(option)s` is not editable. Cannot reset to default.
it_it: L'opzione `%(option)s` non è modificabile. Impossibile ripristinare il valore predefinito.
pl_pl: Opcja `%(option)s` nie jest edytowalna. Nie można zresetować do domyślnego.

source: Resetting %(config)s to default %(value)s
it_it: Ripristino %(config)s a predefinito %(value)s
pl_pl: Resetowanie %(config)s do domyślnego %(value)s

source: Option `%(option)s` was not reset to default!
it_it: L'opzione `%(option)s` non è stata ripristinata al predefinito!
pl_pl: Opcja `%(option)s` nie została zresetowana do domyślnych!

source: The option command is deprecated, use the config command instead.
it_it: Il comando opzione è deprecato, utilizza invece il comando di configurazione.
pl_pl: Komenda opcji jest przestarzała, zamiast tego użyj komendy config.
zh_cn: 选项命令已废弃，请使用配置命令。

source: Invalid option specified, use: info, update, or clear
it_it: Opzione specificata non valida, usa: info, aggiornamento o cancella
pl_pl: Podano nieprawidłową opcję, użyj: info, update, lub wyczyść
zh_cn: 指定的选项无效，使用：信息、更新或清除

source: **Failed** to delete cache, check logs for more info...
it_it: **Non riuscito** per eliminare la cache, controlla i log per ulteriori informazioni...
pl_pl: **Nie udało się** usunąć pamięci podręcznej, sprawdź logi aby uzyskać więcej informacji...
zh_cn: **删除缓存失败，请检查日志获取更多信息...

source: Queue page argument must be a whole number.
it_it: L'argomento pagina coda deve essere un numero intero.
pl_pl: Argument strony kolejki musi być liczbą całkowitą.
zh_cn: 队列页面参数必须是一个整数。

source: There are no songs queued! Queue something with a play command.
it_it: Non ci sono brani in coda! Coda qualcosa con un comando di riproduzione.
pl_pl: Brak utworów w kolejce! Kolejka czegoś z poleceniem odtwarzania.
zh_cn: 没有播放队列的歌曲！队列中有播放命令的歌曲。

source: Requested page number is out of bounds. There are **%(total)s** pages.
it_it: Il numero di pagina richiesto è fuori dai limiti. Ci sono ** pagine%(total)s**.
pl_pl: Żądany numer strony jest poza zakresem. Istnieją ** strony%(total)s**.
