Repository: Just-Some-Bots/MusicBot
Catalog: i18n/*/LC_MESSAGES/musicbot_logs.po
Languages: it_it, pl_pl, zh_cn

source: Unhandled exception in _for_each_future callback.
it_it: Eccezione non gestita in _for_each_future callback.
pl_pl: Nieobsługiwany wyjątek w _for_each_future wywołanie zwrotne.
zh_cn: 在 _for_each_future 回拨中未处理异常。

source: Starting asyncio subprocess (%(process)s) with command: %(run)s
it_it: Avviare asyncio sottoprocesso (%(process)s) con comando: %(run)s
pl_pl: Rozpoczęcie podprocesu asyncio (%(process)s) z poleceniem: %(run)s

source: Extraction did not provide a duration for this entry. MusicBot cannot estimate queue times until it is downloaded. Entry name: %s
it_it: L'estrazione non ha fornito una durata per questa voce. MusicBot non può stimare i tempi di coda finché non viene scaricata. Nome voce: %s
pl_pl: Ekstrakcja nie zapewniła czasu trwania tego wpisu. MusicBot nie może oszacować czasu kolejki dopóki nie zostanie pobrana. Nazwa wpisu: %s

source: Entry data is missing version number, cannot deserialize.
it_it: I dati dell'elemento sono mancanti numero di versione, impossibile deserializzare.
pl_pl: Wpis nie zawiera numeru wersji, nie można deserializować.
zh_cn: 条目数据缺失版本号，不能反序列化。

source: Entry data has the wrong version number, cannot deserialize.
it_it: I dati dell'elemento hanno il numero di versione sbagliato, non è possibile deserializzare.
pl_pl: Dane wpisu mają nieprawidłowy numer wersji, nie można deserializować.
zh_cn: 条目数据有错误的版本号，不能反序列化。

source: Deserialized URLPlaylistEntry cannot find channel with ID: %s
it_it: L'URLPlaylistEntry deserializzato non può trovare il canale con ID: %s
pl_pl: Deserializowany wpis listy URLPlaylist nie może znaleźć kanału z ID: %s
zh_cn: 反序列化的 URL 播放列表条目无法找到 ID 的频道: %s

source: Deserialized URLPlaylistEntry has the wrong channel type: %s
it_it: L'URLPlaylistEntry deserializzato ha il tipo di canale sbagliato: %s
pl_pl: Deserializowany wpis listy URLPlaylist ma nieprawidłowy typ kanału: %s
zh_cn: 反序列化的 URL 播放列表条目有错误的频道类型： %s

source: Deserialized URLPlaylistEntry cannot find author with ID: %s
it_it: L'URLPlaylistEntry deserializzato non può trovare l'autore con ID: %s
pl_pl: Deserializowany wpis listy URLPlaylist nie może znaleźć autora z ID: %s
zh_cn: 反序列化的 URL 播放列表条目找不到 ID 的作者： %s

source: Deserialized URLPlaylistEntry has an author ID but no channel for lookup!
it_it: URLPlaylistEntry deserializzato ha un ID autore ma nessun canale per la ricerca!
pl_pl: Deserializowany wpis listy URLPlaylist ma identyfikator autora, ale nie ma kanału do wyszukiwania!
zh_cn: 反序列化的 URL 播放列表条目有作者ID，但没有查找频道！

source: Could not load %s
it_it: Impossibile caricare %s
pl_pl: Nie można załadować %s
zh_cn: 无法加载 %s

source: Cannot download Spotify links, processing error with type: %(type)s
it_it: Impossibile scaricare i collegamenti di Spotify, errore di elaborazione con il tipo: %(type)s
pl_pl: Nie można pobrać linków Spotify, przetwarzanie błędu z typu: %(type)s

source: Getting ready for entry: %r
it_it: Preparazione per l'ingresso: %r
pl_pl: Przygotowanie do wpisu: %r
zh_cn: 准备进入： %r

source: Download cached with different extension...
it_it: Scarica la cache con diverse estensioni...
pl_pl: Pobierz buforowane z innym rozszerzeniem...
zh_cn: 下载缓存的扩展...

source: Local size different from remote size. Re-downloading...
it_it: Dimensione locale diversa dalla dimensione remota. Ricaricamento...
pl_pl: Rozmiar lokalny różny od rozmiaru zdalnego. Ponowne pobieranie...
zh_cn: 本地大小不同于远程大小。正在重新下载...

source: Download already cached at: %s
it_it: Download già memorizzato in: %s
pl_pl: Pobierz już w pamięci podręcznej w: %s
zh_cn: 下载已缓存于: %s

source: MusicBot could not get duration data for this entry. Queue time estimation may be unavailable until this track is cleared. Entry file: %s
it_it: MusicBot non può ottenere dati di durata per questa voce. La stima del tempo in coda potrebbe non essere disponibile fino a quando questa traccia non sarà stata cancellata. File di ingresso: %s
pl_pl: MusicBot nie mógł uzyskać danych o czasie trwania dla tego wpisu. Oszacowanie czasu oczekiwania może być niedostępne, dopóki ten utwór nie zostanie wyczyszczony. Plik wpisu: %s

source: Got duration of %(time)s seconds for file: %(file)s
it_it: Durata di %(time)s secondi per il file: %(file)s
pl_pl: Czas trwania %(time)s sekund dla pliku: %(file)s

source: There as a problem with working out EQ, likely caused by a strange installation of FFmpeg. This has not impacted the ability for the bot to work, but will mean your tracks will not be equalized.
it_it: C'è un problema con il lavoro EQ, probabilmente causato da una strana installazione di FFmpeg. Questo non ha influenzato la capacità del bot di funzionare, ma significa che le tue tracce non saranno equalizzate.
pl_pl: Wystąpił problem z wypracowaniem EQ, prawdopodobnie spowodowany dziwną instalacją FFmpeg. To nie wpłynęło na zdolność bota do pracy, ale oznacza, że Twoje ścieżki nie będą równe.
zh_cn: 解决EQ问题可能是一个奇怪的安装程序造成的。 这不会影响机器人的工作能力，但意味着您的轨道将不会平等。

source: Exception while checking entry data.
it_it: Eccezione durante il controllo dei dati di inserimento.
pl_pl: Wyjątek podczas sprawdzania danych wejściowych.
zh_cn: 检查条目数据时出现异常。

source: Trying to get duration via pymediainfo for: %s
it_it: Tentativo di ottenere durata tramite pymediainfo per: %s
pl_pl: Próba uzyskania czasu trwania przez pymediainfo dla: %s
zh_cn: 尝试通过pymediainfo 获取持续时间: %s

source: Failed to get duration via pymediainfo.
it_it: Impossibile ottenere la durata tramite pymediainfo.
pl_pl: Nie udało się uzyskać czasu trwania przez pymediainfo.
zh_cn: 无法通过 pymediainfo 获取持续时间。

source: Trying to get duration via ffprobe for: %s
it_it: Tentativo di ottenere durata tramite ffprobe per: %s
pl_pl: Próba uzyskania czasu trwania przez ffprobe dla: %s
zh_cn: 尝试通过 ffprobe 获取持续时间: %s

source: Could not locate ffprobe in your path!
it_it: Impossibile individuare ffprobe nel tuo percorso!
pl_pl: Nie można zlokalizować ffprobe na twojej ścieżce!
zh_cn: 无法在您的路径中找到 ffprobe!

source: ffprobe returned something that could not be used.
it_it: ffprobe ha restituito qualcosa che non poteva essere utilizzato.
pl_pl: ffprobe zwrócił coś, czego nie można użyć.
zh_cn: ffprobe 返回了无法使用的东西。

source: ffprobe could not be executed for some reason.
it_it: ffprobe non può essere eseguito per qualche ragione.
pl_pl: ffprobe nie może być wykonany z jakiegoś powodu.
zh_cn: 由于某种原因无法执行 ffprobe。

source: Calculating mean volume of: %s
it_it: Calcolo del volume medio di: %s
pl_pl: Obliczanie średniej głośności: %s
zh_cn: 计算平均体积: %s

source: Could not locate ffmpeg on your path!
it_it: Impossibile individuare ffmpeg sul tuo percorso!
pl_pl: Nie można zlokalizować ffmpeg na twojej ścieżce!
zh_cn: 无法在您的路径上找到 ffmpeg ！

source: Could not parse 'I' in normalize json.
it_it: Impossibile analizzare 'I' nel normalizzare json.
pl_pl: Nie można przetworzyć 'I' w normalizacji json.
zh_cn: 无法解析 json。

source: Could not parse 'LRA' in normalize json.
it_it: Impossibile analizzare 'LRA' nella normalizzazione json.
pl_pl: Nie można przetworzyć 'LRA' w normalizacji json.
zh_cn: 无法解析 json 正常化 “LRA”。

source: Could not parse 'TP' in normalize json.
it_it: Impossibile analizzare 'TP' nel normalizzare json.
pl_pl: Nie można przetworzyć 'TP' w normalizacji json.
zh_cn: 无法解析 json 正常化 “TP”。

source: Could not parse 'thresh' in normalize json.
it_it: Impossibile analizzare 'thresh' nella normalizzazione json.
pl_pl: Nie udało się przetworzyć 'invol' w normalizacji json.
zh_cn: 无法解析 json 正常化 “阈值”。

source: Could not parse 'offset' in normalize json.
it_it: Impossibile analizzare 'offset' nel normalizzare json.
pl_pl: Nie można przetworzyć 'offset' w normalizacji json.
zh_cn: 无法解析 json 正常化 'offset' 。

source: Download started: %r
it_it: Download avviato: %r
pl_pl: Rozpoczęto pobieranie: %r
zh_cn: 开始下载： %r

source: Download attempt %s of 3...
it_it: Scarica tentativo %s di 3...
pl_pl: Pobierz próbę %s z 3...
zh_cn: 下载尝试 %s ，共 3 次...

source: Download incomplete, retrying in %(time).1f seconds. Reason: %(raw_error)s
it_it: Download incompleto, riprovando in %(time).1f secondi. Motivo: %(raw_error)s
pl_pl: Pobieranie niekompletne, ponowna próba za %(time).1f sekund. Powód: %(raw_error)s

source: Download failed, not retrying! Reason: %(raw_error)s
it_it: Download fallito, non riprovare! Motivo: %(raw_error)s
pl_pl: Pobieranie nie powiodło się, nie próbuję ponownie! Powód: %(raw_error)s

source: Download did not complete due to an error: %(raw_error)s
it_it: Il download non è stato completato a causa di un errore: %(raw_error)s
pl_pl: Pobieranie nie zostało zakończone z powodu błędu: %(raw_error)s

source: Download failed due to a yt-dlp error: %(raw_error)s
it_it: Download fallito a causa di un errore yt-dlp: %(raw_error)s
pl_pl: Pobieranie nie powiodło się z powodu błędu yt-dlp: %(raw_error)s

source: Extraction encountered an unhandled exception.
it_it: L'estrazione ha incontrato un'eccezione non gestita.
pl_pl: Ekstrakcja napotkała nieobsługiwany wyjątek.
zh_cn: 解压遇到一个未处理的异常。

source: Download failed due to an unhandled exception: %(raw_error)s
it_it: Download fallito a causa di un'eccezione non gestita: %(raw_error)s
pl_pl: Pobieranie nie powiodło się z powodu nieobsługiwanego wyjątku: %(raw_error)s

source: Download failed: %r
it_it: Download non riuscito: %r
pl_pl: Pobieranie nie powiodło się: %r
zh_cn: 下载失败： %r

source: Failed to extract data for the requested media.
it_it: Estrazione dei dati per il supporto richiesto non riuscita.
pl_pl: Nie udało się wyodrębnić danych dla żądanych mediów.
zh_cn: 为请求的媒体提取数据失败。

source: Download complete: %r
it_it: Download completato: %r
pl_pl: Pobieranie zakończone: %r
zh_cn: 下载完成： %r

source: Deserialized StreamPlaylistEntry cannot find channel with ID: %s
it_it: StreamPlaylistEntry deserializzato non può trovare il canale con ID: %s
pl_pl: Deserializowany StreamPlaylistEntry nie może znaleźć kanału o ID: %s
zh_cn: 反序列化的 StreamPlaylistEnter无法找到与 ID: %s 的频道

source: Deserialized StreamPlaylistEntry has the wrong channel type: %s
it_it: StreamPlaylistEntry deserializzato ha il tipo di canale sbagliato: %s
pl_pl: Deserialized StreamPlaylistEntry ma nieprawidłowy typ kanału: %s
zh_cn: 反序列化的 StreamPlaylistentre 有错误的频道类型: %s

source: Deserialized StreamPlaylistEntry cannot find author with ID: %s
it_it: StreamPlaylistEntry deserializzato non può trovare l'autore con ID: %s
pl_pl: Deserialized StreamPlaylistEntry nie może znaleźć autora z ID: %s
zh_cn: 反序列化的 StreamPlaylistEnter无法找到 ID 的作者： %s

source: Deserialized StreamPlaylistEntry has an author ID but no channel for lookup!
it_it: Deserialized StreamPlaylistEntry ha un ID autore ma nessun canale per la ricerca!
pl_pl: Deserialized StreamPlaylistEntry ma identyfikator autora, ale nie ma kanału do wyszukiwania!
zh_cn: 反序列化的 StreamPlaylistEnter有作者ID，但没有查找渠道！

source: Deserialized LocalFilePlaylistEntry cannot find channel with ID: %s
it_it: LocalFilePlaylistEntry deserializzato non riesce a trovare il canale con ID: %s
pl_pl: Deserializowany LocalFilePlaylistEntry nie może znaleźć kanału o ID: %s
zh_cn: 反序列化的 LocalFilePlaylistEnter无法找到与 ID: %s 的频道

source: Deserialized LocalFilePlaylistEntry has the wrong channel type: %s
it_it: Deserializzato LocalFilePlaylistEntry ha il tipo di canale sbagliato: %s
pl_pl: Deserializowany LocalFilePlaylistEntry ma nieprawidłowy typ kanału: %s
zh_cn: 反序列化的本地文件播放列表条目有错误的通道类型： %s

source: Deserialized LocalFilePlaylistEntry cannot find author with ID: %s
it_it: Deserialized LocalFilePlaylistEntry non può trovare l'autore con ID: %s
pl_pl: Deserializowany LocalFilePlaylistEntry nie może znaleźć autora z ID: %s
zh_cn: 反序列化的 LocalFilePlaylistEnter无法找到ID: %s 的作者

source: Deserialized LocalFilePlaylistEntry has an author ID but no channel for lookup!
it_it: Deserialized LocalFilePlaylistEntry ha un ID autore ma nessun canale per la ricerca!
pl_pl: Deserialized LocalFilePlaylistEntry ma identyfikator autora, ale nie ma kanału do wyszukiwania!
zh_cn: Desertialized LocalFilePlaylistEnt有作者ID，但没有查找渠道！

source: Got duration of %(seconds)s seconds for file: %(file)s
it_it: Durata di %(seconds)s secondi per il file: %(file)s
pl_pl: Czas trwania %(seconds)s sekund dla pliku: %(file)s

source: Failed to delete cache file: %s
it_it: Eliminazione del file cache non riuscita: %s
pl_pl: Nie udało się usunąć pliku pamięci podręcznej: %s
zh_cn: 删除缓存文件失败： %s

source: Audio cache directory has been removed.
it_it: La directory della cache audio è stata rimossa.
pl_pl: Katalog pamięci podręcznej dźwięku został usunięty.
zh_cn: 音频缓存目录已删除。

source: Audio cache directory could not be removed or renamed.
it_it: La directory della cache audio non può essere rimossa o rinominata.
pl_pl: Nie można usunąć lub zmienić nazwy katalogu pamięci podręcznej dźwięku.
zh_cn: 无法删除或重命名音频缓存目录。

source: Audio cache directory could not be removed.
it_it: La directory della cache audio non può essere rimossa.
pl_pl: Katalog pamięci podręcznej dźwięku nie może zostać usunięty.
zh_cn: 无法删除音频缓存目录。

source: Audio cache has no limits set, nothing to delete.
it_it: La cache audio non ha limiti impostati, niente da eliminare.
pl_pl: Pamięć podręczna audio nie ma ustawionych limitów, nic do usunięcia.
zh_cn: 音频缓存没有设置限制，无需删除。

source: Audio cache deleted %(number)s file(s), total of %(size)s removed.
it_it: Cache audio cancellato %(number)s file(s), totale %(size)s rimosso.
pl_pl: Pamięć podręczna audio usunięta z pliku %(number)s , usunięto w sumie %(size)s.

source: Audio cached retained %(number)s file(s) from autoplaylist, total of %(size)s retained.
it_it: File memorizzati nella cache %(number)s dalla playlist automatica, totale di %(size)s mantenuto.
pl_pl: Dźwięk zachowany w pamięci podręcznej plików %(number)s z listy autoplayerów, w sumie zachowano %(size)s.

source: Audio cache is now %(size)s over %(number)s file(s).
it_it: La cache audio ora è %(size)s su %(number)s file.
pl_pl: Pamięć podręczna dźwięku jest teraz %(size)s przez pliki %(number)s.

source: Audio cache directory is missing, nothing to delete.
it_it: Manca la directory della cache audio, niente da eliminare.
pl_pl: Brak katalogu pamięci podręcznej dźwięku, nic do usunięcia.
zh_cn: 缺少音频缓存目录，无需删除。

source: Audio cache file is from autoplaylist but marked as busted, ignoring it.
it_it: Il file cache audio è dalla scaletta automatica, ma contrassegnato come busted, ignorandolo.
pl_pl: Plik pamięci podręcznej dźwięku jest z listy autoplaylist ale oznaczony jako wysadzony, ignorując go.
zh_cn: 音频缓存文件来自自动布局列表，但标记为忙，忽略它。

source: Cache level requires cleanup. %s
it_it: Il livello della cache richiede la pulizia. %s
pl_pl: Poziom pamięci podręcznej wymaga oczyszczania. %s
zh_cn: 缓存级别需要清理。 %s

source: Auto playlist has no cache map, moving on.
it_it: La playlist automatica non ha mappa cache, in movimento.
pl_pl: Automatyczna lista odtwarzania nie ma mapy pamięci podręcznej, poruszanie się.
zh_cn: 自动播放列表没有缓存地图，正在继续。

source: Loaded auto playlist cache map with %s entries.
it_it: Mappa cache playlist automatica caricata con voci %s.
pl_pl: Wczytano mapę pamięci podręcznej automatycznej listy odtwarzania z wpisami %s.
zh_cn: 加载了带有 %s 条目的自动播放列表缓存图。

source: Failed to load auto playlist cache map.
it_it: Impossibile caricare la mappa della cache della playlist automatica.
pl_pl: Nie udało się załadować mapy pamięci podręcznej automatycznej playlisty.
zh_cn: 自动载入播放列表缓存映射失败。

source: Saved auto playlist cache map with %s entries.
it_it: Mappa della cache della scaletta automatica salvata con voci %s.
pl_pl: Zapisano mapę pamięci podręcznej automatycznej listy odtwarzania z wpisami %s.
zh_cn: 保存了带有 %s 条条目的自动播放列表缓存图。

source: Failed to save auto playlist cache map.
it_it: Impossibile salvare la mappa della cache della playlist automatica.
pl_pl: Nie udało się zapisać mapy pamięci podręcznej listy odtwarzania.
zh_cn: 保存自动播放列表缓存映射失败。

source: Auto playlist cache map conflict on Key: %(file)s Old: %(old)s New: %(new)s
it_it: Conflitto della mappa della cache della scaletta automatica sulla chiave: %(file)s Vecchio: %(old)s Nuovo: %(new)s
pl_pl: Konflikt map automatycznej listy odtwarzania na kluczu: %(file)s Stared: %(old)s Nowy: %(new)s

source: Lang Argument Error: %s
it_it: Errore Argomento Lang: %s
pl_pl: Błąd Argumentu Lang: %s
zh_cn: Lang 参数错误: %s

source: Failed to load log translations for any of: [%s] in: %s
it_it: Impossibile caricare le traduzioni del log per uno qualsiasi di: [%s] in: %s
pl_pl: Nie udało się załadować tłumaczenia dziennika dla dowolnego z: [%s] w: %s

source: Failed to load discord translations for any of: [%s] guild: %s in: %s
it_it: Caricamento delle traduzioni della discordia non riuscito: [%s] gilda: %s in: %s
pl_pl: Nie udało się załadować tłumaczenia dysku dla dowolnego z: [%s] gildii: %s w: %s

source: Loading JSON file: %s
it_it: Caricamento file JSON: %s
pl_pl: Ładowanie pliku JSON: %s
zh_cn: 正在加载 JSON 文件： %s

source: Error parsing %s as JSON
it_it: Errore nell'analizzare %s come JSON
pl_pl: Błąd przetwarzania %s jako JSON

source: Could not grab data from JSON key: %s
it_it: Impossibile catturare i dati dalla chiave JSON: %s
pl_pl: Nie można pobrać danych z klucza JSON: %s
zh_cn: 无法从 JSON 键抓取数据: %s

source: Skipping logger setup, already set up
it_it: Impossibile impostare il logger, già impostato
pl_pl: Pominięto konfigurację logera, już skonfigurowano
zh_cn: 跳过记录器设置，已经设置

source: Log level was previously set via override to: %s
it_it: Il livello di log è stato precedentemente impostato tramite override a: %s
pl_pl: Poziom dziennika został wcześniej ustawiony poprzez nadpisanie do: %s
zh_cn: 日志级别先前通过覆盖设置到: %s

source: Changing log level to: %s
it_it: Cambiare il livello del log in: %s
pl_pl: Zmiana poziomu dziennika na: %s

source: MusicBot loggers have been called to shut down.
it_it: I logger di MusicBot sono stati chiamati a chiudere.
pl_pl: Rejestratorzy MusicBot zostali wezwani do wyłączenia.
zh_cn: MusicBot 伐木者已被召唤关闭。

source: Permissions file not found, copying from: %s
it_it: File di permessi non trovato, copia da: %s
pl_pl: Nie znaleziono pliku uprawnień, kopiowanie z: %s
zh_cn: 找不到权限文件，复制自: %s

source: Error copying example permissions file: %s
it_it: Errore nel copiare il file dei permessi di esempio: %s
pl_pl: Błąd podczas kopiowania przykładowego pliku uprawnień: %s
zh_cn: 复制示例权限文件时出错： %s

source: Config 'OwnerID' is set auto, will set correctly later.
it_it: La configurazione 'OwnerID' è impostata automaticamente, verrà impostata correttamente in seguito.
pl_pl: Konfiguracja 'OwnerID' jest ustawiona automatycznie, zostanie ustawiona poprawnie później.
zh_cn: 配置“所有者ID”设置为自动设置，稍后会正确设置。

source: Validating permissions...
it_it: Convalida dei permessi...
pl_pl: Sprawdzanie uprawnień...
zh_cn: 正在验证权限...

source: Setting auto 'OwnerID' for owner permissions group.
it_it: Impostazione automatica 'OwnerID' per il gruppo di permessi del proprietario.
pl_pl: Ustawienie automatycznego 'WłaścicielaID' dla grupy uprawnień właściciela.
zh_cn: 为所有者权限组设置自动“所有者ID”。

source: Updating group in permissions file: %s
it_it: Aggiornamento del gruppo nel file autorizzazioni: %s
pl_pl: Aktualizacja grupy w pliku uprawnień: %s
zh_cn: 正在更新权限文件中的组: %s

source: Deleting group from permissions file: %s
it_it: Eliminazione gruppo dal file permessi: %s
pl_pl: Usuwanie grupy z pliku uprawnień: %s
zh_cn: 正在从权限文件中删除组： %s

source: Adding new group to permissions file: %s
it_it: Aggiunta di un nuovo gruppo al file autorizzazioni: %s
pl_pl: Dodawanie nowej grupy do pliku uprawnień: %s
zh_cn: 添加新组到权限文件： %s

source: Saving permissions file now.
it_it: Salvataggio file permessi ora.
pl_pl: Zapisywanie pliku uprawnień teraz.
zh_cn: 正在保存权限文件。

source: ConfigUpdater could not parse the permissions file!
it_it: ConfigUpdater non può analizzare il file dei permessi!
pl_pl: Konfiguracja Updater nie może przetworzyć pliku uprawnień!
zh_cn: 配置更新器无法解析权限文件！

source: You have a duplicate section, fix your Permissions file!
it_it: Hai una sezione duplicata, correggi il tuo file Permessi!
pl_pl: Masz zduplikowaną sekcję, napraw swój plik uprawnień!
zh_cn: 您有一个重复的部分，修复您的权限文件！

source: Failed to save permissions group: %s
it_it: Salvataggio del gruppo di permessi non riuscito: %s
pl_pl: Nie udało się zapisać grupy uprawnień: %s
zh_cn: 保存权限组失败： %s

source: Dev Bug! Permission has getter that is not available.
it_it: Dev Bug! Il permesso ha getter che non è disponibile.
pl_pl: Dev Bug! Zezwolenie jest niedostępne.
zh_cn: 开发错误！权限不可用。

source: Dev Bug! Permission has invalid type, getter and default must be the same type.
it_it: Dev Bug! Il permesso ha un tipo, getter e predefinito non validi devono essere lo stesso tipo.
pl_pl: Błąd dewelo! Uprawnienie ma nieprawidłowy typ, getter i domyślnie musi być tym samym typem.
zh_cn: 开发错误！权限类型无效，获取类型和默认类型必须相同。

source: Max search items can't be larger than 100. Setting to 100.
it_it: Gli elementi di ricerca massimi non possono essere più grandi di 100. Impostazione a 100.
pl_pl: Maksymalna ilość elementów wyszukiwania nie może być większa niż 100. Ustawienie na 100.
zh_cn: 最多搜索项不能大于 100。设置为 100。

source: You do not have permission to play the requested media. The yt-dlp extractor `%(extractor)s` is not permitted in your group.
it_it: Non hai il permesso di riprodurre il supporto richiesto. L'estrattore yt-dlp `%(extractor)s` non è permesso nel tuo gruppo.
pl_pl: Nie masz uprawnień do odtworzenia żądanych mediów. Ekspaktor yt-dlp `%(extractor)s` nie jest dozwolony w twojej grupie.

source: Cleanup got called on the audio source: %r
it_it: Cleanup è stato chiamato sulla sorgente audio: %r
pl_pl: Czyszczenie zostało wywołane na źródle audio: %r
zh_cn: 清理被调用到音频源： %r

source: MusicPlayer.skip() is called: %s
it_it: MusicPlayer.skip() è chiamato: %s
pl_pl: MusicPlayer.skip() jest wywołany: %s
zh_cn: MusicPlayer.skip() 被调用: %s

source: MusicPlayer.stop() is called: %s
it_it: MusicPlayer.stop() è chiamato: %s
pl_pl: Odtwarzacz MusicPlayer.stop() jest wywołany: %s
zh_cn: MusicPlayer.stop() 被调用: %s

source: Guild or network unavailable, cannot resume playback.
it_it: Gilda o rete non disponibile, impossibile riprendere la riproduzione.
pl_pl: Gildia lub sieć są niedostępne, nie można wznowić odtwarzania.
zh_cn: 公会或网络不可用，无法恢复播放。

source: MusicPlayer.resume() is called: %s
it_it: MusicPlayer.resume() è chiamato: %s
pl_pl: MusicPlayer.resume() jest wywołany: %s
zh_cn: MusicPlayer.resume() 被调用: %s

source: MusicPlayer.pause() is called: %s
it_it: MusicPlayer.pause() è chiamato: %s
pl_pl: MusicPlayer.pause() jest wywołany: %s
zh_cn: MusicPlayer.pause() 被调用: %s

source: MusicPlayer.kill() is called: %s
it_it: MusicPlayer.kill() è chiamato: %s
pl_pl: MusicPlayer.kill() jest wywołany: %s
zh_cn: MusicPlayer.kill() 被调用: %s

source: Playback finished, but _current_entry is None.
it_it: Riproduzione terminata, ma _current_entry non è nessuno.
pl_pl: Odtwarzanie zakończone, ale _current_entry nie istnieje.
zh_cn: 播放结束，但_current_entre 没有

source: Possible Warning from kill_current_player()
it_it: Possibile avviso da kill_current_player()
pl_pl: Możliwe ostrzeżenie przed kill_current_player()
zh_cn: 可能来自击杀_current_player() 的警告

source: MusicPlayer.play() is called: %s
it_it: MusicPlayer.play() è chiamato: %s
pl_pl: MusicPlayer.play() jest wywołany: %s
zh_cn: MusicPlayer.play() 被调用: %s

source: MusicPlayer is dead, cannot play.
it_it: MusicPlayer è morto, non può giocare.
pl_pl: MusicPlayer jest martwy, nie można odtworzyć.
zh_cn: MusicPlayer 已死亡，无法播放。

source: Guild or network unavailable, cannot start playback.
it_it: Gilda o rete non disponibile, impossibile avviare la riproduzione.
pl_pl: Gildia lub sieć są niedostępne, nie można rozpocząć odtwarzania.
zh_cn: 公会或网络不可用，无法启动回放。

source: MusicPlayer was previously paused, resuming current player.
it_it: MusicPlayer è stato precedentemente in pausa, riprendendo il giocatore corrente.
pl_pl: MusicPlayer został wcześniej wstrzymany, wznawiając bieżącego odtwarzacza.
zh_cn: MusicPlayer 先前已暂停，恢复当前播放器。
