Repository: Just-Some-Bots/MusicBot
Catalog: i18n/*/LC_MESSAGES/musicbot_logs.po
Languages: it_it, pl_pl, zh_cn

source: Skipped the current playlist entry.
it_it: Ha saltato la voce attuale della scaletta.
pl_pl: Pominięto bieżący wpis listy odtwarzania.
zh_cn: 跳过当前播放列表条目。

source: Not enough entries to paginate the queue.
it_it: Non ci sono abbastanza voci per paginare la coda.
pl_pl: Za mało wpisów do stronicowania kolejki.
zh_cn: 没有足够的条目来分页队列。

source: Could not post queue message, no message to add reactions to.
it_it: Impossibile postare il messaggio in coda, nessun messaggio a cui aggiungere reazioni.
pl_pl: Nie można opublikować wiadomości kolejki, nie ma wiadomości do dodania reakcji.
zh_cn: 无法发布队列消息，没有消息添加反应。

source: Try that again. MusicBot couldn't make or get a reference to the queue message. If the issue persists, file a bug report.
it_it: Riprova. MusicBot non ha potuto fare o ottenere un riferimento al messaggio di coda. Se il problema persiste, file una segnalazione di bug.
pl_pl: Spróbuj ponownie. MusicBot nie mógł nawiązać do wiadomości kolejki. Jeśli problem będzie się powtarzał, zgłoś błąd.

source: Cannot use purge on private DM channel.
it_it: Impossibile usare lo spurgo sul canale DM privato.
pl_pl: Nie można użyć czyszczenia na prywatnym kanale DM.
zh_cn: 无法在私有DM频道上使用净化。

source: The given URL was not a valid URL.
it_it: L'URL fornito non era un URL valido.
pl_pl: Podany adres URL nie jest prawidłowym adresem URL.
zh_cn: 给定的 URL 不是有效的 URL。

source: Could not extract info from input url %(raw_error)s
it_it: Impossibile estrarre le informazioni dall'url di input %(raw_error)s
pl_pl: Nie można wyodrębnić informacji z wprowadzonego adresu %(raw_error)s

source: This does not seem to be a playlist.
it_it: Questa non sembra essere una playlist.
pl_pl: To nie wygląda na playlistę.
zh_cn: 这似乎不是一个播放列表。

source: Invalid user ID or server nickname, please double-check the ID and try again.
it_it: ID utente o soprannome del server non validi, si prega di ricontrollare l'ID e riprovare.
pl_pl: Nieprawidłowy identyfikator użytkownika lub nazwa serwera, sprawdź identyfikator i spróbuj ponownie.
zh_cn: 无效的用户ID或服务器昵称，请重新检查ID，然后重试。

source: Could not determine the discord User. Try again.
it_it: Impossibile determinare l'utente discord. Riprova.
pl_pl: Nie można określić użytkownika Discorda. Spróbuj ponownie.
zh_cn: 无法确定 Discord 用户，请重试。

source: Permissions cannot use channel and user mentions at the same time.
it_it: Le autorizzazioni non possono usare le menzioni del canale e dell'utente allo stesso tempo.
pl_pl: Uprawnienia nie mogą używać jednocześnie wspomnień kanału i użytkownika.
zh_cn: 权限不能同时使用频道和用户提到。

source: Unable to reload Permissions due to an error: %(raw_error)s
it_it: Impossibile ricaricare i permessi a causa di un errore: %(raw_error)s
pl_pl: Nie można przeładować uprawnień z powodu błędu: %(raw_error)s

source: You must provide a group or option name for this command.
it_it: Devi fornire un nome di gruppo o di opzione per questo comando.
pl_pl: Musisz podać nazwę grupy lub opcji dla tego polecenia.
zh_cn: 您必须为此命令提供一个组或选项名称。

source: You must provide a group, option, and value to set for this command.
it_it: Devi fornire un gruppo, un'opzione e un valore da impostare per questo comando.
pl_pl: Musisz podać grupę, opcję i wartość, aby ustawić to polecenie.
zh_cn: 您必须为此命令设置一个组、选项和值。

source: The %(option)s sub-command requires a group and permission name.
it_it: Il sottocomando %(option)s richiede un nome di gruppo e di permesso.
pl_pl: Podpolecenie %(option)s wymaga nazwy grupy i uprawnień.

source: The group `%(group)s` is not available. The available groups are: %(sections)s
it_it: Il gruppo `%(group)s` non è disponibile. I gruppi disponibili sono: %(sections)s
pl_pl: Grupa `%(group)s` jest niedostępna. Dostępne grupy to: %(sections)s

source: The permission `%(option)s` is not available.
it_it: Il permesso `%(option)s` non è disponibile.
pl_pl: Uprawnienia `%(option)s` nie są dostępne.

source: Cannot add group `%(group)s` it already exists.
it_it: Impossibile aggiungere il gruppo `%(group)s` che esiste già.
pl_pl: Nie można dodać grupy `%(group)s` już istnieje.

source: Cannot remove built-in group.
it_it: Impossibile rimuovere il gruppo integrato.
pl_pl: Nie można usunąć wbudowanej grupy.
zh_cn: 无法删除内置组。

source: The owner group is not editable.
it_it: Il gruppo proprietario non è modificabile.
pl_pl: Grupa właścicieli nie jest edytowalna.
zh_cn: 所有者群组不可编辑。

source: Failed to save the group: `%(group)s`
it_it: Impossibile salvare il gruppo: `%(group)s`
pl_pl: Nie udało się zapisać grupy: `%(group)s`

source: Doing set on %(option)s with value: %(value)s
it_it: Impostazione %(option)s con valore: %(value)s
pl_pl: Ustawiono %(option)s z wartością: %(value)s

source: Permission `%(option)s` was not updated!
it_it: Il permesso `%(option)s` non è stato aggiornato!
pl_pl: Uprawnienia `%(option)s` nie zostały zaktualizowane!

source: Failed to change username. Did you change names too many times? Remember name changes are limited to twice per hour.
it_it: Impossibile modificare il nome utente. Hai cambiato i nomi troppe volte? Ricorda che i cambiamenti di nome sono limitati a due volte all'ora.
pl_pl: Nie udało się zmienić nazwy użytkownika. Czy zmieniłeś nazwy zbyt wiele razy? Zapamiętaj zmiany nazwy są ograniczone do dwóch razy na godzinę.

source: Failed to change username due to error: %(raw_error)s
it_it: Impossibile modificare il nome utente a causa di errore: %(raw_error)s
pl_pl: Nie udało się zmienić nazwy użytkownika z powodu błędu: %(raw_error)s

source: Unable to change nickname: no permission.
it_it: Impossibile cambiare il soprannome: nessun permesso.
pl_pl: Nie można zmienić pseudonimu: brak uprawnień.
zh_cn: 无法更改昵称：没有权限。

source: Failed to set nickname due to error: %(raw_error)s
it_it: Impossibile impostare il soprannome a causa di errore: %(raw_error)s
pl_pl: Nie udało się ustawić pseudonimu z powodu błędu: %(raw_error)s

source: Custom emoji must be from this server to use as a prefix.
it_it: Le emoji personalizzate devono provenire da questo server per essere utilizzate come prefisso.
pl_pl: Niestandardowe emoji muszą być z tego serwera, aby użyć jako prefiks.
zh_cn: 自定义表情必须来自此服务器才能用作前缀。

source: Prefix per server is not enabled! Use the config command to update the prefix instead.
it_it: Prefisso per server non è abilitato! Usa il comando di configurazione per aggiornare il prefisso.
pl_pl: Prefiks na serwer nie jest włączony! Użyj komendy config aby zaktualizować prefiks.
zh_cn: 每个服务器的前缀未启用！ 使用配置命令来更新前缀。

source: This command can only be used in guilds.
it_it: Questo comando può essere usato solo nelle gilde.
pl_pl: Ta komenda może być użyta tylko w gildiach.
zh_cn: 此命令只能用于公会。

source: Invalid sub-command given. Use the help command for more information.
it_it: Sottocomando fornito non valido. Utilizzare il comando help per ulteriori informazioni.
pl_pl: Podano nieprawidłowe polecenie. Aby uzyskać więcej informacji, użyj polecenia pomocy.
zh_cn: 给定的子命令无效。请使用帮助命令获取更多信息。

source: Cannot set language to `%(locale)s` it is not available.
it_it: Impossibile impostare la lingua su `%(locale)s` non è disponibile.
pl_pl: Nie można ustawić języka na `%(locale)s` nie jest on dostępny.

source: You must provide a URL or attach a file.
it_it: È necessario fornire un URL o allegare un file.
pl_pl: Musisz podać adres URL lub załączyć plik.
zh_cn: 您必须提供一个 URL 或附加文件。

source: Unable to change avatar due to error: %(raw_error)s
it_it: Impossibile cambiare l'avatar a causa dell'errore: %(raw_error)s
pl_pl: Nie można zmienić awatara z powodu błędu: %(raw_error)s

source: MusicBot found a %s with no guild! This could be a problem.
it_it: MusicBot ha trovato un %s senza gilda! Questo potrebbe essere un problema.
pl_pl: MusicBot znalazł %s bez gildii! To może być problem.
zh_cn: MusicBot找到了一个 %s 没有公会！这可能是一个问题。

source: Not currently connected to server `%(guild)s`
it_it: Attualmente non connesso al server `%(guild)s`
pl_pl: Obecnie nie jest połączony z serwerem `%(guild)s`

source: Invalid option given, use one of: soft, full, upgrade, uppip, or upgit
it_it: Opzione fornita non valida, usa una di: soft, full, upgrade, uppip, or upgit
pl_pl: Podano nieprawidłową opcję, użyj jednej z: miękkiej, pełnej, aktualizacji, uppip lub upgit
zh_cn: 给定的选项无效，请使用其中一项：软、完整、升级、上传或上传。

source: You must provide an ID or name.
it_it: Devi fornire un ID o un nome.
pl_pl: Musisz podać identyfikator lub nazwę.
zh_cn: 您必须提供一个ID或名称。

source: No guild was found with the ID or name `%(input)s`
it_it: Nessuna gilda trovata con l'ID o il nome `%(input)s`
pl_pl: Nie znaleziono gildii o ID lub nazwie `%(input)s`

source: Activating debug breakpoint ID: %(uuid)s
it_it: Attivazione ID breakpoint di debug: %(uuid)s
pl_pl: Aktywuję ID przerwania debugowania: %(uuid)s

source: Could not import `objgraph`, is it installed?
it_it: Impossibile importare `objgraph`, è installato?
pl_pl: Nie można zaimportować `objgraf`, czy jest zainstalowany?
zh_cn: 无法导入 `objgraph` ，是否安装？

source: Debug code ran with eval().
it_it: Codice di debug eseguito con eval().
pl_pl: Kod debugowania uruchomiony z eval().
zh_cn: 调试代码使用 eval().

source: Debug code ran with exec().
it_it: Il codice di debug è funzionato con exec().
pl_pl: Kod debugowania uruchomiony z exec().
zh_cn: 调试代码与 exec() 一起运行。

source: Debug code failed to execute.
it_it: Impossibile eseguire il codice di debug.
pl_pl: Nie udało się wykonać kodu debugowania.
zh_cn: 调试代码执行失败。

source: Failed to execute debug code: %(py_code)s Exception: ``` %(ex_name)s: %(ex_text)s```
it_it: Esecuzione del codice di debug non riuscita: %(py_code)s Eccezione: ``` %(ex_name)s: %(ex_text)s```
pl_pl: Nie udało się wykonać kodu debugowania: %(py_code)s Wyjątek: ``` %(ex_name)s: %(ex_text)s```

source: Sub-command must be one of: %(options)s
it_it: Il sottocomando deve essere uno di: %(options)s
pl_pl: Podpolecenie musi być jednym z: %(options)s

source: Could not locate git executable.
it_it: Impossibile individuare git eseguibile.
pl_pl: Nie można zlokalizować pliku wykonywalnego git
zh_cn: 无法找到 git 可执行文件。

source: Failed while checking for updates via git command.
it_it: Impossibile controllare gli aggiornamenti tramite il comando git.
pl_pl: Nie powiodło się podczas sprawdzania aktualizacji za pomocą polecenia git
zh_cn: 通过 git 命令检查更新失败。

source: Package missing meta in pip report.
it_it: Pacchetto meta mancante nel rapporto pip.
pl_pl: Pakiet brakuje meta w raporcie pip.
zh_cn: Pip报告中缺少元数据。

source: Failed to get pip update status due to some error.
it_it: Impossibile ottenere lo stato di aggiornamento dei pip a causa di qualche errore.
pl_pl: Nie udało się uzyskać statusu aktualizacji pipsa z powodu błędu.
zh_cn: 由于某些错误，Pip更新状态失败。

source: Got a strange voice client entry.
it_it: Ottenuto una strana voce client vocale.
pl_pl: Masz dziwne wejście klienta głosowego.
zh_cn: 获取一个奇怪的语音客户端条目。

source: Cookies already enabled.
it_it: Cookie già abilitati.
pl_pl: Pliki cookie są już włączone.
zh_cn: Cookie 已启用。

source: Cookies must be uploaded to be enabled. (Missing cookies file.)
it_it: I cookie devono essere caricati per essere abilitati. (File dei cookie).
pl_pl: Pliki cookie muszą być przesłane, aby je włączyć. (Przeliczanie pliku cookies.)
zh_cn: Cookie 必须上传才能启用。(正在使用 cookies 文件)

source: Could not enable cookies due to error: %(raw_error)s
it_it: Impossibile abilitare i cookie a causa di errore: %(raw_error)s
pl_pl: Nie można włączyć ciasteczek z powodu błędu: %(raw_error)s

source: Could not rename cookies file due to error: %(raw_error)s Cookies temporarily disabled and will be re-enabled on next restart.
it_it: Impossibile rinominare il file cookie a causa di errore: %(raw_error)s I cookie sono temporaneamente disabilitati e saranno riattivati al prossimo riavvio.
pl_pl: Nie można zmienić nazwy pliku ciasteczek z powodu błędu: %(raw_error)s ciasteczka tymczasowo wyłączone i zostaną ponownie włączone przy następnym ponownym uruchomieniu.

source: No attached uploads were found, try again while uploading a cookie file.
it_it: Non sono stati trovati caricamenti allegati, riprova durante il caricamento di un file di cookie.
pl_pl: Nie znaleziono załączonych przesyłanych plików, spróbuj ponownie podczas przesyłania pliku cookie.
zh_cn: 没有找到附加的上传文件，上传cookie文件时再试一次。

source: Could not remove old, disabled cookies file: %(raw_error)s
it_it: Impossibile rimuovere il vecchio file cookie disabilitato: %(raw_error)s
pl_pl: Nie można usunąć starego, wyłączonego pliku ciasteczek: %(raw_error)s

source: Error downloading the cookies file from discord: %(raw_error)s
it_it: Errore nel scaricare il file dei cookie da discord: %(raw_error)s
pl_pl: Błąd podczas pobierania pliku ciasteczek z dysku: %(raw_error)s

source: Could not save cookies to disk: %(raw_error)s
it_it: Impossibile salvare i cookie sul disco: %(raw_error)s
pl_pl: Nie można zapisać ciasteczek na dysku: %(raw_error)s

source: Got a message with no channel, somehow: %s
it_it: Hai un messaggio senza canale, in qualche modo: %s
pl_pl: Masz wiadomość bez kanału, jako: %s
zh_cn: 获取一条没有频道的消息，或者说： %s

source: Ignoring command from myself (%s)
it_it: Ignorare il comando da me stesso (%s)
pl_pl: Ignorowanie komendy u mnie (%s)
zh_cn: 忽略自身的命令 (%s)

source: Ignoring command from other bot (%s)
it_it: Ignora il comando da un altro bot (%s)
pl_pl: Ignorowanie polecenia od innego bota (%s)
zh_cn: 忽略其它机器人的命令(%s)

source: Ignoring command from channel of type: %s
it_it: Ignora il comando dal canale di tipo: %s
pl_pl: Ignorowanie polecenia z kanału typu: %s
zh_cn: 忽略频道类型的命令： %s

source: User in block list: %(id)s/%(name)s tried command: %(command)s
it_it: Utente nella lista dei blocchi: %(id)s/%(name)s comando provato: %(command)s
pl_pl: Użytkownik na liście bloków: %(id)s/%(name)s wypróbowano polecenie: %(command)s

source: Message from %(id)s/%(name)s: %(message)s
it_it: Messaggio da %(id)s/%(name)s: %(message)s
pl_pl: Wiadomość od %(id)s/%(name)s: %(message)s

source: This command is not allowed for your permissions group: %(group)s
it_it: Questo comando non è consentito per il tuo gruppo di permessi: %(group)s
pl_pl: Ta komenda nie jest dozwolona dla grupy uprawnień: %(group)s

source: This command requires you to be in a Voice channel.
it_it: Questo comando richiede di essere in un canale vocale.
pl_pl: Ta komenda wymaga bycia na kanale głosowym.
zh_cn: 此命令要求您在语音频道中。

source: Invalid command usage, missing values for params: %(params)r
it_it: Utilizzo del comando non valido, valori mancanti per i parametri: %(params)r
pl_pl: Nieprawidłowe użycie polecenia, brakujące wartości dla parametrów: %(params)r

source: Error in %(command)s: %(err_name)s: %(err_text)s
it_it: Errore in %(command)s: %(err_name)s: %(err_text)s
pl_pl: Błąd w %(command)s: %(err_name)s: %(err_text)s

source: Exception while handling command: %(command)s
it_it: Eccezione durante la gestione del comando: %(command)s
pl_pl: Wyjątek podczas obsługi polecenia: %(command)s

source: Cannot generate help for missing command: %s
it_it: Impossibile generare l'aiuto per il comando mancante: %s
pl_pl: Nie można wygenerować pomocy dla brakującej komendy: %s
zh_cn: 无法为缺失的命令生成帮助： %s

source: Missing help data for command: %s
it_it: Dati di aiuto mancanti per il comando: %s
pl_pl: Brak danych pomocy dla komendy: %s
zh_cn: 缺少命令的帮助数据： %s

source: Leaving voice channel %s in %s due to inactivity.
it_it: Lasciare il canale vocale %s in %s a causa di inattività.
pl_pl: Opuszczanie kanału głosowego %s w %s z powodu braku aktywności.

source: MusicBot has become connected.
it_it: MusicBot si è connesso.
pl_pl: MusicBot został połączony.
zh_cn: MusicBot 已连接。

source: MusicBot has become disconnected.
it_it: MusicBot è stato disconnesso.
pl_pl: MusicBot został rozłączony.
zh_cn: MusicBot 已断开连接。

source: Got a Socket Event: %s
it_it: Ottenuto un Evento Socket: %s
pl_pl: Masz wydarzenie z gniazdem: %s
zh_cn: 获取一个套接字事件: %s

source: VoiceState updated before on_ready finished
it_it: Stato vocale aggiornato prima del termine _pronto
pl_pl: Stan głosowy zaktualizowany przed na_gotowością
zh_cn: 在 on_ready 完成之前更新语音状态

source: Ignoring %s in %s as it is a bound voice channel.
it_it: Ignorare %s in %s in quanto è un canale vocale collegato.
pl_pl: Ignorowanie %s w %s jako kanał głosowy połączony.
zh_cn: 忽略 %s 中的 %s ，因为它是一个绑定的语音频道。

source: %s has been detected as empty. Handling timeouts.
it_it: %s è stato rilevato come timeout vuoto.
pl_pl: %s został wykryty jako pusty. Upłynął limit czasu.
zh_cn: %s 被检测为空。处理超时。

source: A user joined %s, cancelling timer.
it_it: Un utente si è unito %s, annullando il timer.
pl_pl: Użytkownik dołączył do %s, anulował czas.
zh_cn: 一个用户加入 %s，取消计时器。

source: The bot got moved and the voice channel %s is empty. Handling timeouts.
it_it: Il bot è stato spostato e il canale vocale %s è vuoto. Timeout gestione.
pl_pl: Bot został przeniesiony, a kanał głosowy %s jest pusty. Upłynął limit czasu.
zh_cn: 机器人移动了，音频道 %s 为空。处理超时。

source: The bot got moved and the voice channel %s is not empty.
it_it: Il bot è stato spostato e il canale vocale %s non è vuoto.
pl_pl: Bot został przeniesiony, a kanał głosowy %s nie jest pusty.
zh_cn: 机器人移动了，声音频道 %s 不是空的。

source: No longer following user %s
it_it: Non più seguendo l'utente %s
pl_pl: Nie obserwuj już użytkownika %s
zh_cn: 不再关注用户 %s

source: Following user `%(user)s` to channel: %(channel)s
it_it: Seguire l'utente `%(user)s` al canale: %(channel)s
pl_pl: Obserwowany użytkownik `%(user)s` do kanału: %(channel)s

source: VoiceState disconnect before.channel is None.
it_it: VoiceState disconnetti before.channel non è nessuno.
pl_pl: Brak statusu głosowego.
zh_cn: 频道前没有语音状态断开连接。

source: Disconnected from voice by Discord API in: %(guild)s/%(channel)s (Code: %(code)s) [S:%(state)s]
it_it: Disconnesso dalla voce dall'API di Discord in: %(guild)s/%(channel)s (Code: %(code)s) [S:%(state)s]
pl_pl: Odłączono od głosu przez Discorda API w: %(guild)s/%(channel)s (Koda: %(code)s) [S:%(state)s]

source: Cannot use auto-join channel with type: %(type)s in guild: %(guild)s
it_it: Impossibile usare il canale di auto-join con il tipo: %(type)s nella gilda: %(guild)s
pl_pl: Nie można użyć kanału automatycznego dołączenia z typem: %(type)s w gildii: %(guild)s

source: Cannot find the auto-joined channel, was it deleted? Guild: %s
it_it: Impossibile trovare il canale di accesso automatico, è stato eliminato? Gilda: %s
pl_pl: Nie można znaleźć kanału automatycznego dołączenia, czy został usunięty? Gildia: %s
zh_cn: 找不到自动加入的频道，是否删除？公会: %s

source: Reconnecting to auto-joined guild on channel: %s
it_it: Riconnessione alla gilda auto-entrata sul canale: %s
pl_pl: Ponowne łączenie z automatycznie dołączoną gildią na kanale: %s
zh_cn: 重新连接到频道上的自动加入公会: %s

source: Cannot auto join channel: %s
it_it: Impossibile entrare automaticamente nel canale: %s
pl_pl: Nie można automatycznie dołączyć do kanału: %s
zh_cn: 无法自动加入频道: %s

source: Bot has been added to guild: %s
it_it: Il bot è stato aggiunto alla gilda: %s
pl_pl: Bot został dodany do gildii: %s
zh_cn: 帐号已添加到公会: %s

source: Left guild '%s' due to bot owner not found.
it_it: Gilda sinistra '%s' a causa del proprietario del bot non trovato.
pl_pl: Lewa gildia '%s' z powodu nieznalezionego właściciela bota.
zh_cn: 由于找不到机器人所有人，左公会为%s' 。

source: Creating data folder for guild %s
it_it: Creazione cartella dati per la gilda %s
pl_pl: Tworzenie folderu danych dla gildii %s
zh_cn: 为公会创建数据文件夹 %s

source: Bot has been removed from guild: %s
it_it: Il bot è stato rimosso dalla gilda: %s
pl_pl: Bot został usunięty z gildii: %s
zh_cn: 机器人已从公会中移除： %s

source: Updated guild list:
it_it: Lista gilda aggiornata:
pl_pl: Zaktualizowano listę gildii:
zh_cn: 更新公会列表：

source: Guild "%s" has become available.
it_it: Gilda "%s" è diventato disponibile.
pl_pl: Gildia "%s" stała się dostępna.
zh_cn: 公会"%s"已经可用。

source: Resuming player in "%s" due to availability.
it_it: Riprendere il giocatore in "%s" a causa della disponibilità.
pl_pl: Wznawianie gracza w "%s" ze względu na dostępność.
zh_cn: 由于可用，恢复玩家“%s”。

source: Guild "%s" has become unavailable.
it_it: Gilda "%s" non è disponibile.
pl_pl: Gildia "%s" stała się niedostępna.
zh_cn: 公会"%s" 已不可用。

source: Pausing player in "%s" due to unavailability.
it_it: Pausa giocatore in "%s" a causa di indisponibilità.
pl_pl: Zatrzymanie gracza w "%s" z powodu niedostępności.
zh_cn: 由于不可用而暂停玩家 "%s"。

source: Guild update for: %s
it_it: Aggiornamento gilda per: %s
pl_pl: Aktualizacja Gildii dla: %s
zh_cn: 公会更新: %s

source: Guild attribute %(attr)s is now: %(new)s -- Was: %(old)s
it_it: L'attributo della Gilda %(attr)s è ora: %(new)s -- Era %(old)s
pl_pl: Atrybut gildii %(attr)s jest teraz: %(new)s -- Was: %(old)s

source: Channel update for: %(channel)s -- %(changes)s
it_it: Aggiornamento canale per: %(channel)s -- %(changes)s
pl_pl: Aktualizacja kanału dla: %(channel)s -- %(changes)s

source: Creating %s
it_it: Creazione %s
pl_pl: Tworzenie %s
zh_cn: 正在创建 %s

source: Loading config from: %s
it_it: Caricamento configurazione da: %s
pl_pl: Ładowanie konfiguracji z: %s
zh_cn: 正在加载配置： %s

source: Error while reading config. Problem: One or more required config option sections are missing. The missing sections are: %(sections)s Solution: Repair your config options file. Each [Section] must appear only once, with no other text on the same line. Each section must have at least one option. Use the example options as a template or copy it from the repository.
it_it: Errore durante la lettura della configurazione. Problema: Mancano una o più sezioni di opzioni di configurazione richieste. Le sezioni mancanti sono: Soluzione %(sections)s : Riparare il file delle opzioni di configurazione. Ogni [Section] deve apparire una sola volta, senza nessun altro testo sulla stessa riga. Ogni sezione deve avere almeno un'opzione. Utilizzare le opzioni di esempio come modello o copiarlo dal repository.
pl_pl: Błąd podczas odczytywania konfiguracji. Problem: Brakuje jednej lub więcej sekcji opcji konfiguracji. Brakujące sekcje to: %(sections)s Rozwiązanie: Napraw plik opcji konfiguracyjnych. Każdy [Section] musi pojawiać się tylko raz, bez żadnego innego tekstu w tej samej linijce. Każda sekcja musi mieć co najmniej jedną opcję. Użyj opcji przykładowych jako szablonu lub skopiuj je z repozytorium.

source: Cannot store more than %s log files. Option LogsMaxKept will be limited instead.
it_it: Impossibile memorizzare più di file di log %s . L'opzione LogsMaxKept sarà limitata.
pl_pl: Nie można przechowywać więcej niż %s plików dziennika. Opcja LogsMaxKept będzie ograniczona.
zh_cn: 不能存储超过 %s 的日志文件。选项LogsMaxKept 将被限制。

source: Config option LogsDateFormat is empty and this will break log file rotation. Using default instead.
it_it: Opzione di configurazione LogsDateFormat è vuoto e questo interromperà la rotazione del file di registro. Usando invece predefinito.
pl_pl: Opcja konfiguracji LogsDateFormat jest pusta i spowoduje to przerwanie rotacji pliku dziennika. Użyj domyślnego.
zh_cn: 配置选项 LogsDateFormat 是空的，这将破坏日志文件的旋转。使用默认值。

source: Error while validating config options. Problem: Config option AudioCachePath is not a directory. Solution: Make sure the path you configured is a path to a folder / directory.
it_it: Errore durante la convalida delle opzioni di configurazione. Problema: Opzione di configurazione AudioCachePath non è una directory. Soluzione: Assicurati che il percorso configurato sia un percorso per una cartella / directory.
pl_pl: Błąd podczas sprawdzania opcji konfiguracji. Problem: Opcja konfiguracji AudioCachePath nie jest katalogiem. Rozwiązanie: Upewnij się, że ścieżka, którą skonfigurowałeś jest ścieżką do folderu / katalogu.

source: An exception was thrown while validating AudioCachePath.
it_it: È stata lanciata un'eccezione durante la convalida di AudioCachePath.
pl_pl: Podczas sprawdzania poprawności AudioCachePath, wystąpił wyjątek.
zh_cn: 验证AudioCachePath时出现异常。
