Repository: Just-Some-Bots/MusicBot
Catalog: i18n/*/LC_MESSAGES/musicbot_messages.po
Languages: it_it, sv_se

source: You must provide a speed to set.
it_it: Devi fornire una velocità da impostare.
sv_se: Du måste ange en hastighet att ställa in.

source: The speed you provided is invalid. Use a number between 0.5 and 100.
it_it: La velocità fornita non è valida. Usa un numero compreso tra 0.5 e 100.
sv_se: Hastigheten du angav är ogiltig. Använd ett nummer mellan 0,5 och 100.

source: Setting playback speed to `%(speed).3f` for current track.
it_it: Impostazione della velocità di riproduzione su `%(speed).3f` per la traccia corrente.
sv_se: Ställer in uppspelningshastighet till `%(speed).3f` för nuvarande spår.

source: Add an new alias with optional arguments.
it_it: Aggiungi un nuovo alias con argomenti opzionali.
sv_se: Lägg till ett nytt alias med valfria argument.

source: Allows management of aliases from discord. To see aliases use the help command.
it_it: Consente la gestione degli alias dalla discordia. Per vedere gli alias usare il comando aiuto.
sv_se: Tillåter hantering av alias från oenighet. För att se alias använder du hjälpkommandot.

source: Invalid option for command: `%(option)s`
it_it: Opzione non valida per il comando: `%(option)s`
sv_se: Ogiltigt alternativ för kommandot: `%(option)s`

source: Aliases reloaded from config file.
it_it: Alias ricaricato dal file di configurazione.
sv_se: Alias laddade om från konfigurationsfilen.

source: Aliases saved to config file.
it_it: Alias salvati nel file di configurazione.
sv_se: Alias sparade i konfigurationsfilen.

source: Failed to save aliases due to error: `%(raw_error)s`
it_it: Impossibile salvare gli alias a causa di errore: `%(raw_error)s`
sv_se: Det gick inte att spara alias på grund av fel: `%(raw_error)s`

source: You must supply an alias and a command to alias
it_it: Devi fornire un alias e un comando all'alias
sv_se: Du måste tillhandahålla ett alias och ett kommando till alias

source: New alias added. `%(alias)s` is now an alias of `%(command)s`
it_it: Nuovo alias aggiunto. `%(alias)s` è ora un alias di `%(command)s`
sv_se: Nytt alias tillagt. `%(alias)s` är nu ett alias av `%(command)s`

source: You must supply an alias name to remove.
it_it: Devi fornire un nome alias da rimuovere.
sv_se: Du måste ange ett alias namn för att ta bort.

source: The alias `%(alias)s` does not exist.
it_it: L'alias `%(alias)s` non esiste.
sv_se: Alias `%(alias)s` finns inte.

source: Alias `%(alias)s` was removed.
it_it: Alias `%(alias)s` è stato rimosso.
sv_se: Alias `%(alias)s` togs bort.

source: Shows help text about any missing config options.
it_it: Mostra il testo di aiuto su tutte le opzioni di configurazione mancanti.
sv_se: Visar hjälptext om eventuella saknade konfigurationsalternativ.

source: Lists the names of options which have been changed since loading config file.
it_it: Elenca i nomi delle opzioni che sono state modificate dal caricamento del file di configurazione.
sv_se: Listar namnen på alternativ som har ändrats sedan du laddade konfigurationsfilen.

source: List the available config options and their sections.
it_it: Elenca le opzioni di configurazione disponibili e le loro sezioni.
sv_se: Lista tillgängliga konfigurationsalternativ och deras sektioner.

source: Reload the options.ini file from disk.
it_it: Ricarica il file options.ini dal disco.
sv_se: Ladda om filen options.ini från disk.

source: Shows help text for a specific option.
it_it: Mostra il testo di aiuto per un'opzione specifica.
sv_se: Visar hjälptext för ett specifikt alternativ.

source: Display the current value of the option.
it_it: Mostra il valore corrente dell'opzione.
sv_se: Visa det aktuella värdet av alternativet.

source: Saves the current value to the options file.
it_it: Salva il valore corrente nel file delle opzioni.
sv_se: Sparar det aktuella värdet till alternativfilen.

source: Validates the option and sets the config for the session, but not to file.
it_it: Convalida l'opzione e imposta la configurazione per la sessione, ma non per il file.
sv_se: Validerar alternativet och ställer in konfigurationen för sessionen, men inte filen.

source: Reset the option to its default value.
it_it: Reimposta l'opzione al valore predefinito.
sv_se: Återställ alternativet till dess standardvärde.

source: Manage options.ini configuration from within Discord.
it_it: Gestisci la configurazione options.ini all'interno di Discord.
sv_se: Hantera options.ini konfiguration inifrån Discord.

source: Config cannot use channel and user mentions at the same time.
it_it: La configurazione non può usare le menzioni del canale e dell'utente allo stesso tempo.
sv_se: Konfigurationen kan inte använda kanal och användarnamn samtidigt.

source: **Missing Option:** `%(config)s` ``` %(comment)s Default is set to: %(default)s```
it_it: **Opzione mancante:** `%(config)s` ``` %(comment)s Il valore predefinito è impostato a: %(default)s```
sv_se: **Alternativ saknas :** `%(config)s` ``` %(comment)s Standard är satt till: %(default)s```

source: *All config options are present and accounted for!*
it_it: *Tutte le opzioni di configurazione sono presenti e contabilizzate!*
sv_se: *Alla konfigurationsalternativ är närvarande och redovisas för!*

source: No config options appear to be changed.
it_it: Nessuna opzione di configurazione sembra essere cambiata.
sv_se: Inga konfigurationsalternativ verkar ändras.

source: **Changed Options:** %(changed)s
it_it: **Opzioni Modificate:** %(changed)s
sv_se: **Ändrade alternativ:** %(changed)s

source: ## Available Options: **Editable Options:** %(editable)s **Manual Edit Only:** %(manual)s
it_it: ## Opzioni Disponibili: **Opzioni Modificabili:** %(editable)s **Modifica Manuale Solamente:** %(manual)s
sv_se: ## Tillgängliga alternativ: **Redigerbara alternativ:** %(editable)s **Endast manuell redigering:** %(manual)s

source: Config options reloaded from file successfully!
it_it: Opzioni di configurazione ricaricate dal file con successo!
sv_se: Konfigurationsalternativ laddades om från filen framgångsrikt!

source: Unable to reload Config due to the following error: %(raw_error)s
it_it: Impossibile ricaricare la configurazione a causa del seguente errore: %(raw_error)s
sv_se: Det går inte att ladda om konfigurationen på grund av följande fel: %(raw_error)s

source: Could not resolve section name from option name. Please provide a valid section and option name.
it_it: Impossibile risolvere il nome della sezione dal nome dell'opzione. Si prega di fornire una sezione e un nome di opzione validi.
sv_se: Kunde inte lösa undervisningsnamn från alternativets namn. Ange ett giltigt undervisnings- och alternativnamn.

source: The option given is ambiguous, please provide a section name.
it_it: L'opzione data è ambigua, si prega di fornire un nome di sezione.
sv_se: Det alternativ som anges är tvetydigt, ange ett avsnittsnamn.

source: You must provide a section name and option name for this command.
it_it: Devi fornire un nome di sezione e un nome di opzione per questo comando.
sv_se: Du måste ange ett namn och alternativnamn för detta kommando.

source: The section `%(section)s` is not available. The available sections are: %(sections)s
it_it: La sezione `%(section)s` non è disponibile. Le sezioni disponibili sono: %(sections)s
sv_se: Sektionen `%(section)s` är inte tillgänglig. De tillgängliga sektionerna är: %(sections)s

source: The option `%(option)s` is not available.
it_it: L'opzione `%(option)s` non è disponibile.
sv_se: Alternativet `%(option)s` är inte tillgängligt.

source: This option can only be set by editing the config file.
it_it: Questa opzione può essere impostata solo modificando il file di configurazione.
sv_se: Det här alternativet kan bara ställas in genom att redigera konfigurationsfilen.

source: By default this option is set to: %(default)s
it_it: Per impostazione predefinita questa opzione è impostata a: %(default)s
sv_se: Som standard är detta alternativ inställt på: %(default)s

source: **Option:** `%(config)s` %(comment)s %(default)s
it_it: **Opzione:** `%(config)s` %(comment)s %(default)s
sv_se: **Val:** `%(config)s` %(comment)s %(default)s

source: Option `%(option)s` is not editable. Cannot save to disk.
it_it: L'opzione `%(option)s` non è modificabile. Impossibile salvare sul disco.
sv_se: Alternativet `%(option)s` är inte redigerbart. Kan inte spara till disk.

source: Failed to save the option: `%(option)s`
it_it: Impossibile salvare l'opzione: `%(option)s`
sv_se: Kunde inte spara alternativet: `%(option)s`

source: Successfully saved the option: `%(config)s`
it_it: Opzione salvata con successo: `%(config)s`
sv_se: Alternativet sparades framgångsrikt: `%(config)s`

source: Option `%(option)s` is not editable, value cannot be displayed.
it_it: L'opzione `%(option)s` non è modificabile, il valore non può essere visualizzato.
sv_se: Alternativ `%(option)s` är inte redigerbar, värde kan inte visas.

source: **Option:** `%(config)s` Current Value: `%(loaded)s` INI File Value: `%(ini)s`
it_it: **Opzione:** `%(config)s` Valore Attuale: `%(loaded)s` INI Valore Del File: `%(ini)s`
sv_se: **Val:** `%(config)s` Nuvarande värde: `%(loaded)s` INI filvärde: `%(ini)s`

source: Option `%(option)s` is not editable. Cannot update setting.
it_it: L'opzione `%(option)s` non è modificabile. Impossibile aggiornare l'impostazione.
sv_se: Alternativet `%(option)s` är inte redigerbart. Kan inte uppdatera inställningen.

source: You must provide a section, option, and value for this sub command.
it_it: Devi fornire una sezione, un'opzione e un valore per questo sottocomando.
sv_se: Du måste ange ett avsnitt, alternativ och värde för detta underkommando.

source: Option `%(option)s` was not updated!
it_it: L'opzione `%(option)s` non è stata aggiornata!
sv_se: Alternativet `%(option)s` uppdaterades inte!

source: Option `%(config)s` was updated for this session. To save the change use `config save %(section)s %(option)s`
it_it: L'opzione `%(config)s` è stata aggiornata per questa sessione. Per salvare il cambiamento usa `config save %(section)s %(option)s`
sv_se: Alternativet `%(config)s` uppdaterades för denna session. För att spara ändringen använd `config save %(section)s %(option)s`

source: Option `%(option)s` is not editable. Cannot reset to default.
it_it: L'opzione `%(option)s` non è modificabile. Impossibile ripristinare il valore predefinito.
sv_se: Alternativet `%(option)s` är inte redigerbart. Kan inte återställa till standard.

source: Option `%(option)s` was not reset to default!
it_it: L'opzione `%(option)s` non è stata ripristinata al predefinito!
sv_se: Alternativet `%(option)s` återställdes inte till standard!

source: Option `%(config)s` was reset to its default value `%(default)s`. To save the change use `config save %(section)s %(option)s`
it_it: L'opzione `%(config)s` è stata ripristinata al suo valore predefinito `%(default)s`. Per salvare la modifica usa `config save %(section)s %(option)s`
sv_se: Alternativ `%(config)s` återställdes till sitt standardvärde `%(default)s`. För att spara ändringen använd `config save %(section)s %(option)s`

source: Deprecated command, use the config command instead.
it_it: Comando obsoleto, usa invece il comando di configurazione.
sv_se: Föråldrat kommando, använd kommandot config istället.

source: The option command is deprecated, use the config command instead.
it_it: Il comando opzione è deprecato, utilizza invece il comando di configurazione.
sv_se: Alternativkommandot är föråldrat, använd kommandot config istället.

source: Display information about cache storage or clear cache according to configured limits. Using update option will scan the cache for external changes before displaying details.
it_it: Visualizza le informazioni sulla cache o sulla cache pulita in base ai limiti configurati. Usando l'opzione di aggiornamento scansionerà la cache per modifiche esterne prima di visualizzare i dettagli.
sv_se: Visa information om cache-lagring eller rensa cache enligt konfigurerade begränsningar. Genom att använda uppdateringsalternativet kommer att skanna cachen efter externa ändringar innan detaljer visas.

source: Invalid option specified, use: info, update, or clear
it_it: Opzione specificata non valida, usa: info, aggiornamento o cancella
sv_se: Ogiltigt alternativ angivet, användning: info, uppdatering eller rensa

source: Disabled
it_it: Disabilitato
sv_se: Inaktiverad

source: Enabled
it_it: Abilitato
sv_se: Aktiverad

source: %(time)s days
it_it: %(time)s giorni
sv_se: %(time)s dagar

source: Unlimited
it_it: Illimitato
sv_se: Obegränsad

source: **Video Cache:** *%(state)s* **Storage Limit:** *%(size)s* **Time Limit:** *%(time)s* **Cached Now: %(used)s in %(files)s file(s).
sv_se: **Video Cache:** *%(state)s* **Lagringsbegränsning:** *%(size)s* **Tidsbegränsning:** *%(time)s* **Cached nu: %(used)s i %(files)s fil(er).

source: Cache has been cleared.
it_it: La cache è stata cancellata.
sv_se: Cachen har rensats.

source: **Failed** to delete cache, check logs for more info...
it_it: **Non riuscito** per eliminare la cache, controlla i log per ulteriori informazioni...
sv_se: **Misslyckades** att ta bort cache, kolla loggar för mer information...

source: No cache found to clear.
it_it: Nessuna cache trovata da cancellare.
sv_se: Ingen cache hittades att rensa.

source: Display information about the current player queue. Optional page number shows later entries in the queue.
it_it: Visualizza informazioni sulla coda di riproduttore corrente. Numero di pagina opzionale mostra le voci successive nella coda.
sv_se: Visa information om aktuell spelarkö. Valfritt sidnummer visar senare poster i kön.

source: Queue page argument must be a whole number.
it_it: L'argomento pagina coda deve essere un numero intero.
sv_se: Kö sida argument måste vara ett heltal.

source: Requested page number is out of bounds. There are **%(total)s** pages.
it_it: Il numero di pagina richiesto è fuori dai limiti. Ci sono ** pagine%(total)s**.
sv_se: Begärt sidnummer är utanför gränserna. Det finns **%(total)s** sidor.

source: (unknown duration)
it_it: (durata sconosciuta)
sv_se: (okänd tid)

source: Currently playing: `%(title)s` Added by: `%(user)s` Progress: `[%(progress)s/%(total)s]`
it_it: Attualmente in riproduzione: `%(title)s` Aggiunto da: `%(user)s` Progresso: `[%(progress)s/%(total)s]`
sv_se: Spelar just nu: `%(title)s` La till: `%(user)s` Framsteg: `[%(progress)s/%(total)s]`

source: **Entry #%(index)s:**Title: `%(title)s` Added by: `%(user)s
it_it: **Voce #%(index)s:**Titolo: `%(title)s` Aggiunto da: `%(user)s
sv_se: **Inlägg #%(index)s:**Titel: `%(title)s` Lades till av: `%(user)s

source: %(progress)sThere are `%(total)s` entries in the queue. Here are the next %(per_page)s songs, starting at song #%(start)s %(tracks)s
it_it: %(progress)sCi sono `%(total)s` voci nella coda. Ecco le prossime canzoni %(per_page)s , a partire dalla canzone #%(start)s %(tracks)s
sv_se: %(progress)sDet finns `%(total)s` poster i kön. Här är nästa %(per_page)s låtar, med start på låten #%(start)s %(tracks)s

source: Songs in queue
it_it: Brani in coda
sv_se: Låtar i kö

source: Try that again. MusicBot couldn't make or get a reference to the queue message. If the issue persists, file a bug report.
it_it: Riprova. MusicBot non ha potuto fare o ottenere un riferimento al messaggio di coda. Se il problema persiste, file una segnalazione di bug.
sv_se: Försök igen. MusicBot kunde inte göra eller få en referens till kömeddelandet. Om problemet kvarstår, skicka in en felrapport.

source: Search for and remove bot messages and commands from the calling text channel. Optionally supply a number of messages to search through, 50 by default 500 max. This command may be slow if larger ranges are given.
it_it: Cerca e rimuovi i messaggi e i comandi del bot dal canale di testo della chiamata. Facoltativamente fornisce un numero di messaggi da ricercare, 50 per impostazione predefinita 500 max. Questo comando può essere lento se vengono forniti intervalli più grandi.
sv_se: Sök efter och ta bort botmeddelanden och kommandon från anropstextkanalen. Tillval tillhandahålla ett antal meddelanden att söka genom, 50 som standard 500 max. Detta kommando kan vara långsamt om större intervall anges.

source: Invalid parameter. Please provide a number of messages to search.
it_it: Parametri non validi. Si prega di fornire un numero di messaggi da cercare.
sv_se: Ogiltig parameter. Ange ett antal meddelanden att söka.

source: Cannot use purge on private DM channel.
it_it: Impossibile usare lo spurgo sul canale DM privato.
sv_se: Kan inte använda rensning på privat DM-kanal.

source: Cleaned up %(number)s message(s).
it_it: Ripuliti %(number)s messaggio.
sv_se: Rensade upp %(number)s meddelande(er).

source: Bot does not have permission to manage messages.
it_it: Il bot non ha i permessi per gestire i messaggi.
sv_se: Bot har inte behörighet att hantera meddelanden.

source: Dump the individual URLs of a playlist to a file.
it_it: Ricarica i singoli URL di una scaletta su un file.
sv_se: Dumpa de enskilda webbadresserna i en spellista till en fil.

source: The given URL was not a valid URL.
it_it: L'URL fornito non era un URL valido.
sv_se: Den angivna URL:en var inte en giltig URL.

source: Could not extract info from input url %(raw_error)s
it_it: Impossibile estrarre le informazioni dall'url di input %(raw_error)s
sv_se: Kunde inte extrahera information från indata-url %(raw_error)s

source: This does not seem to be a playlist.
it_it: Questa non sembra essere una playlist.
sv_se: Detta verkar inte vara en spellista.

source: Here is the playlist dump for: %(url)s
it_it: Ecco il dump della playlist per: %(url)s
sv_se: Här är spellistan dumpa för: %(url)s

source: Display your Discord User ID, or the ID of a mentioned user. This command is deprecated in favor of Developer Mode in Discord clients.
it_it: Visualizza il tuo ID utente Discord, o l'ID di un utente menzionato. Questo comando è deprecato a favore della Modalità Sviluppatore nei client Discord.
sv_se: Visa ditt Discord-användar-ID eller ID för en nämnd användare. Detta kommando är föråldrat till förmån för utvecklarläge i Discord-klienter.

source: Your user ID is `%(id)s`
it_it: Il tuo ID utente è `%(id)s`
sv_se: Ditt användar-ID är `%(id)s`

source: The user ID for `%(username)s` is `%(id)s`
it_it: L'ID utente per `%(username)s` è `%(id)s`
sv_se: Användar-ID för `%(username)s` är `%(id)s`

source: List the Discord IDs for the selected category. Returns all ID data by default, but one or more categories may be selected. This command is deprecated in favor of using Developer mode in Discord clients.
it_it: Elenca gli ID Discord per la categoria selezionata. Restituisce tutti i dati ID per impostazione predefinita, ma una o più categorie possono essere selezionate. Questo comando è deprecato a favore dell'utilizzo della modalità Sviluppatore nei client Discord.
sv_se: Lista Discord-ID för den valda kategorin. Returnerar alla ID-data som standard, men en eller flera kategorier kan väljas. Detta kommando är föråldrat till förmån för att använda Utvecklarläge i Discord-klienter.

source: Valid categories: %(cats)s
it_it: Categorie valide: %(cats)s
sv_se: Giltiga kategorier: %(cats)s

source: Here are the IDs you requested:
it_it: Ecco gli ID che hai richiesto:
sv_se: Här är de ID du begärt:

source: Get a list of your permissions, or the permissions of the mentioned user.
it_it: Ottieni un elenco dei tuoi permessi, o i permessi dell'utente menzionato.
sv_se: Få en lista över dina rättigheter eller behörigheter för den nämnda användaren.

source: Invalid user ID or server nickname, please double-check the ID and try again.
it_it: ID utente o soprannome del server non validi, si prega di ricontrollare l'ID e riprovare.
sv_se: Ogiltigt användar-ID eller server-smeknamn, vänligen dubbelkolla ID och försök igen.

source: Could not determine the discord User. Try again.
it_it: Impossibile determinare l'utente discord. Riprova.
sv_se: Kunde inte bestämma discord-användaren. Försök igen.

source: Your command permissions in %(server)s are: ``` %(permissions)s ```
it_it: I tuoi permessi di comando in %(server)s sono: ``` %(permissions)s ```
sv_se: Dina kommandobehörigheter i %(server)s är: ``` %(permissions)s ```

source: The command permissions for %(username)s in %(server)s are: ``` %(permissions)s ```
it_it: I permessi di comando per %(username)s in %(server)s sono: ``` %(permissions)s ```
sv_se: Kommandobehörigheterna för %(username)s i %(server)s är: ``` %(permissions)s ```

source: Show loaded groups and list permission options.
it_it: Mostra le opzioni dei permessi dei gruppi caricati e dell'elenco.
sv_se: Visa laddade grupper och listbehörighetsalternativ.

source: Reloads permissions from the permissions.ini file.
it_it: Ricarica i permessi dal file permissions.ini.
sv_se: Laddar om behörigheter från permissions.ini filen.

source: Add new group with defaults.
it_it: Aggiungi un nuovo gruppo con valori predefiniti.
sv_se: Lägg till ny grupp med standardinställningar.

source: Remove existing group.
it_it: Rimuovi gruppo esistente.
sv_se: Ta bort befintlig grupp.

source: Show help text for the permission option.
it_it: Mostra il testo di aiuto per l'opzione di autorizzazione.
sv_se: Visa hjälptext för behörighetsalternativet.

source: Show permission value for given group and permission.
it_it: Mostra il valore dei permessi per un determinato gruppo e permesso.
sv_se: Visa behörighetsvärde för given grupp och behörighet.

source: Save permissions group to file.
it_it: Salva gruppo di autorizzazioni su file.
sv_se: Spara behörighetsgrupp till fil.

source: Set permission value for the group.
it_it: Imposta il valore di autorizzazione per il gruppo.
sv_se: Ange behörighetsvärde för gruppen.

source: Manage permissions.ini configuration from within discord.
it_it: Gestisci la configurazione permissions.ini dall'interno di discord.
sv_se: Hantera behörighet.ini konfiguration inifrån diskord.

source: Permissions cannot use channel and user mentions at the same time.
it_it: Le autorizzazioni non possono usare le menzioni del canale e dell'utente allo stesso tempo.
sv_se: Behörigheter kan inte använda kanal och användarnamn samtidigt.

source: Permissions reloaded from file successfully!
it_it: Permessi ricaricati dal file con successo!
sv_se: Behörigheter laddades om från filen framgångsrikt!

source: Unable to reload Permissions due to an error: %(raw_error)s
it_it: Impossibile ricaricare i permessi a causa di un errore: %(raw_error)s
sv_se: Det går inte att ladda om behörigheter på grund av ett fel: %(raw_error)s

source: ## Available Groups: %(groups)s ## Available Options: %(options)s
it_it: ## Gruppi Disponibili: %(groups)s ## Opzioni Disponibili: %(options)s
sv_se: ## Tillgängliga grupper: %(groups)s ## Tillgängliga alternativ: %(options)s

source: You must provide a group or option name for this command.
it_it: Devi fornire un nome di gruppo o di opzione per questo comando.
sv_se: Du måste ange ett grupp- eller alternativnamn för detta kommando.

source: You must provide a group, option, and value to set for this command.
it_it: Devi fornire un gruppo, un'opzione e un valore da impostare per questo comando.
sv_se: Du måste ange en grupp, alternativ och värde för detta kommando.

source: The %(option)s sub-command requires a group and permission name.
it_it: Il sottocomando %(option)s richiede un nome di gruppo e di permesso.
sv_se: %(option)s underkommandot kräver ett grupp- och behörighetsnamn.

source: The group `%(group)s` is not available. The available groups are: %(sections)s
it_it: Il gruppo `%(group)s` non è disponibile. I gruppi disponibili sono: %(sections)s
sv_se: Gruppen `%(group)s` är inte tillgänglig. De tillgängliga grupperna är: %(sections)s
