Repository: Just-Some-Bots/MusicBot
Catalog: i18n/*/LC_MESSAGES/musicbot_messages.po
Languages: it_it, sv_se

source: Error while loading aliases. Problem: Your aliases files (aliases.json & example_aliases.json) are missing. Solution: Replace the alias config file(s) or copy them from: https://github.com/Just-Some-Bots/MusicBot/
it_it: Errore durante il caricamento degli alias. Problema: Mancano i tuoi file alias (aliases.json & example_aliases.json). Soluzione : Sostituire il file di configurazione alias o copiarlo da: https://github.com/Just-Some-Bots/MusicBot/
sv_se: Fel vid laddning av alias. Problem: Dina aliase-filer (aliases.json & exempel_aliases.json) saknas. Lösning: Ersätt alias config fil(er) eller kopiera dem från: https://github.com/Just-Some-Bots/MusicBot/

source: Member is not voice-enabled and cannot use this command.
it_it: Il membro non è abilitato alla voce e non può usare questo comando.
sv_se: Medlemmen är inte röstaktiverad och kan inte använda detta kommando.

source: You cannot use this command when not in the voice channel.
it_it: Non puoi usare questo comando quando non è nel canale vocale.
sv_se: Du kan inte använda detta kommando när du inte är i röstkanalen.

source: MusicBot does not have permission to Connect in channel: `%(name)s`
it_it: MusicBot non ha il permesso di connettersi nel canale: `%(name)s`
sv_se: MusicBot har inte behörighet att ansluta i kanalen: `%(name)s`

source: MusicBot does not have permission to Speak in channel: `%(name)s`
it_it: MusicBot non ha il permesso di parlare nel canale: `%(name)s`
sv_se: MusicBot har inte behörighet att tala i kanalen: `%(name)s`

source: MusicBot could not connect to the channel. Try again later, or restart the bot if this continues.
it_it: MusicBot non può connettersi al canale. Riprova più tardi, o riavvia il bot se continua.
sv_se: MusicBot kunde inte ansluta till kanalen. Försök igen senare, eller starta om boten om detta fortsätter.

source: MusicBot connection to voice was cancelled. This is odd. Maybe restart?
it_it: La connessione MusicBot alla voce è stata annullata. Questo è strano. Forse riavviare?
sv_se: MusicBot anslutning till röst avbröts. Detta är udda. Kanske omstart?

source: MusicBot does not have permission to speak.
it_it: MusicBot non ha il permesso di parlare.
sv_se: MusicBot har inte behörighet att tala.

source: MusicBot could not request to speak.
it_it: MusicBot non può richiedere di parlare.
sv_se: MusicBot kunde inte begära att få tala.

source: The bot is not in a voice channel. Use the summon command to bring the bot to your voice channel.
it_it: Il bot non è in un canale vocale. Usa il comando summon per portare il bot sul tuo canale vocale.
sv_se: Botten är inte i en röstkanal. Använd kommandot för att föra botten till din röstkanal.

source: Something is wrong, we didn't get the VoiceClient.
it_it: Qualcosa è sbagliato, non abbiamo ottenuto il VoiceClient.
sv_se: Något är fel, vi fick inte röstklienten.

source: Skipping next song `%(title)s` as requester `%(user)s` is not in voice!
it_it: Saltare la prossima canzone `%(title)s` come richiedente `%(user)s` non è in voce!
sv_se: Hoppar över nästa låt `%(title)s` som begärare `%(user)s` är inte i röst!

source: %(mention)s - your song `%(title)s` is now playing in %(channel)s!
it_it: %(mention)s - la tua canzone `%(title)s` è ora in riproduzione in %(channel)s!
sv_se: %(mention)s - din låt `%(title)s` spelar nu i %(channel)s!

source: Now playing in %(channel)s: `%(title)s` added by %(author)s!
it_it: Ora giocando in %(channel)s: `%(title)s` aggiunto da %(author)s!
sv_se: Spelar nu i %(channel)s: `%(title)s` tillagd av %(author)s!

source: Now playing automatically added entry `%(title)s` in %(channel)s!
it_it: Ora giocando automaticamente ha aggiunto la voce `%(title)s` in %(channel)s!
sv_se: Nu spelas automatiskt tillagd post `%(title)s` i %(channel)s!

source: Skipping songs added by %(user)s as they are not in voice!
it_it: Saltando le canzoni aggiunte da %(user)s come non sono nella voce!
sv_se: Hoppar över låtar som lagts till av %(user)s eftersom de inte är i röst!

source: Playback failed for song `%(song)s` due to an error: ``` %(error)s```
it_it: Riproduzione fallita per la canzone `%(song)s` a causa di un errore: ``` %(error)s```
sv_se: Uppspelning misslyckades för låt `%(song)s` på grund av ett fel: ``` %(error)s```

source: [Dev Bug] Tried sending an invalid response object.
it_it: [Dev Bug] Provato a inviare un oggetto di risposta non valido.
sv_se: [Dev Bug] Försökte skicka ett ogiltigt svarsobjekt.

source: Failed Discord API Login! Problem: MusicBot could not log into Discord API. Your Token may be incorrect or there may be an API outage. Solution: Make sure you have the correct Token set in your config. Check API status at the official site: discordstatus.com
it_it: Accesso API Discord non riuscito! Problema: MusicBot non è riuscito ad accedere all'API Discord. Il tuo token potrebbe essere errato o potrebbe esserci un'interruzione dell'API. Soluzione: Assicurati di aver impostato il token corretto nella tua configurazione. Controlla lo stato dell'API sul sito ufficiale: discordstatus.com
sv_se: Misslyckades med Discord API-inloggning! Problem: MusicBot kunde inte logga in på Discord API. Din token kan vara felaktig eller så kan det finnas ett API-avbrott. Lösning: Se till att du har rätt token inställd i din konfiguration. Kontrollera API-status på den officiella webbplatsen: discordstatus.com

source: The requested song `%(subject)s` is blocked by the song block list.
it_it: La canzone richiesta `%(subject)s` è bloccata dalla lista dei brani.
sv_se: Den efterfrågade låten `%(subject)s` blockeras av listan över låtblock.

source: Reset the auto playlist queue by copying it back into player memory. This command will be removed in a future version, replaced by the autoplaylist command(s).
it_it: Reimposta la coda di scaletta automatica copiandola nuovamente nella memoria del giocatore. Questo comando verrà rimosso in una versione futura, sostituito dai comandi della playlist automatica.
sv_se: Återställ kön för automatisk spellista genom att kopiera den tillbaka till spelarens minne. Detta kommando kommer att tas bort i en framtida version, ersätts av kommandot autoplaylist (autoplaylist).

source: Show usage and description of a command, or list all available commands.
it_it: Mostra l'utilizzo e la descrizione di un comando o elenca tutti i comandi disponibili.
sv_se: Visa användning och beskrivning av ett kommando, eller lista alla tillgängliga kommandon.

source: **Aliases for this command:**
it_it: **Alias per questo comando:**
sv_se: **Alias för detta kommando:**

source: `%(alias)s` alias of `%(command)s %(args)s`
it_it: `%(alias)s` alias di `%(command)s %(args)s`
sv_se: `%(alias)s` alias av `%(command)s %(args)s`

source: **Alias of command:** `%(command)s`
sv_se: **Kommandoalias:** `%(command)s`

source: No such command
it_it: Comando inesistente
sv_se: Inget sådant kommando

source: The list above shows only commands permitted for your use. For a list of all commands, run: %(example_all)s
it_it: La lista qui sopra mostra solo i comandi consentiti per il tuo uso. Per un elenco di tutti i comandi, esegui: %(example_all)s
sv_se: Listan ovan visar endast tillåtna kommandon för din användning. För en lista över alla kommandon, kör: %(example_all)s

source: **Commands by name:** *(without prefix)* ``` %(command_list)s ``` **Command Prefix:** %(prefix)s For help with a particular command, run: %(example_command)s %(all_note)s
it_it: **Comandi per nome:** *(senza prefisso)* ``` %(command_list)s ``` **Prefisso dei comandi:** %(prefix)s Per aiuto con un particolare comando, run: %(example_command)s %(all_note)s
sv_se: **Kommandon efter namn:** *(utan prefix)* ``` %(command_list)s ``` **Kommandoprefix:** %(prefix)s För hjälp med ett visst kommando, run: %(example_command)s %(all_note)s

source: Block a mentioned user.
it_it: Blocca un utente menzionato.
sv_se: Blockera en nämnd användare.

source: Unblock a mentioned user.
it_it: Sblocca un utente menzionato.
sv_se: Avblockera en nämnd användare.

source: Show the block status of a mentioned user.
it_it: Mostra lo stato del blocco di un utente menzionato.
sv_se: Visa blockstatus för en nämnd användare.

source: Manage the users in the user block list. Blocked users are forbidden from using all bot commands.
it_it: Gestire gli utenti nella lista dei blocchi utente. agli utenti bloccati è vietato utilizzare tutti i comandi del bot.
sv_se: Hantera användare i listan över användarblock. Blockerade användare är förbjudna att använda alla bot kommandon.

source: You must mention a user or provide their ID number.
it_it: È necessario menzionare un utente o fornire il loro numero di identità.
sv_se: Du måste ange en användare eller ange deras ID-nummer.

source: Invalid sub-command given. Use `help blockuser` for usage examples.
it_it: Sottocomando fornito non valido. Usa `help blockuser` per esempi di utilizzo.
sv_se: Ogiltigt underkommando angivet. Använd `help blockuser` för användningsexempel.

source: MusicBot could not find the user(s) you specified.
it_it: MusicBot non ha trovato gli utenti specificati.
sv_se: MusicBot kunde inte hitta de användare du angav.

source: The owner cannot be added to the block list.
it_it: Il proprietario non può essere aggiunto all'elenco dei blocchi.
sv_se: Ägaren kan inte läggas till i blocklistan.

source: User block list is currently enabled.
it_it: La lista dei blocchi utente è attualmente abilitata.
sv_se: Användarblockslista är för närvarande aktiverad.

source: User block list is currently disabled.
it_it: La lista dei blocchi utente è attualmente disabilitata.
sv_se: Användarblockslista är för närvarande inaktiverad.

source: Cannot add the users you listed, they are already added.
it_it: Non è possibile aggiungere gli utenti elencati, sono già aggiunti.
sv_se: Kan inte lägga till de användare du listade, de är redan tillagda.

source: %(number)s user(s) have been added to the block list. %(status)s
it_it: %(number)s utente(i) sono stati aggiunti alla lista dei blocchi. %(status)s
sv_se: %(number)s användare har lagts till i blocklistan. %(status)s

source: None of those users are in the blacklist.
it_it: Nessuno di questi utenti è nella blacklist.
sv_se: Ingen av dessa användare finns i den svarta listan.

source: User: `%(user)s` is not blocked.
it_it: Utente: `%(user)s` non è bloccato.
sv_se: Användare: `%(user)s` är inte blockerad.

source: User: `%(user)s` is blocked.
it_it: Utente: `%(user)s` è bloccato.
sv_se: Användare: `%(user)s` är blockerad.

source: **Block list status:** %(status)s %(users)s
it_it: **Stato lista blocchi:** %(status)s %(users)s
sv_se: **Blockera liststatus:** %(status)s %(users)s

source: %(number)s user(s) have been removed from the block list. %(status)s
it_it: %(number)s utente(i) sono stati rimossi dalla lista dei blocchi. %(status)s
sv_se: %(number)s användare har tagits bort från blocklistan. %(status)s

source: Manage a block list applied to song requests and extracted song data. A subject may be a song URL or a word or phrase found in the track title. If subject is omitted, any currently playing track URL will be added instead. The song block list matches loosely, but is case-sensitive. This means adding 'Pie' will match 'cherry Pie' but not 'piecrust' in checks.
it_it: Gestisce un elenco di blocchi applicato alle richieste di brani e ai dati dei brani estratti. Un oggetto può essere un URL del brano o una parola o frase trovata nel titolo della traccia. Se l'oggetto viene omesso, verrà aggiunto un URL della traccia attualmente in riproduzione. La lista dei brani corrisponde in modo libero, ma è sensibile all'uso di maiuscole e minuscole. Questo significa che l'aggiunta di 'Pie' corrisponderà a 'Cherry Pie' ma non a 'piecrust' nei controlli.
sv_se: Hantera en blocklista som tillämpas på låtförfrågningar och extraherade låtdata. Ett ämne kan vara en låt-URL eller ett ord eller en fras som finns i låttiteln. Om ämnet utelämnas kommer någon URL som spelar spår läggas till istället. Låtblockslistan matchar löst, men är skiftlägeskänslig. Detta innebär att lägga till 'Pie' matchar 'cherry Pie' men inte 'piecrust' i schack.

source: You must provide a song subject if no song is currently playing.
it_it: Devi fornire un oggetto del brano se nessuna canzone è attualmente in riproduzione.
sv_se: Du måste ange ett låtämne om ingen låt spelas just nu.

source: Invalid sub-command given. Use `help blocksong` for usage examples.
it_it: Sottocomando fornito non valido. Usa `help blocksong` per esempi di utilizzo.
sv_se: Ogiltigt underkommando angivet. Använd `help blocksong` för användningsexempel.

source: Subject `%(subject)s` is already in the song block list.
it_it: L'oggetto `%(subject)s` è già nella lista dei brani.
sv_se: Ämne `%(subject)s` finns redan i listan över låtblock.

source: Added subject `%(subject)s` to the song block list. %(status)s
it_it: Aggiunto oggetto `%(subject)s` alla lista dei blocchi. %(status)s
sv_se: Lade till ämne `%(subject)s` i listan över låtblock. %(status)s

source: The subject is not in the song block list and cannot be removed.
it_it: L'oggetto non è nell'elenco dei brani e non può essere rimosso.
sv_se: Ämnet finns inte i listan över låtblock och kan inte tas bort.

source: Subject `%(subject)s` has been removed from the block list. %(status)s
it_it: L'oggetto `%(subject)s` è stato rimosso dalla lista dei blocchi. %(status)s
sv_se: Ämne `%(subject)s` har tagits bort från blocklistan. %(status)s

source: Adds or removes the specified song or currently playing song to/from the current playlist.
it_it: Aggiunge o rimuove la canzone specificata o attualmente in riproduzione su/dalla playlist corrente.
sv_se: Lägger till eller tar bort den angivna låten eller spelar upp låten till/från den aktuella spellistan.

source: Adds the entire queue to the guilds playlist.
it_it: Aggiunge l'intera coda alla playlist delle gilde.
sv_se: Lägger till hela kön i guilds spellista.

source: Set a playlist as default for this guild and reloads the guild auto playlist.
it_it: Imposta una playlist come predefinita per questa gilda e ricarica la playlist automatica della gilda.
sv_se: Ange en spellista som standard för denna guild och laddar om guild auto spellista.

source: Manage auto playlist files and per-guild settings.
it_it: Gestisci i file della playlist automatica e le impostazioni per gilda.
sv_se: Hantera automatiskt spellista filer och per-guild inställningar.

source: Invalid sub-command given. Use `help autoplaylist` for usage examples.
it_it: Sottocomando fornito non valido. Usa `help autoplaylist` per esempi di utilizzo.
sv_se: Ogiltigt underkommando angivet. Använd `help autoplaylist` för användningsexempel.

source: The supplied song link is invalid
it_it: Il link del brano fornito non è valido
sv_se: Länk till medföljande låt är ogiltig

source: The queue is empty. Add some songs with a play command!
it_it: La coda è vuota. Aggiungi alcuni brani con un comando di riproduzione!
sv_se: Kön är tom. Lägg till några låtar med ett låtkommando!

source: All songs in the queue are already in the autoplaylist.
it_it: Tutte le canzoni nella coda sono già nella playlist automatica.
sv_se: Alla låtar i kön finns redan i autospellistan.

source: Added %(number)d songs to the autoplaylist.
it_it: Aggiunti brani %(number)d alla playlist automatica.
sv_se: Lade till %(number)d låtar till autospellistan.

source: Added `%(url)s` to the autoplaylist.
it_it: Aggiunto `%(url)s` alla playlist automatica.
sv_se: Lade till `%(url)s` till autospellistan.

source: This song is already in the autoplaylist.
it_it: Questo brano è già nella playlist automatica.
sv_se: Den här låten finns redan i autospellistan.

source: Removed `%(url)s` from the autoplaylist.
it_it: Rimosso `%(url)s` dalla playlist automatica.
sv_se: Tog bort `%(url)s` från autospellistan.

source: This song is not yet in the autoplaylist.
it_it: Questa canzone non è ancora nella playlist automatica.
sv_se: Den här låten finns ännu inte med i autospellistan.

source: Loaded a fresh copy of the playlist: `%(file)s`
it_it: Caricato una nuova copia della playlist: `%(file)s`
sv_se: Laddade en ny kopia av spellistan: `%(file)s`

source: You must provide a playlist filename.
it_it: È necessario fornire un nome file playlist.
sv_se: Du måste ange ett filnamn för spellistan.

source: This playlist is new, you must add songs to save it to disk!
it_it: Questa playlist è nuova, devi aggiungere brani per salvarla sul disco!
sv_se: Den här spellistan är ny, du måste lägga till låtar för att spara den på disken!

source: The playlist for this server has been updated to: `%(name)s`%(note)s
it_it: La playlist per questo server è stata aggiornata a: `%(name)s`%(note)s
sv_se: Spellistan för denna server har uppdaterats till: `%(name)s`%(note)s

source: Generate an invite link that can be used to add this bot to another server.
it_it: Genera un link di invito che può essere usato per aggiungere questo bot a un altro server.
sv_se: Generera en inbjudningslänk som kan användas för att lägga till denna bot till en annan server.

source: Click here to add me to a discord server: %(url)s
it_it: Clicca qui per aggiungermi a un server discord: %(url)s
sv_se: Klicka här för att lägga till mig till en discord-server: %(url)s

source: Toggle karaoke mode on or off. While enabled, only karaoke members may queue songs. Groups with BypassKaraokeMode permission control which members are Karaoke members.
it_it: Attiva o disattiva la modalità karaoke. Quando abilitato, solo i membri karaoke possono mettere in coda canzoni. Gruppi con BypassKaraokeMode controllano quali membri sono membri di Karaoke.
sv_se: Växla karaokeläget på eller av. Medan aktiverad, kan endast karaokemedlemmar köa låtar. Grupper med BypassKaraokeMode behörighetsstyr vilka medlemmar som är Karaokemedlemmar.

source: \N{OK HAND SIGN} Karaoke mode is now enabled.
it_it: \Nla modalità{OK HAND SIGN} Karaoke è ora abilitata.
sv_se: \N{OK HAND SIGN} Karaokeläget är nu aktiverat.

source: \N{OK HAND SIGN} Karaoke mode is now disabled.
it_it: \Nla modalità{OK HAND SIGN} Karaoke è ora disabilitata.
sv_se: \N{OK HAND SIGN} Karaokeläget är nu inaktiverat.

source: You are not allowed to request playlists
it_it: Non sei autorizzato a richiedere playlist
sv_se: Du har inte behörighet att begära spellistor

source: Playlist has too many entries (%(songs)s but max is %(max)s)
it_it: La playlist ha troppe voci (%(songs)s ma il massimo è %(max)s)
sv_se: Spellistan har för många poster (%(songs)s men max är %(max)s)

source: The playlist entries will exceed your queue limit. There are %(songs)s in the list, and %(queued)s already in queue. The limit is %(max)s for your group.
it_it: Le voci della playlist supereranno il limite della tua coda. Ci sono %(songs)s nella lista, e %(queued)s già in coda. Il limite è %(max)s per il tuo gruppo.
sv_se: Spellistans poster kommer att överskrida din kögräns. Det finns %(songs)s i listan, och %(queued)s är redan i kö. Gränsen är %(max)s för din grupp.

source: Bot was previously paused, resuming playback now.
it_it: Il bot è stato precedentemente in pausa, riprendendo la riproduzione ora.
sv_se: Bot har tidigare pausats, återupptar uppspelningen nu.

source: Add a song to be played in the queue. If no song is playing or paused, playback will be started. You may supply a URL to a video or audio file or the URL of a service supported by yt-dlp. Playlist links will be extracted into multiple links and added to the queue. If you enter a non-URL, the input will be used as search criteria on YouTube and the first result played. MusicBot also supports Spotify URIs and URLs, but audio is fetched from YouTube regardless.
it_it: Aggiunge un brano da riprodurre nella coda. Se nessun brano è in riproduzione o in pausa, la riproduzione sarà avviata. È possibile fornire un URL a un file video o audio o l'URL di un servizio supportato da yt-dlp. I link della scaletta saranno estratti in più link e aggiunti alla coda. Se si inserisce un non-URL, l'input verrà utilizzato come criterio di ricerca su YouTube e il primo risultato riprodotto. MusicBot supporta anche gli URI e gli URL di Spotify, ma l'audio viene recuperato da YouTube indipendentemente da te.
sv_se: Lägg till en låt som ska spelas i kön. Om ingen låt spelas eller pausas kommer uppspelningen att startas. Du kan ange en URL till en video- eller ljudfil eller URL till en tjänst som stöds av yt-dlp. Spellista länkar kommer att extraheras till flera länkar och läggas till i kön. Om du anger en icke-URL kommer inmatningen att användas som sökkriterier på YouTube och det första resultatet spelas. MusicBot stöder också Spotify-URI:er och webbadresser, men ljudet hämtas från YouTube oavsett.

source: Play command that shuffles playlist entries before adding them to the queue.
it_it: Comando di riproduzione che mescola le voci della scaletta prima di aggiungerle alla coda.
sv_se: Spela kommando som blandar spellista poster innan du lägger till dem i kön.

source: Shuffled playlist items into the queue from `%(request)s`
it_it: Gli elementi della playlist mischiati nella coda da `%(request)s`
sv_se: Blandade spellistobjekt i kön från `%(request)s`

source: A play command that adds the song as the next to play rather than last. Read help for the play command for information on supported inputs.
it_it: Un comando di riproduzione che aggiunge il brano come il prossimo per suonare piuttosto che per ultimo. Leggi l'aiuto per il comando play per informazioni sugli input supportati.
sv_se: Ett spelkommando som lägger till låten som nästa att spela istället för senast. Läsa hjälp för play-kommandot för information om stödda ingångar.

source: A play command which skips any current song and plays immediately. Read help for the play command for information on supported inputs.
it_it: Un comando di riproduzione che salta qualsiasi brano corrente e riproduce immediatamente. Leggi l'aiuto per il comando di riproduzione per informazioni sugli input supportati.
sv_se: Ett play-kommando som hoppar över alla nuvarande låtar och spelar omedelbart. Läs hjälp för play-kommandot för information om stödda ingångar.

source: Restarts the current song at the given time. If time starts with + or - seek will be relative to current playback time. Time should be given in seconds, fractional seconds are accepted. Due to codec specifics in ffmpeg, this may not be accurate.
it_it: Riavvia il brano corrente al tempo specificato. Se il tempo inizia con + o - la ricerca sarà relativa al tempo di riproduzione corrente. Il tempo deve essere dato in secondi, i secondi frazionari sono accettati. A causa delle specifiche del codec in ffmpeg, questo potrebbe non essere accurato.
sv_se: Starta om den aktuella låten vid given tidpunkt. Om tiden börjar med + eller - sök kommer att vara i förhållande till aktuell uppspelningstid. Tid bör anges i sekunder, bråksekunderna accepteras. På grund av codec specifika i ffmpeg, detta kanske inte är korrekt.

source: Cannot use seek if there is nothing playing.
it_it: Impossibile usare la ricerca se non c'è niente di giocare.
sv_se: Kan inte använda söka om det inte finns något att spela.

source: Cannot use seek on current track, it has an unknown duration.
it_it: Impossibile usare la ricerca sulla traccia corrente, ha una durata sconosciuta.
sv_se: Kan inte använda sökningen på nuvarande spår, den har en okänd varaktighet.

source: Seeking is not supported for streams.
it_it: La ricerca non è supportata per gli streaming.
sv_se: Sökandet stöds inte för strömmar.

source: Cannot use seek without a time to position playback.
it_it: Impossibile usare la ricerca senza un tempo per posizionare la riproduzione.
sv_se: Kan inte använda söka utan tid för att placera uppspelning.
